// ScriptStruct ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.AnimBlueprintGeneratedConstantData
// Size: 0x4d0 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName __NameProperty_548; // 0x04(0x08)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FAnimNodeFunctionRef __StructProperty_549; // 0x10(0x20)
	struct FAnimNodeFunctionRef __StructProperty_550; // 0x30(0x20)
	struct FName __NameProperty_551; // 0x50(0x08)
	struct FName __NameProperty_552; // 0x58(0x08)
	struct FName __NameProperty_553; // 0x60(0x08)
	struct FAnimNodeFunctionRef __StructProperty_554; // 0x68(0x20)
	struct FAnimNodeFunctionRef __StructProperty_555; // 0x88(0x20)
	struct FName __NameProperty_556; // 0xa8(0x08)
	struct FName __NameProperty_557; // 0xb0(0x08)
	struct FName __NameProperty_558; // 0xb8(0x08)
	struct FName __NameProperty_559; // 0xc0(0x08)
	struct FName __NameProperty_560; // 0xc8(0x08)
	struct FAnimNodeFunctionRef __StructProperty_561; // 0xd0(0x20)
	struct FAnimNodeFunctionRef __StructProperty_562; // 0xf0(0x20)
	struct FName __NameProperty_563; // 0x110(0x08)
	struct FName __NameProperty_564; // 0x118(0x08)
	struct FAnimNodeFunctionRef __StructProperty_565; // 0x120(0x20)
	struct FAnimNodeFunctionRef __StructProperty_566; // 0x140(0x20)
	struct FName __NameProperty_567; // 0x160(0x08)
	struct FName __NameProperty_568; // 0x168(0x08)
	struct FAnimNodeFunctionRef __StructProperty_569; // 0x170(0x20)
	struct FName __NameProperty_570; // 0x190(0x08)
	struct FAnimNodeFunctionRef __StructProperty_571; // 0x198(0x20)
	struct FAnimNodeFunctionRef __StructProperty_572; // 0x1b8(0x20)
	struct FName __NameProperty_573; // 0x1d8(0x08)
	struct FAnimNodeFunctionRef __StructProperty_574; // 0x1e0(0x20)
	struct FName __NameProperty_575; // 0x200(0x08)
	struct FName __NameProperty_576; // 0x208(0x08)
	struct FAnimNodeFunctionRef __StructProperty_577; // 0x210(0x20)
	struct FAnimNodeFunctionRef __StructProperty_578; // 0x230(0x20)
	struct FName __NameProperty_579; // 0x250(0x08)
	struct FAnimNodeFunctionRef __StructProperty_580; // 0x258(0x20)
	struct FAnimNodeFunctionRef __StructProperty_581; // 0x278(0x20)
	enum class ESequenceEvalReinit __ByteProperty_582; // 0x298(0x01)
	enum class EAnimSyncMethod __EnumProperty_583; // 0x299(0x01)
	char pad_29A[0x2]; // 0x29a(0x02)
	struct FName __NameProperty_584; // 0x29c(0x08)
	char pad_2A4[0x4]; // 0x2a4(0x04)
	struct FAnimNodeFunctionRef __StructProperty_585; // 0x2a8(0x20)
	struct FName __NameProperty_586; // 0x2c8(0x08)
	struct FAnimNodeFunctionRef __StructProperty_587; // 0x2d0(0x20)
	struct FName __NameProperty_588; // 0x2f0(0x08)
	struct FAnimNodeFunctionRef __StructProperty_589; // 0x2f8(0x20)
	bool __BoolProperty_590; // 0x318(0x01)
	char pad_319[0x7]; // 0x319(0x07)
	struct FAnimNodeFunctionRef __StructProperty_591; // 0x320(0x20)
	struct FAnimNodeFunctionRef __StructProperty_592; // 0x340(0x20)
	struct FName __NameProperty_593; // 0x360(0x08)
	struct FName __NameProperty_594; // 0x368(0x08)
	struct FName __NameProperty_595; // 0x370(0x08)
	enum class ERefPoseType __ByteProperty_596; // 0x378(0x01)
	char pad_379[0x3]; // 0x379(0x03)
	float __FloatProperty_597; // 0x37c(0x04)
	struct FInputScaleBiasClampConstants __StructProperty_598; // 0x380(0x2c)
	float __FloatProperty_599; // 0x3ac(0x04)
	bool __BoolProperty_600; // 0x3b0(0x01)
	enum class EAnimSyncMethod __EnumProperty_601; // 0x3b1(0x01)
	enum class EAnimGroupRole __ByteProperty_602; // 0x3b2(0x01)
	char pad_3B3[0x5]; // 0x3b3(0x05)
	struct FAnimNodeFunctionRef __StructProperty_603; // 0x3b8(0x20)
	struct FName __NameProperty_604; // 0x3d8(0x08)
	int32_t __IntProperty_605; // 0x3e0(0x04)
	struct FName __NameProperty_606; // 0x3e4(0x08)
	int32_t __IntProperty_607; // 0x3ec(0x04)
	struct FName __NameProperty_608; // 0x3f0(0x08)
	int32_t __IntProperty_609; // 0x3f8(0x04)
	char pad_3FC[0x4]; // 0x3fc(0x04)
	struct FAnimNodeFunctionRef __StructProperty_610; // 0x400(0x20)
	struct FName __NameProperty_611; // 0x420(0x08)
	struct FName __NameProperty_612; // 0x428(0x08)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x430(0x80)
	struct FAnimSubsystem AnimBlueprintExtension_NodeRelevancy; // 0x4b0(0x08)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x4b8(0x18)
};

// ScriptStruct ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.AnimBlueprintGeneratedMutableData
// Size: 0x130 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x7]; // 0x01(0x07)
	struct UAnimSequenceBase* __AnimSequenceBase; // 0x08(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_1; // 0x10(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_2; // 0x18(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_3; // 0x20(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_4; // 0x28(0x08)
	float __FloatProperty_5; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_6; // 0x38(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_7; // 0x40(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_8; // 0x48(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_9; // 0x50(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_10; // 0x58(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_11; // 0x60(0x08)
	struct UBlendSpace* __BlendSpace_12; // 0x68(0x08)
	float __FloatProperty_13; // 0x70(0x04)
	float __FloatProperty_14; // 0x74(0x04)
	struct UBlendSpace* __BlendSpace_15; // 0x78(0x08)
	float __FloatProperty_16; // 0x80(0x04)
	float __FloatProperty_17; // 0x84(0x04)
	float __FloatProperty_18; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_19; // 0x90(0x08)
	float __FloatProperty_20; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_21; // 0xa0(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_22; // 0xa8(0x08)
	float __FloatProperty_23; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_24; // 0xb8(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_25; // 0xc0(0x08)
	float __FloatProperty_26; // 0xc8(0x04)
	char pad_CC[0x4]; // 0xcc(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_27; // 0xd0(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_28; // 0xd8(0x08)
	float __FloatProperty_29; // 0xe0(0x04)
	char pad_E4[0x4]; // 0xe4(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_30; // 0xe8(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_31; // 0xf0(0x08)
	float __FloatProperty_32; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_33; // 0x100(0x08)
	float __FloatProperty_34; // 0x108(0x04)
	char pad_10C[0x4]; // 0x10c(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_35; // 0x110(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_36; // 0x118(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_37; // 0x120(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_38; // 0x128(0x08)
};

