// AnimBlueprintGeneratedClass ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C
// Size: 0x3098 (Inherited: 0x350)
struct UABP_Retargeted_Layers_Base_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x350(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x358(0x130)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x488(0x08)
	struct FAnimSubsystemInstance_NodeRelevancy AnimBlueprintExtension_NodeRelevancy; // 0x490(0xa8)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x538(0x08)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x540(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0x560(0xc8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x628(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_15; // 0x648(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x668(0x40)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x6a8(0x128)
	struct FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting; // 0x7d0(0x120)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x8f0(0xe0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x9d0(0x128)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_2; // 0xaf8(0xf0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0xbe8(0xf0)
	struct FAnimNode_Root AnimGraphNode_Root_14; // 0xcd8(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0xcf8(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0xd38(0xe0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_15; // 0xe18(0x40)
	struct FAnimNode_Root AnimGraphNode_Root_13; // 0xe58(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0xe78(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0xeb8(0xe0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_14; // 0xf98(0x40)
	struct FAnimNode_Root AnimGraphNode_Root_12; // 0xfd8(0x20)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_13; // 0xff8(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x1038(0xe0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_12; // 0x1118(0x40)
	struct FAnimNode_Root AnimGraphNode_Root_11; // 0x1158(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x1178(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x11b8(0xe0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_11; // 0x1298(0x40)
	struct FAnimNode_Root AnimGraphNode_Root_10; // 0x12d8(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x12f8(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x1338(0xe0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_10; // 0x1418(0x40)
	struct FAnimNode_Root AnimGraphNode_Root_9; // 0x1458(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0x1478(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1540(0x108)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x1648(0xc8)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x1710(0x110)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x1820(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1848(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x1870(0x110)
	struct FAnimNode_Root AnimGraphNode_Root_8; // 0x1980(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x19a0(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x19c8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x19e8(0x20)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9; // 0x1a08(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1a48(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x1a68(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x1a88(0x20)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8; // 0x1aa8(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x1ae8(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x1b08(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x1bc0(0xe0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7; // 0x1ca0(0x40)
	struct FAnimNode_Root AnimGraphNode_Root_7; // 0x1ce0(0x20)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0x1d00(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x1d40(0xe0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0x1e20(0x40)
	struct FAnimNode_Root AnimGraphNode_Root_6; // 0x1e60(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1e80(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x1ec0(0xe0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0x1fa0(0x40)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_2; // 0x1fe0(0x160)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x2140(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x2160(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2180(0xc8)
	struct FAnimNode_Root AnimGraphNode_Root_5; // 0x2248(0x20)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x2268(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x22a8(0xe0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x2388(0x40)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping; // 0x23c8(0x160)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2528(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2548(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_4; // 0x2568(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x2588(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x25a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x25d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x25f8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x2620(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x2660(0x20)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x2680(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x26c0(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x26e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x2708(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x2730(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x2758(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x2798(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x27b8(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x27f8(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x2818(0xb8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x28d0(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x28f0(0xb8)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0x29a8(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x29c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x29f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x2a18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2a40(0x28)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x2a68(0x10)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2a78(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2b40(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x2b80(0x20)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2ba0(0x20)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2bc0(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2be0(0xb8)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c98(0x20)
	double AimPitch; // 0x2cb8(0x08)
	double AimYaw; // 0x2cc0(0x08)
	double K2Node_PropertyAccess_71; // 0x2cc8(0x08)
	double K2Node_PropertyAccess_70; // 0x2cd0(0x08)
	double K2Node_PropertyAccess_69; // 0x2cd8(0x08)
	double K2Node_PropertyAccess_68; // 0x2ce0(0x08)
	bool K2Node_PropertyAccess_67; // 0x2ce8(0x01)
	char pad_2CE9[0x7]; // 0x2ce9(0x07)
	struct FVector K2Node_PropertyAccess_66; // 0x2cf0(0x18)
	struct UPawnMovementComponent* K2Node_PropertyAccess_62; // 0x2d08(0x08)
	bool K2Node_PropertyAccess_57; // 0x2d10(0x01)
	bool K2Node_PropertyAccess_56; // 0x2d11(0x01)
	bool K2Node_PropertyAccess_55; // 0x2d12(0x01)
	char pad_2D13[0x5]; // 0x2d13(0x05)
	struct UAnimInstance* K2Node_PropertyAccess_42; // 0x2d18(0x08)
	double K2Node_PropertyAccess_33; // 0x2d20(0x08)
	struct FVector K2Node_PropertyAccess_32; // 0x2d28(0x18)
	struct FVector K2Node_PropertyAccess_31; // 0x2d40(0x18)
	struct FAnimStruct_CardinalDirections Walk_Cardinals; // 0x2d58(0x20)
	struct FAnimStruct_CardinalDirections Crouch_Walk_Cardinals; // 0x2d78(0x20)
	struct UAnimSequence* Idle_ADS; // 0x2d98(0x08)
	struct UAnimSequence* Idle_Hipfire; // 0x2da0(0x08)
	struct TArray<struct UAnimSequence*> Idle_Breaks; // 0x2da8(0x10)
	struct FAnimStruct_CardinalDirections Jog_Cardinals; // 0x2db8(0x20)
	struct FAnimStruct_CardinalDirections Jog_Pivot_Cardinals; // 0x2dd8(0x20)
	struct FAnimStruct_CardinalDirections Jog_Start_Cardinals; // 0x2df8(0x20)
	struct FAnimStruct_CardinalDirections Jog_Stop_Cardinals; // 0x2e18(0x20)
	struct UAnimSequence* Jump_Start; // 0x2e38(0x08)
	struct UAnimSequence* Jump_Apex; // 0x2e40(0x08)
	struct UAnimSequence* Jump_FallLand; // 0x2e48(0x08)
	struct UAnimSequence* Jump_RecoveryAdditive; // 0x2e50(0x08)
	struct UAnimSequence* Crouch_Idle; // 0x2e58(0x08)
	bool WantsIdleBreak; // 0x2e60(0x01)
	char pad_2E61[0x7]; // 0x2e61(0x07)
	double TimeUntilNextIdleBreak; // 0x2e68(0x08)
	int32_t CurrentIdleBreakIndex; // 0x2e70(0x04)
	char pad_2E74[0x4]; // 0x2e74(0x04)
	struct UAnimSequence* Aim_HipFirePose; // 0x2e78(0x08)
	struct UAnimSequence* Aim_HipFirePose_Crouch; // 0x2e80(0x08)
	double TurnInPlaceAnimTime; // 0x2e88(0x08)
	struct FVector2D PlayRateClampStartsPivots; // 0x2e90(0x10)
	struct FVector PivotStartingAcceleration; // 0x2ea0(0x18)
	struct UAimOffsetBlendSpace* IdleAimOffset; // 0x2eb8(0x08)
	struct FAnimStruct_CardinalDirections ADS_Start_Cardinals; // 0x2ec0(0x20)
	struct FAnimStruct_CardinalDirections Crouch_Start_Cardinals; // 0x2ee0(0x20)
	struct FAnimStruct_CardinalDirections ADS_Stop_Cardinals; // 0x2f00(0x20)
	struct FAnimStruct_CardinalDirections Crouch_Stop_Cardinals; // 0x2f20(0x20)
	struct FAnimStruct_CardinalDirections ADS_Pivot_Cardinals; // 0x2f40(0x20)
	struct FAnimStruct_CardinalDirections Crouch_Pivot_Cardinals; // 0x2f60(0x20)
	bool RaiseWeaponAfterFiringWhenCrouched; // 0x2f80(0x01)
	bool DisableHandIK; // 0x2f81(0x01)
	bool EnableLeftHandPoseOverride; // 0x2f82(0x01)
	char pad_2F83[0x5]; // 0x2f83(0x05)
	double RaiseWeaponAfterFiringDuration; // 0x2f88(0x08)
	double HipFireUpperBodyOverrideWeight; // 0x2f90(0x08)
	double IdleBreakDelayTime; // 0x2f98(0x08)
	struct UAnimSequence* Jump_StartLoop; // 0x2fa0(0x08)
	struct UAnimSequence* Jump_FallLoop; // 0x2fa8(0x08)
	double LandRecoveryAlpha; // 0x2fb0(0x08)
	double TimeFalling; // 0x2fb8(0x08)
	double HandIK_Right_Alpha; // 0x2fc0(0x08)
	double HandIK_Left_Alpha; // 0x2fc8(0x08)
	double StrideWarpingStartAlpha; // 0x2fd0(0x08)
	double StrideWarpingPivotAlpha; // 0x2fd8(0x08)
	double StrideWarpingCycleAlpha; // 0x2fe0(0x08)
	double TimeAtPivotStop; // 0x2fe8(0x08)
	double StrideWarpingBlendInDurationScaled; // 0x2ff0(0x08)
	double StrideWarpingBlendInStartOffset; // 0x2ff8(0x08)
	struct UAnimSequence* Crouch_Idle_Entry; // 0x3000(0x08)
	struct UAnimSequence* Crouch_Idle_Exit; // 0x3008(0x08)
	struct UAnimSequence* LeftHandPose_Override; // 0x3010(0x08)
	struct FName LocomotionDistanceCurveName; // 0x3018(0x08)
	struct FName JumpDistanceCurveName; // 0x3020(0x08)
	double AimOffsetBlendWeight; // 0x3028(0x08)
	struct UAimOffsetBlendSpace* RelaxedAimOffset; // 0x3030(0x08)
	struct FVector2D PlayRateClampCycle; // 0x3038(0x10)
	struct UAnimSequence* TurnInPlace_Left; // 0x3048(0x08)
	double LeftHandPoseOverrideWeight; // 0x3050(0x08)
	float Hand FKWeight; // 0x3058(0x04)
	char pad_305C[0x4]; // 0x305c(0x04)
	double TurnInPlaceRotationDirection; // 0x3060(0x08)
	struct UAnimSequence* TurnInPlace_Right; // 0x3068(0x08)
	struct UAnimSequence* Crouch_TurnInPlace_Left; // 0x3070(0x08)
	struct UAnimSequence* Crouch_TurnInPlace_Right; // 0x3078(0x08)
	double TurnInPlaceRecoveryDirection; // 0x3080(0x08)
	struct UAnimSequence* CrawlIdle; // 0x3088(0x08)
	double RightHandWeaponFixWeight; // 0x3090(0x08)

	void LeftHandPose_OverrideState(struct FPoseLink InputPose, struct FPoseLink& LeftHandPose_OverrideState); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.LeftHandPose_OverrideState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_SkeletalControls(struct FPoseLink InPose, struct FPoseLink& FullBody_SkeletalControls); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.FullBody_SkeletalControls // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_JumpStartLoopState(struct FPoseLink& FullBody_JumpStartLoopState); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.FullBody_JumpStartLoopState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_FallLoopState(struct FPoseLink& FullBody_FallLoopState); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.FullBody_FallLoopState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_FallLandState(struct FPoseLink& FullBody_FallLandState); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.FullBody_FallLandState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_JumpApexState(struct FPoseLink& FullBody_JumpApexState); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.FullBody_JumpApexState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_JumpStartState(struct FPoseLink& FullBody_JumpStartState); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.FullBody_JumpStartState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_Aiming(struct FPoseLink PreAimPose, double AimYaw, double AimPitch, struct FPoseLink& FullBody_Aiming); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.FullBody_Aiming // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_PivotState(struct FPoseLink& FullBody_PivotState); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.FullBody_PivotState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_StopState(struct FPoseLink& FullBody_StopState); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.FullBody_StopState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_CycleState(struct FPoseLink& FullBody_CycleState); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.FullBody_CycleState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_StartState(struct FPoseLink& FullBody_StartState); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.FullBody_StartState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_IdleState(struct FPoseLink& FullBody_IdleState); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.FullBody_IdleState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBodyAdditives(struct FPoseLink& FullBodyAdditives); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.FullBodyAdditives // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SetWeaponRetargetFixWeight(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.SetWeaponRetargetFixWeight // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SelectTurnInPlaceAnimation(double Direction, struct UAnimSequence*& Result); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.SelectTurnInPlaceAnimation // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2552560
	void SetLeftHandPoseOverrideWeight(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.SetLeftHandPoseOverrideWeight // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SetupIdleTransition(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.SetupIdleTransition // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	bool ShouldDistanceMatchStop(); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.ShouldDistanceMatchStop // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2552560
	double GetPredictedStopDistance(); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.GetPredictedStopDistance // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x2552560
	struct UAnimSequenceBase* GetDesiredPivotSequence(enum class AnimEnum_CardinalDirection InDirection); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.GetDesiredPivotSequence // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2552560
	struct UCharacterMovementComponent* GetMovementComponent(); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.GetMovementComponent // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2552560
	void UpdateSkelControlData(); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.UpdateSkelControlData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateJumpFallData(double DeltaTime); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.UpdateJumpFallData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void Land Recovery Start(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.Land Recovery Start // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateFallLandAnim(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.UpdateFallLandAnim // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SetUpFallLandAnim(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.SetUpFallLandAnim // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void ChooseIdleBreakDelayTime(); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.ChooseIdleBreakDelayTime // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void ProcessIdleBreakTransitionLogic(double DeltaTime); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.ProcessIdleBreakTransitionLogic // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void ResetIdleBreakTransitionLogic(); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.ResetIdleBreakTransitionLogic // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	bool CanPlayIdleBreak(); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.CanPlayIdleBreak // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2552560
	void Update Blend Weight Data(double DeltaTime); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.Update Blend Weight Data // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	struct UABP_Retargeted_Base_C* GetMainAnimBPThreadSafe(); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.GetMainAnimBPThreadSafe // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2552560
	void UpdateHipFireRaiseWeaponPose(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.UpdateHipFireRaiseWeaponPose // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateTurnInPlaceRecoveryAnim(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.UpdateTurnInPlaceRecoveryAnim // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SetUpTurnInPlaceRecoveryState(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.SetUpTurnInPlaceRecoveryState // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SetUpTurnInPlaceRotationState(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.SetUpTurnInPlaceRotationState // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateTurnInPlaceAnim(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.UpdateTurnInPlaceAnim // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SetupTurnInPlaceAnim(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.SetupTurnInPlaceAnim // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateIdleState(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.UpdateIdleState // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SetUpIdleState(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.SetUpIdleState // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdatePivotAnim(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.UpdatePivotAnim // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SetUpPivotAnim(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.SetUpPivotAnim // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.BlueprintThreadSafeUpdateAnimation // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateStopAnim(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.UpdateStopAnim // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SetUpStopAnim(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.SetUpStopAnim // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateCycleAnim(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.UpdateCycleAnim // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateStartAnim(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.UpdateStartAnim // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SetUpStartAnim(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.SetUpStartAnim // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SetUpIdleBreakAnim(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.SetUpIdleBreakAnim // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateIdleAnim(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.UpdateIdleAnim // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Layers_Base_AnimGraphNode_TransitionResult_8883DD32428938A221C4CAB160D96151(); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Layers_Base_AnimGraphNode_TransitionResult_8883DD32428938A221C4CAB160D96151 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Layers_Base_AnimGraphNode_OrientationWarping_563C71E94307EE003F9060A1205B59D5(); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Layers_Base_AnimGraphNode_OrientationWarping_563C71E94307EE003F9060A1205B59D5 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Layers_Base_AnimGraphNode_OrientationWarping_E1F011364FA43C44CF7AA8A604792D7B(); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Layers_Base_AnimGraphNode_OrientationWarping_E1F011364FA43C44CF7AA8A604792D7B // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Layers_Base_AnimGraphNode_TransitionResult_928A2DA444644F43631A96BDB9789DDD(); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Layers_Base_AnimGraphNode_TransitionResult_928A2DA444644F43631A96BDB9789DDD // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Layers_Base_AnimGraphNode_TransitionResult_EE7703D64DB33789F541B4AE34EE8CC1(); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Layers_Base_AnimGraphNode_TransitionResult_EE7703D64DB33789F541B4AE34EE8CC1 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Layers_Base_AnimGraphNode_TransitionResult_ABB49C474FE4392147F928AB2361D7D4(); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Layers_Base_AnimGraphNode_TransitionResult_ABB49C474FE4392147F928AB2361D7D4 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Layers_Base_AnimGraphNode_TransitionResult_047333E94FBE26FE3453D898B29E9ECB(); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Layers_Base_AnimGraphNode_TransitionResult_047333E94FBE26FE3453D898B29E9ECB // (BlueprintEvent) // @ game+0x2552560
	void ExecuteUbergraph_ABP_Retargeted_Layers_Base(int32_t EntryPoint); // Function ABP_Retargeted_Layers_Base.ABP_Retargeted_Layers_Base_C.ExecuteUbergraph_ABP_Retargeted_Layers_Base // (Final|UbergraphFunction) // @ game+0x2552560
};

