// AnimBlueprintGeneratedClass ABP_ItemAnimLayersBase.ABP_ItemAnimLayersBase_C
// Size: 0x40f0 (Inherited: 0x350)
struct UABP_ItemAnimLayersBase_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x350(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x358(0x130)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x488(0x08)
	struct FAnimSubsystemInstance_NodeRelevancy AnimBlueprintExtension_NodeRelevancy; // 0x490(0xa8)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x538(0x08)
	struct FAnimNode_Root AnimGraphNode_Root_15; // 0x540(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0x560(0xc8)
	struct FAnimNode_Root AnimGraphNode_Root_14; // 0x628(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0x648(0xc8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x710(0x20)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x730(0x270)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x9a0(0x270)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0xc10(0x20)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0xc30(0xf8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0xd28(0x128)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0xe50(0xf0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xf40(0x128)
	struct FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting; // 0x1068(0x120)
	struct FAnimNode_Root AnimGraphNode_Root_13; // 0x1188(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x11a8(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x11e8(0xe0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_15; // 0x12c8(0x40)
	struct FAnimNode_Root AnimGraphNode_Root_12; // 0x1308(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1328(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x1368(0xe0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_14; // 0x1448(0x40)
	struct FAnimNode_Root AnimGraphNode_Root_11; // 0x1488(0x20)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_13; // 0x14a8(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x14e8(0xe0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_12; // 0x15c8(0x40)
	struct FAnimNode_Root AnimGraphNode_Root_10; // 0x1608(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x1628(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x1668(0xe0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_11; // 0x1748(0x40)
	struct FAnimNode_Root AnimGraphNode_Root_9; // 0x1788(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x17a8(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x17e8(0xe0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_10; // 0x18c8(0x40)
	struct FAnimNode_Root AnimGraphNode_Root_8; // 0x1908(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1928(0xc8)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x19f0(0x110)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1b00(0x108)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x1c08(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x1cd0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1cf8(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x1d20(0x110)
	struct FAnimNode_Root AnimGraphNode_Root_7; // 0x1e30(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x1e50(0x28)
	struct FAnimNode_StrideWarping AnimGraphNode_StrideWarping_4; // 0x1e78(0x238)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x20b0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x20d0(0x20)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_4; // 0x20f0(0x160)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9; // 0x2250(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x2290(0x20)
	struct FAnimNode_StrideWarping AnimGraphNode_StrideWarping_3; // 0x22b0(0x238)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x24e8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x2508(0x20)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_3; // 0x2528(0x160)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8; // 0x2688(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x26c8(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x26e8(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x27a0(0xe0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7; // 0x2880(0x40)
	struct FAnimNode_Root AnimGraphNode_Root_6; // 0x28c0(0x20)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0x28e0(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x2920(0xe0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0x2a00(0x40)
	struct FAnimNode_Root AnimGraphNode_Root_5; // 0x2a40(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x2a60(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x2aa0(0xe0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0x2b80(0x40)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_2; // 0x2bc0(0x160)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x2d20(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x2d40(0x20)
	struct FAnimNode_StrideWarping AnimGraphNode_StrideWarping_2; // 0x2d60(0x238)
	struct FAnimNode_Root AnimGraphNode_Root_4; // 0x2f98(0x20)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x2fb8(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x2ff8(0xe0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x30d8(0x40)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping; // 0x3118(0x160)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3278(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3298(0x20)
	struct FAnimNode_StrideWarping AnimGraphNode_StrideWarping; // 0x32b8(0x238)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x34f0(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x3510(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x3538(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x3560(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x3588(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x35b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x35d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x3600(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x3628(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x3668(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x3688(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x36c8(0x20)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x36e8(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x3728(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x3748(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x3770(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x3798(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x37c0(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x3800(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x3820(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x3860(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x3880(0xb8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x3938(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x3958(0xb8)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0x3a10(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x3a30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x3a58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x3a80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3aa8(0x28)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x3ad0(0x10)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3ae0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3ba8(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x3be8(0x20)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x3c08(0x20)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3c28(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3c48(0xb8)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x3d00(0x20)
	double AimPitch; // 0x3d20(0x08)
	double AimYaw; // 0x3d28(0x08)
	double K2Node_PropertyAccess_69; // 0x3d30(0x08)
	double K2Node_PropertyAccess_68; // 0x3d38(0x08)
	double K2Node_PropertyAccess_67; // 0x3d40(0x08)
	double K2Node_PropertyAccess_66; // 0x3d48(0x08)
	bool K2Node_PropertyAccess_65; // 0x3d50(0x01)
	char pad_3D51[0x7]; // 0x3d51(0x07)
	struct FVector K2Node_PropertyAccess_64; // 0x3d58(0x18)
	struct UPawnMovementComponent* K2Node_PropertyAccess_60; // 0x3d70(0x08)
	bool K2Node_PropertyAccess_55; // 0x3d78(0x01)
	bool K2Node_PropertyAccess_54; // 0x3d79(0x01)
	bool K2Node_PropertyAccess_53; // 0x3d7a(0x01)
	char pad_3D7B[0x5]; // 0x3d7b(0x05)
	struct UAnimInstance* K2Node_PropertyAccess_40; // 0x3d80(0x08)
	double K2Node_PropertyAccess_31; // 0x3d88(0x08)
	struct FVector K2Node_PropertyAccess_30; // 0x3d90(0x18)
	struct FVector K2Node_PropertyAccess_29; // 0x3da8(0x18)
	struct FAnimStruct_CardinalDirections Walk_Cardinals; // 0x3dc0(0x20)
	struct FAnimStruct_CardinalDirections Crouch_Walk_Cardinals; // 0x3de0(0x20)
	struct UAnimSequence* Idle_ADS; // 0x3e00(0x08)
	struct UAnimSequence* Idle_Hipfire; // 0x3e08(0x08)
	struct TArray<struct UAnimSequence*> Idle_Breaks; // 0x3e10(0x10)
	struct FAnimStruct_CardinalDirections Jog_Cardinals; // 0x3e20(0x20)
	struct FAnimStruct_CardinalDirections Jog_Pivot_Cardinals; // 0x3e40(0x20)
	struct FAnimStruct_CardinalDirections Jog_Start_Cardinals; // 0x3e60(0x20)
	struct FAnimStruct_CardinalDirections Jog_Stop_Cardinals; // 0x3e80(0x20)
	struct UAnimSequence* Jump_Start; // 0x3ea0(0x08)
	struct UAnimSequence* Jump_Apex; // 0x3ea8(0x08)
	struct UAnimSequence* Jump_FallLand; // 0x3eb0(0x08)
	struct UAnimSequence* Jump_RecoveryAdditive; // 0x3eb8(0x08)
	struct UAnimSequence* Crouch_Idle; // 0x3ec0(0x08)
	bool WantsIdleBreak; // 0x3ec8(0x01)
	char pad_3EC9[0x7]; // 0x3ec9(0x07)
	double TimeUntilNextIdleBreak; // 0x3ed0(0x08)
	int32_t CurrentIdleBreakIndex; // 0x3ed8(0x04)
	char pad_3EDC[0x4]; // 0x3edc(0x04)
	struct UAnimSequence* Aim_HipFirePose; // 0x3ee0(0x08)
	struct UAnimSequence* Aim_HipFirePose_Crouch; // 0x3ee8(0x08)
	double TurnInPlaceAnimTime; // 0x3ef0(0x08)
	struct FVector2D PlayRateClampStartsPivots; // 0x3ef8(0x10)
	struct FVector PivotStartingAcceleration; // 0x3f08(0x18)
	struct UAimOffsetBlendSpace* IdleAimOffset; // 0x3f20(0x08)
	struct FAnimStruct_CardinalDirections ADS_Start_Cardinals; // 0x3f28(0x20)
	struct FAnimStruct_CardinalDirections Crouch_Start_Cardinals; // 0x3f48(0x20)
	struct FAnimStruct_CardinalDirections ADS_Stop_Cardinals; // 0x3f68(0x20)
	struct FAnimStruct_CardinalDirections Crouch_Stop_Cardinals; // 0x3f88(0x20)
	struct FAnimStruct_CardinalDirections ADS_Pivot_Cardinals; // 0x3fa8(0x20)
	struct FAnimStruct_CardinalDirections Crouch_Pivot_Cardinals; // 0x3fc8(0x20)
	bool RaiseWeaponAfterFiringWhenCrouched; // 0x3fe8(0x01)
	bool DisableHandIK; // 0x3fe9(0x01)
	bool EnableLeftHandPoseOverride; // 0x3fea(0x01)
	char pad_3FEB[0x5]; // 0x3feb(0x05)
	double RaiseWeaponAfterFiringDuration; // 0x3ff0(0x08)
	double HipFireUpperBodyOverrideWeight; // 0x3ff8(0x08)
	double IdleBreakDelayTime; // 0x4000(0x08)
	struct UAnimSequence* Jump_StartLoop; // 0x4008(0x08)
	struct UAnimSequence* Jump_FallLoop; // 0x4010(0x08)
	double LandRecoveryAlpha; // 0x4018(0x08)
	double TimeFalling; // 0x4020(0x08)
	double HandIK_Right_Alpha; // 0x4028(0x08)
	double HandIK_Left_Alpha; // 0x4030(0x08)
	double StrideWarpingStartAlpha; // 0x4038(0x08)
	double StrideWarpingPivotAlpha; // 0x4040(0x08)
	double StrideWarpingCycleAlpha; // 0x4048(0x08)
	double TimeAtPivotStop; // 0x4050(0x08)
	double StrideWarpingBlendInDurationScaled; // 0x4058(0x08)
	double StrideWarpingBlendInStartOffset; // 0x4060(0x08)
	struct UAnimSequence* Crouch_Idle_Entry; // 0x4068(0x08)
	struct UAnimSequence* Crouch_Idle_Exit; // 0x4070(0x08)
	struct UAnimSequence* LeftHandPose_Override; // 0x4078(0x08)
	struct FName LocomotionDistanceCurveName; // 0x4080(0x08)
	struct FName JumpDistanceCurveName; // 0x4088(0x08)
	double AimOffsetBlendWeight; // 0x4090(0x08)
	struct UAimOffsetBlendSpace* RelaxedAimOffset; // 0x4098(0x08)
	struct FVector2D PlayRateClampCycle; // 0x40a0(0x10)
	struct UAnimSequence* TurnInPlace_Left; // 0x40b0(0x08)
	double LeftHandPoseOverrideWeight; // 0x40b8(0x08)
	float Hand FKWeight; // 0x40c0(0x04)
	char pad_40C4[0x4]; // 0x40c4(0x04)
	double TurnInPlaceRotationDirection; // 0x40c8(0x08)
	struct UAnimSequence* TurnInPlace_Right; // 0x40d0(0x08)
	struct UAnimSequence* Crouch_TurnInPlace_Left; // 0x40d8(0x08)
	struct UAnimSequence* Crouch_TurnInPlace_Right; // 0x40e0(0x08)
	double TurnInPlaceRecoveryDirection; // 0x40e8(0x08)

	void LeftHandPose_OverrideState(struct FPoseLink InputPose, struct FPoseLink& LeftHandPose_OverrideState); // Function ABP_ItemAnimLayersBase.ABP_ItemAnimLayersBase_C.LeftHandPose_OverrideState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_SkeletalControls(struct FPoseLink InPose, struct FPoseLink& FullBody_SkeletalControls); // Function ABP_ItemAnimLayersBase.ABP_ItemAnimLayersBase_C.FullBody_SkeletalControls // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_JumpStartLoopState(struct FPoseLink& FullBody_JumpStartLoopState); // Function ABP_ItemAnimLayersBase.ABP_ItemAnimLayersBase_C.FullBody_JumpStartLoopState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_FallLoopState(struct FPoseLink& FullBody_FallLoopState); // Function ABP_ItemAnimLayersBase.ABP_ItemAnimLayersBase_C.FullBody_FallLoopState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
