// ScriptStruct ABP_ItemAnimLayersBase.ABP_ItemAnimLayersBase_C.AnimBlueprintGeneratedConstantData
// Size: 0x4c0 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName __NameProperty_586; // 0x04(0x08)
	struct FName __NameProperty_587; // 0x0c(0x08)
	struct FName __NameProperty_588; // 0x14(0x08)
	struct FName __NameProperty_589; // 0x1c(0x08)
	struct FName __NameProperty_590; // 0x24(0x08)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct FAnimNodeFunctionRef __StructProperty_591; // 0x30(0x20)
	struct FAnimNodeFunctionRef __StructProperty_592; // 0x50(0x20)
	struct FName __NameProperty_593; // 0x70(0x08)
	struct FName __NameProperty_594; // 0x78(0x08)
	struct FName __NameProperty_595; // 0x80(0x08)
	struct FName __NameProperty_596; // 0x88(0x08)
	struct FName __NameProperty_597; // 0x90(0x08)
	struct FAnimNodeFunctionRef __StructProperty_598; // 0x98(0x20)
	struct FAnimNodeFunctionRef __StructProperty_599; // 0xb8(0x20)
	struct FName __NameProperty_600; // 0xd8(0x08)
	struct FName __NameProperty_601; // 0xe0(0x08)
	struct FAnimNodeFunctionRef __StructProperty_602; // 0xe8(0x20)
	struct FAnimNodeFunctionRef __StructProperty_603; // 0x108(0x20)
	struct FName __NameProperty_604; // 0x128(0x08)
	struct FName __NameProperty_605; // 0x130(0x08)
	struct FAnimNodeFunctionRef __StructProperty_606; // 0x138(0x20)
	struct FName __NameProperty_607; // 0x158(0x08)
	struct FAnimNodeFunctionRef __StructProperty_608; // 0x160(0x20)
	struct FAnimNodeFunctionRef __StructProperty_609; // 0x180(0x20)
	struct FName __NameProperty_610; // 0x1a0(0x08)
	struct FAnimNodeFunctionRef __StructProperty_611; // 0x1a8(0x20)
	struct FName __NameProperty_612; // 0x1c8(0x08)
	struct FAnimNodeFunctionRef __StructProperty_613; // 0x1d0(0x20)
	struct FName __NameProperty_614; // 0x1f0(0x08)
	int32_t __IntProperty_615; // 0x1f8(0x04)
	char pad_1FC[0x4]; // 0x1fc(0x04)
	struct FAnimNodeFunctionRef __StructProperty_616; // 0x200(0x20)
	struct FAnimNodeFunctionRef __StructProperty_617; // 0x220(0x20)
	struct FName __NameProperty_618; // 0x240(0x08)
	struct FAnimNodeFunctionRef __StructProperty_619; // 0x248(0x20)
	struct FAnimNodeFunctionRef __StructProperty_620; // 0x268(0x20)
	enum class ESequenceEvalReinit __ByteProperty_621; // 0x288(0x01)
	enum class EAnimSyncMethod __EnumProperty_622; // 0x289(0x01)
	char pad_28A[0x2]; // 0x28a(0x02)
	struct FName __NameProperty_623; // 0x28c(0x08)
	char pad_294[0x4]; // 0x294(0x04)
	struct FAnimNodeFunctionRef __StructProperty_624; // 0x298(0x20)
	struct FName __NameProperty_625; // 0x2b8(0x08)
	struct FAnimNodeFunctionRef __StructProperty_626; // 0x2c0(0x20)
	struct FName __NameProperty_627; // 0x2e0(0x08)
	struct FAnimNodeFunctionRef __StructProperty_628; // 0x2e8(0x20)
	bool __BoolProperty_629; // 0x308(0x01)
	char pad_309[0x7]; // 0x309(0x07)
	struct FAnimNodeFunctionRef __StructProperty_630; // 0x310(0x20)
	struct FAnimNodeFunctionRef __StructProperty_631; // 0x330(0x20)
	struct FName __NameProperty_632; // 0x350(0x08)
	struct FName __NameProperty_633; // 0x358(0x08)
	struct FName __NameProperty_634; // 0x360(0x08)
	enum class ERefPoseType __ByteProperty_635; // 0x368(0x01)
	char pad_369[0x3]; // 0x369(0x03)
	float __FloatProperty_636; // 0x36c(0x04)
	struct FInputScaleBiasClampConstants __StructProperty_637; // 0x370(0x2c)
	float __FloatProperty_638; // 0x39c(0x04)
	bool __BoolProperty_639; // 0x3a0(0x01)
	enum class EAnimSyncMethod __EnumProperty_640; // 0x3a1(0x01)
	enum class EAnimGroupRole __ByteProperty_641; // 0x3a2(0x01)
	char pad_3A3[0x5]; // 0x3a3(0x05)
	struct FAnimNodeFunctionRef __StructProperty_642; // 0x3a8(0x20)
	struct FName __NameProperty_643; // 0x3c8(0x08)
	int32_t __IntProperty_644; // 0x3d0(0x04)
	struct FName __NameProperty_645; // 0x3d4(0x08)
	int32_t __IntProperty_646; // 0x3dc(0x04)
	struct FName __NameProperty_647; // 0x3e0(0x08)
	int32_t __IntProperty_648; // 0x3e8(0x04)
	char pad_3EC[0x4]; // 0x3ec(0x04)
	struct FAnimNodeFunctionRef __StructProperty_649; // 0x3f0(0x20)
	struct FName __NameProperty_650; // 0x410(0x08)
	struct FName __NameProperty_651; // 0x418(0x08)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x420(0x80)
	struct FAnimSubsystem AnimBlueprintExtension_NodeRelevancy; // 0x4a0(0x08)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x4a8(0x18)
};

// ScriptStruct ABP_ItemAnimLayersBase.ABP_ItemAnimLayersBase_C.AnimBlueprintGeneratedMutableData
// Size: 0x130 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x7]; // 0x01(0x07)
	struct UAnimSequenceBase* __AnimSequenceBase; // 0x08(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_1; // 0x10(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_2; // 0x18(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_3; // 0x20(0x08)
	float __FloatProperty_4; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_5; // 0x30(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_6; // 0x38(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_7; // 0x40(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_8; // 0x48(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_9; // 0x50(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_10; // 0x58(0x08)
	struct UBlendSpace* __BlendSpace_11; // 0x60(0x08)
	float __FloatProperty_12; // 0x68(0x04)
	float __FloatProperty_13; // 0x6c(0x04)
	struct UBlendSpace* __BlendSpace_14; // 0x70(0x08)
	float __FloatProperty_15; // 0x78(0x04)
	float __FloatProperty_16; // 0x7c(0x04)
	float __FloatProperty_17; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_18; // 0x88(0x08)
	float __FloatProperty_19; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_20; // 0x98(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_21; // 0xa0(0x08)
	float __FloatProperty_22; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_23; // 0xb0(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_24; // 0xb8(0x08)
	float __FloatProperty_25; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_26; // 0xc8(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_27; // 0xd0(0x08)
	float __FloatProperty_28; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_29; // 0xe0(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_30; // 0xe8(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_31; // 0xf0(0x08)
	float __FloatProperty_32; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_33; // 0x100(0x08)
	float __FloatProperty_34; // 0x108(0x04)
	char pad_10C[0x4]; // 0x10c(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_35; // 0x110(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_36; // 0x118(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_37; // 0x120(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_38; // 0x128(0x08)
};

