// ScriptStruct ABP_Retargeted_Base.ABP_Retargeted_Base_C.AnimBlueprintGeneratedConstantData
// Size: 0x330 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName __NameProperty_318; // 0x04(0x08)
	struct FName __NameProperty_319; // 0x0c(0x08)
	struct FName __NameProperty_320; // 0x14(0x08)
	struct FName __NameProperty_321; // 0x1c(0x08)
	struct FName __NameProperty_322; // 0x24(0x08)
	struct FName __NameProperty_323; // 0x2c(0x08)
	struct FName __NameProperty_324; // 0x34(0x08)
	struct FName __NameProperty_325; // 0x3c(0x08)
	struct FName __NameProperty_326; // 0x44(0x08)
	struct FName __NameProperty_327; // 0x4c(0x08)
	struct FName __NameProperty_328; // 0x54(0x08)
	struct FName __NameProperty_329; // 0x5c(0x08)
	struct FName __NameProperty_330; // 0x64(0x08)
	struct FName __NameProperty_331; // 0x6c(0x08)
	struct FName __NameProperty_332; // 0x74(0x08)
	struct FName __NameProperty_333; // 0x7c(0x08)
	enum class ERefPoseType __ByteProperty_334; // 0x84(0x01)
	char pad_85[0x3]; // 0x85(0x03)
	struct FName __NameProperty_335; // 0x88(0x08)
	int32_t __IntProperty_336; // 0x90(0x04)
	struct FName __NameProperty_337; // 0x94(0x08)
	int32_t __IntProperty_338; // 0x9c(0x04)
	struct FName __NameProperty_339; // 0xa0(0x08)
	int32_t __IntProperty_340; // 0xa8(0x04)
	struct FName __NameProperty_341; // 0xac(0x08)
	int32_t __IntProperty_342; // 0xb4(0x04)
	struct FName __NameProperty_343; // 0xb8(0x08)
	int32_t __IntProperty_344; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
	struct FAnimNodeFunctionRef __StructProperty_345; // 0xc8(0x20)
	struct FAnimNodeFunctionRef __StructProperty_346; // 0xe8(0x20)
	struct FName __NameProperty_347; // 0x108(0x08)
	int32_t __IntProperty_348; // 0x110(0x04)
	char pad_114[0x4]; // 0x114(0x04)
	struct FAnimNodeFunctionRef __StructProperty_349; // 0x118(0x20)
	struct FName __NameProperty_350; // 0x138(0x08)
	int32_t __IntProperty_351; // 0x140(0x04)
	struct FName __NameProperty_352; // 0x144(0x08)
	int32_t __IntProperty_353; // 0x14c(0x04)
	struct UBlendSpace* __BlendSpace_354; // 0x150(0x08)
	float __FloatProperty_355; // 0x158(0x04)
	float __FloatProperty_356; // 0x15c(0x04)
	bool __BoolProperty_357; // 0x160(0x01)
	enum class EAnimSyncMethod __EnumProperty_358; // 0x161(0x01)
	enum class EAnimGroupRole __ByteProperty_359; // 0x162(0x01)
	char pad_163[0x5]; // 0x163(0x05)
	struct FAnimNodeFunctionRef __StructProperty_360; // 0x168(0x20)
	struct FAnimNodeFunctionRef __StructProperty_361; // 0x188(0x20)
	struct FName __NameProperty_362; // 0x1a8(0x08)
	int32_t __IntProperty_363; // 0x1b0(0x04)
	char pad_1B4[0x4]; // 0x1b4(0x04)
	struct FAnimNodeFunctionRef __StructProperty_364; // 0x1b8(0x20)
	struct FName __NameProperty_365; // 0x1d8(0x08)
	struct FName __NameProperty_366; // 0x1e0(0x08)
	int32_t __IntProperty_367; // 0x1e8(0x04)
	char pad_1EC[0x4]; // 0x1ec(0x04)
	struct FAnimNodeFunctionRef __StructProperty_368; // 0x1f0(0x20)
	struct FAnimNodeFunctionRef __StructProperty_369; // 0x210(0x20)
	struct FAnimSubsystem_Tag AnimBlueprintExtension_Tag; // 0x230(0x60)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x290(0x80)
	struct FAnimSubsystem AnimBlueprintExtension_NodeRelevancy; // 0x310(0x08)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x318(0x18)
};

// ScriptStruct ABP_Retargeted_Base.ABP_Retargeted_Base_C.AnimBlueprintGeneratedMutableData
// Size: 0x10 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x3]; // 0x01(0x03)
	float __FloatProperty; // 0x04(0x04)
	float __FloatProperty_1; // 0x08(0x04)
	float __FloatProperty_2; // 0x0c(0x04)
};

