// AnimBlueprintGeneratedClass ABP_Terror_Base.ABP_Terror_Base_C
// Size: 0x2ded (Inherited: 0x370)
struct UABP_Terror_Base_C : ULyraAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x370(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x378(0x14)
	char pad_38C[0x4]; // 0x38c(0x04)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Tag; // 0x390(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x398(0x08)
	struct FAnimSubsystemInstance_NodeRelevancy AnimBlueprintExtension_NodeRelevancy; // 0x3a0(0xa8)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x448(0x08)
	struct FAnimNode_Root AnimGraphNode_Root_15; // 0x450(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0x470(0xc8)
	struct FAnimNode_Root AnimGraphNode_Root_14; // 0x538(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_13; // 0x558(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_12; // 0x578(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_11; // 0x598(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_10; // 0x5b8(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_9; // 0x5d8(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0x5f8(0xc8)
	struct FAnimNode_Root AnimGraphNode_Root_8; // 0x6c0(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_7; // 0x6e0(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_6; // 0x700(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_5; // 0x720(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_4; // 0x740(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x760(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0x780(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x7a0(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x7e8(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x8f0(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x918(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x960(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x988(0x128)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0xab0(0x128)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0xbd8(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0xce0(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0xd08(0xc8)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0xdd0(0xd0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0xea0(0x48)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xee8(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0xfb0(0xa8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x1058(0x128)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x1180(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x11a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x11d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x11f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x1220(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x1248(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x1270(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x1298(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x12c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x12e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x1310(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x1338(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x1360(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x1388(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x13b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x13d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x1400(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x1428(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x1450(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x1478(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x14a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x14c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x14f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x1518(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x1540(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x1568(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_13; // 0x1590(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1638(0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_12; // 0x1658(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x1700(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x1720(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_11; // 0x1748(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x17f0(0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_10; // 0x1810(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x18b8(0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_9; // 0x18d8(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x1980(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x19a0(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x19c8(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x1a90(0x68)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_8; // 0x1af8(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1ba0(0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_7; // 0x1bc0(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x1c68(0x20)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x1c88(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x1d50(0x68)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_6; // 0x1db8(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x1e60(0x20)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x1e80(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1f48(0x68)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_5; // 0x1fb0(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2058(0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_4; // 0x2078(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2120(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2140(0xb8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x21f8(0x128)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x2320(0x128)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3; // 0x2448(0xa8)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x24f0(0x20)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2510(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x25d8(0x48)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2; // 0x2620(0xa8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x26c8(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x27f0(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x2810(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2838(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x2860(0xe0)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x2940(0x48)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x2988(0x10)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x2998(0xa8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2a40(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2a88(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2aa8(0x108)
	struct UPawnMovementComponent* K2Node_PropertyAccess_12; // 0x2bb0(0x08)
	double K2Node_PropertyAccess_11; // 0x2bb8(0x08)
	double K2Node_PropertyAccess_10; // 0x2bc0(0x08)
	bool K2Node_PropertyAccess_9; // 0x2bc8(0x01)
	enum class EMovementMode K2Node_PropertyAccess_8; // 0x2bc9(0x01)
	bool K2Node_PropertyAccess_7; // 0x2bca(0x01)
	bool K2Node_PropertyAccess_6; // 0x2bcb(0x01)
	char pad_2BCC[0x4]; // 0x2bcc(0x04)
	struct FVector K2Node_PropertyAccess_5; // 0x2bd0(0x18)
	struct FVector K2Node_PropertyAccess_4; // 0x2be8(0x18)
	struct FRotator K2Node_PropertyAccess_3; // 0x2c00(0x18)
	struct FVector K2Node_PropertyAccess_2; // 0x2c18(0x18)
	struct FVector K2Node_PropertyAccess; // 0x2c30(0x18)
	double __CustomProperty_AimPitch_867C9E8D430299B4C6CA7EA173C50718; // 0x2c48(0x08)
	double __CustomProperty_AimYaw_867C9E8D430299B4C6CA7EA173C50718; // 0x2c50(0x08)
	bool __CustomProperty_isMoving2D_C15BF828480A7E8E64FB7C9C3A39D290; // 0x2c58(0x01)
	bool __CustomProperty_isCrouching_C15BF828480A7E8E64FB7C9C3A39D290; // 0x2c59(0x01)
	bool GameplayTag_IsADS; // 0x2c5a(0x01)
	bool GameplayTag_IsFiring; // 0x2c5b(0x01)
	char pad_2C5C[0x4]; // 0x2c5c(0x04)
	struct FVector WorldLocation; // 0x2c60(0x18)
	double DisplacementSinceLastUpdate; // 0x2c78(0x08)
	struct FRotator WorldRotation; // 0x2c80(0x18)
	double RootYawOffset; // 0x2c98(0x08)
	double YawDeltaSinceLastUpdate; // 0x2ca0(0x08)
	struct FVector LocalAcceleration2D; // 0x2ca8(0x18)
	bool HasAcceleration; // 0x2cc0(0x01)
	bool IsOnGround; // 0x2cc1(0x01)
	bool IsCrouching; // 0x2cc2(0x01)
	bool LinkedLayerChanged; // 0x2cc3(0x01)
	bool IsFirstUpdate; // 0x2cc4(0x01)
	char pad_2CC5[0x3]; // 0x2cc5(0x03)
	struct FVector WorldVelocity; // 0x2cc8(0x18)
	struct FVector LocalVelocity2D; // 0x2ce0(0x18)
	struct FFloatSpringState RootYawOffsetSpringState; // 0x2cf8(0x0c)
	char pad_2D04[0x4]; // 0x2d04(0x04)
	double TurnYawCurveValue; // 0x2d08(0x08)
	enum class AnimEnum_CardinalDirection StartDirection; // 0x2d10(0x01)
	char pad_2D11[0x7]; // 0x2d11(0x07)
	double LocalVelocityDirectionAngle; // 0x2d18(0x08)
	double CardinalDirectionDeadZone; // 0x2d20(0x08)
	double LocalVelocityDirectionAngleWithOffset; // 0x2d28(0x08)
	enum class AnimEnum_CardinalDirection LocalVelocityDirection; // 0x2d30(0x01)
	enum class AnimEnum_CardinalDirection LocalVelocityDirectionNoOffset; // 0x2d31(0x01)
	char pad_2D32[0x6]; // 0x2d32(0x06)
	double DisplacementSpeed; // 0x2d38(0x08)
	bool HasVelocity; // 0x2d40(0x01)
	enum class AnimEnum_CardinalDirection PivotInitialDirection; // 0x2d41(0x01)
	bool CrouchStateChange; // 0x2d42(0x01)
	bool ADSStateChanged; // 0x2d43(0x01)
	bool WasADSLastUpdate; // 0x2d44(0x01)
	char pad_2D45[0x3]; // 0x2d45(0x03)
	double TimeSinceFiredWeapon; // 0x2d48(0x08)
	bool IsJumping; // 0x2d50(0x01)
	bool IsFalling; // 0x2d51(0x01)
	char pad_2D52[0x6]; // 0x2d52(0x06)
	double AimPitch; // 0x2d58(0x08)
	struct UAnimInstance* LastLinkedLayer; // 0x2d60(0x08)
	double TimeToJumpApex; // 0x2d68(0x08)
	enum class AnimEnum_RootYawOffsetMode RootYawOffsetMode; // 0x2d70(0x01)
	bool GameplayTag_IsReloading; // 0x2d71(0x01)
	bool GameplayTag_IsDashing; // 0x2d72(0x01)
	bool GameplayTag_IsMelee; // 0x2d73(0x01)
	char pad_2D74[0x4]; // 0x2d74(0x04)
	struct FVector2D RootYawOffsetAngleClamp; // 0x2d78(0x10)
	double UpperbodyDynamicAdditiveWeight; // 0x2d88(0x08)
	double AdditiveLeanAngle; // 0x2d90(0x08)
	double LastPivotTime; // 0x2d98(0x08)
	enum class AnimEnum_CardinalDirection CardinalDirectionFromAcceleration; // 0x2da0(0x01)
	char pad_2DA1[0x7]; // 0x2da1(0x07)
	struct FVector2D RootYawOffsetAngleClampCrouched; // 0x2da8(0x10)
	struct FVector PivotDirection2D; // 0x2db8(0x18)
	double YawDeltaSpeed; // 0x2dd0(0x08)
	bool DisableControlRig; // 0x2dd8(0x01)
	bool IsRunningIntoWall; // 0x2dd9(0x01)
	char pad_2DDA[0x6]; // 0x2dda(0x06)
	double AimYaw; // 0x2de0(0x08)
	bool GameplayTag_IsSprinting; // 0x2de8(0x01)
	bool GameplayTag_IsCrawling; // 0x2de9(0x01)
	bool CrawlStateChanged; // 0x2dea(0x01)
	bool SprintStateChanged; // 0x2deb(0x01)
	bool IsHeadObstructed; // 0x2dec(0x01)

	void LeftHandPose_OverrideState(struct FPoseLink InputPose, struct FPoseLink& LeftHandPose_OverrideState); // Function ABP_Terror_Base.ABP_Terror_Base_C.LeftHandPose_OverrideState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_SkeletalControls(struct FPoseLink InPose, struct FPoseLink& FullBody_SkeletalControls); // Function ABP_Terror_Base.ABP_Terror_Base_C.FullBody_SkeletalControls // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_JumpStartLoopState(struct FPoseLink& FullBody_JumpStartLoopState); // Function ABP_Terror_Base.ABP_Terror_Base_C.FullBody_JumpStartLoopState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_FallLoopState(struct FPoseLink& FullBody_FallLoopState); // Function ABP_Terror_Base.ABP_Terror_Base_C.FullBody_FallLoopState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_FallLandState(struct FPoseLink& FullBody_FallLandState); // Function ABP_Terror_Base.ABP_Terror_Base_C.FullBody_FallLandState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_JumpApexState(struct FPoseLink& FullBody_JumpApexState); // Function ABP_Terror_Base.ABP_Terror_Base_C.FullBody_JumpApexState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_JumpStartState(struct FPoseLink& FullBody_JumpStartState); // Function ABP_Terror_Base.ABP_Terror_Base_C.FullBody_JumpStartState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_Aiming(struct FPoseLink PreAimPose, double AimYaw, double AimPitch, struct FPoseLink& FullBody_Aiming); // Function ABP_Terror_Base.ABP_Terror_Base_C.FullBody_Aiming // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_PivotState(struct FPoseLink& FullBody_PivotState); // Function ABP_Terror_Base.ABP_Terror_Base_C.FullBody_PivotState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_StopState(struct FPoseLink& FullBody_StopState); // Function ABP_Terror_Base.ABP_Terror_Base_C.FullBody_StopState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_CycleState(struct FPoseLink& FullBody_CycleState); // Function ABP_Terror_Base.ABP_Terror_Base_C.FullBody_CycleState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_StartState(struct FPoseLink& FullBody_StartState); // Function ABP_Terror_Base.ABP_Terror_Base_C.FullBody_StartState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_IdleState(struct FPoseLink& FullBody_IdleState); // Function ABP_Terror_Base.ABP_Terror_Base_C.FullBody_IdleState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBodyAdditives(struct FPoseLink& FullBodyAdditives); // Function ABP_Terror_Base.ABP_Terror_Base_C.FullBodyAdditives // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Terror_Base.ABP_Terror_Base_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateWallDetectionHeuristic(); // Function ABP_Terror_Base.ABP_Terror_Base_C.UpdateWallDetectionHeuristic // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	bool IsMovingPerpendicularToInitialPivot(); // Function ABP_Terror_Base.ABP_Terror_Base_C.IsMovingPerpendicularToInitialPivot // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2552560
	enum class AnimEnum_CardinalDirection GetOppositeCardinalDirection(enum class AnimEnum_CardinalDirection CurrentDirection); // Function ABP_Terror_Base.ABP_Terror_Base_C.GetOppositeCardinalDirection // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x2552560
	struct UCharacterMovementComponent* GetMovementComponent(); // Function ABP_Terror_Base.ABP_Terror_Base_C.GetMovementComponent // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2552560
	void UpdateRootYawOffset(double InDeltaTime); // Function ABP_Terror_Base.ABP_Terror_Base_C.UpdateRootYawOffset // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateJumpFallData(); // Function ABP_Terror_Base.ABP_Terror_Base_C.UpdateJumpFallData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateLocomotionStateMachine(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Terror_Base.ABP_Terror_Base_C.UpdateLocomotionStateMachine // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateAimingData(); // Function ABP_Terror_Base.ABP_Terror_Base_C.UpdateAimingData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SelectCardinalDirectionFromAngle(double Angle, double DeadZone, enum class AnimEnum_CardinalDirection CurrentDirection, bool UseCurrentDirection, enum class AnimEnum_CardinalDirection& Direction); // Function ABP_Terror_Base.ABP_Terror_Base_C.SelectCardinalDirectionFromAngle // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2552560
	void UpdateBlendWeightData(double DeltaTime); // Function ABP_Terror_Base.ABP_Terror_Base_C.UpdateBlendWeightData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateCharacterStateData(double DeltaTime); // Function ABP_Terror_Base.ABP_Terror_Base_C.UpdateCharacterStateData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdatePivotState(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Terror_Base.ABP_Terror_Base_C.UpdatePivotState // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SetUpPivotState(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Terror_Base.ABP_Terror_Base_C.SetUpPivotState // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateStopState(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Terror_Base.ABP_Terror_Base_C.UpdateStopState // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateStartState(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Terror_Base.ABP_Terror_Base_C.UpdateStartState // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SetUpStartState(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Terror_Base.ABP_Terror_Base_C.SetUpStartState // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateIdleState(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Terror_Base.ABP_Terror_Base_C.UpdateIdleState // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void ProcessTurnYawCurve(); // Function ABP_Terror_Base.ABP_Terror_Base_C.ProcessTurnYawCurve // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SetRootYawOffset(double InRootYawOffset); // Function ABP_Terror_Base.ABP_Terror_Base_C.SetRootYawOffset // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateAccelerationData(); // Function ABP_Terror_Base.ABP_Terror_Base_C.UpdateAccelerationData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateVelocityData(); // Function ABP_Terror_Base.ABP_Terror_Base_C.UpdateVelocityData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateRotationData(); // Function ABP_Terror_Base.ABP_Terror_Base_C.UpdateRotationData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateLocationData(double DeltaTime); // Function ABP_Terror_Base.ABP_Terror_Base_C.UpdateLocationData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime); // Function ABP_Terror_Base.ABP_Terror_Base_C.BlueprintThreadSafeUpdateAnimation // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_9C79EC5E47B615599F20C7A60B7541A0(); // Function ABP_Terror_Base.ABP_Terror_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_9C79EC5E47B615599F20C7A60B7541A0 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_81FD72894EE1F7A091ACF498E41E57D1(); // Function ABP_Terror_Base.ABP_Terror_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_81FD72894EE1F7A091ACF498E41E57D1 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_1051CF2E47FA374EAA7BD9AE6495A059(); // Function ABP_Terror_Base.ABP_Terror_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_1051CF2E47FA374EAA7BD9AE6495A059 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_68289ECB43FEFFF347183190DEB9559A(); // Function ABP_Terror_Base.ABP_Terror_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_68289ECB43FEFFF347183190DEB9559A // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_3017DBAA457B9E67EA25CD9A8B00620D(); // Function ABP_Terror_Base.ABP_Terror_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_3017DBAA457B9E67EA25CD9A8B00620D // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_9EB43ADE40DFA05FC05F47A20855D97E(); // Function ABP_Terror_Base.ABP_Terror_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_9EB43ADE40DFA05FC05F47A20855D97E // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_4713C6D444E9E8A146B602A417B6E325(); // Function ABP_Terror_Base.ABP_Terror_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_4713C6D444E9E8A146B602A417B6E325 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_16300B2A40C6B315EB5FF18C27CE8BCB(); // Function ABP_Terror_Base.ABP_Terror_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_16300B2A40C6B315EB5FF18C27CE8BCB // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_B92A32604A20826E658CC0B76BBB1C44(); // Function ABP_Terror_Base.ABP_Terror_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_B92A32604A20826E658CC0B76BBB1C44 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_2529088147C0187702F0108C24A79101(); // Function ABP_Terror_Base.ABP_Terror_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terror_Base_AnimGraphNode_TransitionResult_2529088147C0187702F0108C24A79101 // (BlueprintEvent) // @ game+0x2552560
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_Terror_Base.ABP_Terror_Base_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x2552560
	void ExecuteUbergraph_ABP_Terror_Base(int32_t EntryPoint); // Function ABP_Terror_Base.ABP_Terror_Base_C.ExecuteUbergraph_ABP_Terror_Base // (Final|UbergraphFunction|HasDefaults) // @ game+0x2552560
};

