// AnimBlueprintGeneratedClass ABP_Retargeted_Base.ABP_Retargeted_Base_C
// Size: 0x25bd (Inherited: 0x370)
struct UABP_Retargeted_Base_C : ULyraAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x370(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x378(0x10)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Tag; // 0x388(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x390(0x08)
	struct FAnimSubsystemInstance_NodeRelevancy AnimBlueprintExtension_NodeRelevancy; // 0x398(0xa8)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x440(0x08)
	struct FAnimNode_Root AnimGraphNode_Root_15; // 0x448(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0x468(0xc8)
	struct FAnimNode_Root AnimGraphNode_Root_14; // 0x530(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0x550(0xc8)
	struct FAnimNode_Root AnimGraphNode_Root_13; // 0x618(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_12; // 0x638(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_11; // 0x658(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_10; // 0x678(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_9; // 0x698(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_8; // 0x6b8(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x6d8(0xc8)
	struct FAnimNode_Root AnimGraphNode_Root_7; // 0x7a0(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_6; // 0x7c0(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_5; // 0x7e0(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_4; // 0x800(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x820(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0x840(0x20)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x860(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x880(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x8c8(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x9d0(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x9f8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xa40(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_14; // 0xa68(0xa8)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0xb10(0x10)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xb20(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xc28(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0xc50(0xc8)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0xd18(0xd0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0xde8(0x48)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0xe30(0xa8)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0xed8(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0xf20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0xf48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0xf70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0xf98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0xfc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0xfe8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x1010(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x1038(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x1060(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x1088(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x10b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x10d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x1100(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x1128(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x1150(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x1178(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x11a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x11c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x11f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x1218(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x1240(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x1268(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x1290(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x12b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x12e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x1308(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_13; // 0x1330(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x13d8(0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_12; // 0x13f8(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x14a0(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x14c0(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_11; // 0x14e8(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x1590(0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_10; // 0x15b0(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x1658(0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_9; // 0x1678(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x1720(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1740(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x1768(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x1830(0x68)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_8; // 0x1898(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1940(0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_7; // 0x1960(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x1a08(0x20)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x1a28(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x1af0(0x68)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_6; // 0x1b58(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x1c00(0x20)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x1c20(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1ce8(0x68)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_5; // 0x1d50(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1df8(0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_4; // 0x1e18(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1ec0(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1ee0(0xb8)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3; // 0x1f98(0xa8)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2; // 0x2040(0xa8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x20e8(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x21b0(0x48)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x21f8(0xa8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x22a0(0xe0)
	struct UPawnMovementComponent* K2Node_PropertyAccess_12; // 0x2380(0x08)
	double K2Node_PropertyAccess_11; // 0x2388(0x08)
	double K2Node_PropertyAccess_10; // 0x2390(0x08)
	bool K2Node_PropertyAccess_9; // 0x2398(0x01)
	enum class EMovementMode K2Node_PropertyAccess_8; // 0x2399(0x01)
	bool K2Node_PropertyAccess_7; // 0x239a(0x01)
	bool K2Node_PropertyAccess_6; // 0x239b(0x01)
	char pad_239C[0x4]; // 0x239c(0x04)
	struct FVector K2Node_PropertyAccess_5; // 0x23a0(0x18)
	struct FVector K2Node_PropertyAccess_4; // 0x23b8(0x18)
	struct FRotator K2Node_PropertyAccess_3; // 0x23d0(0x18)
	struct FVector K2Node_PropertyAccess_2; // 0x23e8(0x18)
	struct FVector K2Node_PropertyAccess; // 0x2400(0x18)
	double __CustomProperty_AimPitch_8F7F9FBC4C2671E72D295FB8AF3DBBA9; // 0x2418(0x08)
	double __CustomProperty_AimYaw_8F7F9FBC4C2671E72D295FB8AF3DBBA9; // 0x2420(0x08)
	bool GameplayTag_IsADS; // 0x2428(0x01)
	bool GameplayTag_IsFiring; // 0x2429(0x01)
	char pad_242A[0x6]; // 0x242a(0x06)
	struct FVector WorldLocation; // 0x2430(0x18)
	double DisplacementSinceLastUpdate; // 0x2448(0x08)
	struct FRotator WorldRotation; // 0x2450(0x18)
	double RootYawOffset; // 0x2468(0x08)
	double YawDeltaSinceLastUpdate; // 0x2470(0x08)
	struct FVector LocalAcceleration2D; // 0x2478(0x18)
	bool HasAcceleration; // 0x2490(0x01)
	bool IsOnGround; // 0x2491(0x01)
	bool IsCrouching; // 0x2492(0x01)
	bool LinkedLayerChanged; // 0x2493(0x01)
	bool IsFirstUpdate; // 0x2494(0x01)
	char pad_2495[0x3]; // 0x2495(0x03)
	struct FVector WorldVelocity; // 0x2498(0x18)
	struct FVector LocalVelocity2D; // 0x24b0(0x18)
	struct FFloatSpringState RootYawOffsetSpringState; // 0x24c8(0x0c)
	char pad_24D4[0x4]; // 0x24d4(0x04)
	double TurnYawCurveValue; // 0x24d8(0x08)
	enum class AnimEnum_CardinalDirection StartDirection; // 0x24e0(0x01)
	char pad_24E1[0x7]; // 0x24e1(0x07)
	double LocalVelocityDirectionAngle; // 0x24e8(0x08)
	double CardinalDirectionDeadZone; // 0x24f0(0x08)
	double LocalVelocityDirectionAngleWithOffset; // 0x24f8(0x08)
	enum class AnimEnum_CardinalDirection LocalVelocityDirection; // 0x2500(0x01)
	enum class AnimEnum_CardinalDirection LocalVelocityDirectionNoOffset; // 0x2501(0x01)
	char pad_2502[0x6]; // 0x2502(0x06)
	double DisplacementSpeed; // 0x2508(0x08)
	bool HasVelocity; // 0x2510(0x01)
	enum class AnimEnum_CardinalDirection PivotInitialDirection; // 0x2511(0x01)
	bool CrouchStateChange; // 0x2512(0x01)
	bool ADSStateChanged; // 0x2513(0x01)
	bool WasADSLastUpdate; // 0x2514(0x01)
	char pad_2515[0x3]; // 0x2515(0x03)
	double TimeSinceFiredWeapon; // 0x2518(0x08)
	bool IsJumping; // 0x2520(0x01)
	bool IsFalling; // 0x2521(0x01)
	char pad_2522[0x6]; // 0x2522(0x06)
	double AimPitch; // 0x2528(0x08)
	struct UAnimInstance* LastLinkedLayer; // 0x2530(0x08)
	double TimeToJumpApex; // 0x2538(0x08)
	enum class AnimEnum_RootYawOffsetMode RootYawOffsetMode; // 0x2540(0x01)
	bool GameplayTag_IsReloading; // 0x2541(0x01)
	bool GameplayTag_IsDashing; // 0x2542(0x01)
	bool GameplayTag_IsMelee; // 0x2543(0x01)
	char pad_2544[0x4]; // 0x2544(0x04)
	struct FVector2D RootYawOffsetAngleClamp; // 0x2548(0x10)
	double UpperbodyDynamicAdditiveWeight; // 0x2558(0x08)
	double AdditiveLeanAngle; // 0x2560(0x08)
	double LastPivotTime; // 0x2568(0x08)
	enum class AnimEnum_CardinalDirection CardinalDirectionFromAcceleration; // 0x2570(0x01)
	char pad_2571[0x7]; // 0x2571(0x07)
	struct FVector2D RootYawOffsetAngleClampCrouched; // 0x2578(0x10)
	struct FVector PivotDirection2D; // 0x2588(0x18)
	double YawDeltaSpeed; // 0x25a0(0x08)
	bool DisableControlRig; // 0x25a8(0x01)
	bool IsRunningIntoWall; // 0x25a9(0x01)
	char pad_25AA[0x6]; // 0x25aa(0x06)
	double AimYaw; // 0x25b0(0x08)
	bool GameplayTag_IsSprinting; // 0x25b8(0x01)
	bool GameplayTag_IsCrawling; // 0x25b9(0x01)
	bool CrawlStateChanged; // 0x25ba(0x01)
	bool SprintStateChanged; // 0x25bb(0x01)
	bool EnableWeaponRetargetFix; // 0x25bc(0x01)

	void LeftHandPose_OverrideState(struct FPoseLink InputPose, struct FPoseLink& LeftHandPose_OverrideState); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.LeftHandPose_OverrideState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_SkeletalControls(struct FPoseLink InPose, struct FPoseLink& FullBody_SkeletalControls); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.FullBody_SkeletalControls // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_JumpStartLoopState(struct FPoseLink& FullBody_JumpStartLoopState); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.FullBody_JumpStartLoopState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_FallLoopState(struct FPoseLink& FullBody_FallLoopState); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.FullBody_FallLoopState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_FallLandState(struct FPoseLink& FullBody_FallLandState); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.FullBody_FallLandState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_JumpApexState(struct FPoseLink& FullBody_JumpApexState); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.FullBody_JumpApexState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_JumpStartState(struct FPoseLink& FullBody_JumpStartState); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.FullBody_JumpStartState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_Aiming(struct FPoseLink PreAimPose, double AimYaw, double AimPitch, struct FPoseLink& FullBody_Aiming); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.FullBody_Aiming // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_PivotState(struct FPoseLink& FullBody_PivotState); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.FullBody_PivotState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_StopState(struct FPoseLink& FullBody_StopState); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.FullBody_StopState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_CycleState(struct FPoseLink& FullBody_CycleState); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.FullBody_CycleState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_StartState(struct FPoseLink& FullBody_StartState); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.FullBody_StartState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBody_IdleState(struct FPoseLink& FullBody_IdleState); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.FullBody_IdleState // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void FullBodyAdditives(struct FPoseLink& FullBodyAdditives); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.FullBodyAdditives // (HasOutParms|BlueprintCallable) // @ game+0x2552560
	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateWallDetectionHeuristic(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.UpdateWallDetectionHeuristic // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	bool IsMovingPerpendicularToInitialPivot(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.IsMovingPerpendicularToInitialPivot // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2552560
	enum class AnimEnum_CardinalDirection GetOppositeCardinalDirection(enum class AnimEnum_CardinalDirection CurrentDirection); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.GetOppositeCardinalDirection // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x2552560
	struct UCharacterMovementComponent* GetMovementComponent(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.GetMovementComponent // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2552560
	void UpdateRootYawOffset(double InDeltaTime); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.UpdateRootYawOffset // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateJumpFallData(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.UpdateJumpFallData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateLocomotionStateMachine(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.UpdateLocomotionStateMachine // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateAimingData(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.UpdateAimingData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SelectCardinalDirectionFromAngle(double Angle, double DeadZone, enum class AnimEnum_CardinalDirection CurrentDirection, bool UseCurrentDirection, enum class AnimEnum_CardinalDirection& Direction); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.SelectCardinalDirectionFromAngle // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2552560
	void UpdateBlendWeightData(double DeltaTime); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.UpdateBlendWeightData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateCharacterStateData(double DeltaTime); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.UpdateCharacterStateData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdatePivotState(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.UpdatePivotState // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SetUpPivotState(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.SetUpPivotState // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateStopState(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.UpdateStopState // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateStartState(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.UpdateStartState // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SetUpStartState(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.SetUpStartState // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateIdleState(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.UpdateIdleState // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void ProcessTurnYawCurve(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.ProcessTurnYawCurve // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void SetRootYawOffset(double InRootYawOffset); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.SetRootYawOffset // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateAccelerationData(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.UpdateAccelerationData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateVelocityData(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.UpdateVelocityData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateRotationData(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.UpdateRotationData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void UpdateLocationData(double DeltaTime); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.UpdateLocationData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.BlueprintThreadSafeUpdateAnimation // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_363395B049F4E9A6DCBCD6891AB04F9E(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_363395B049F4E9A6DCBCD6891AB04F9E // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_9C3D07D8426F5154D146FD836434AD32(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_9C3D07D8426F5154D146FD836434AD32 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_888F52B4406E81A1D6116884CD4B4F36(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_888F52B4406E81A1D6116884CD4B4F36 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_37D222E64E0559B0A2EDAE9788E074EC(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_37D222E64E0559B0A2EDAE9788E074EC // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_03D5EA7142AAD992D46112B18C232DB6(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_03D5EA7142AAD992D46112B18C232DB6 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_1488C9184C86F5CC6613058AE4F9B58D(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_1488C9184C86F5CC6613058AE4F9B58D // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_092DDBF7435CCBF851F10D8F38FF41CD(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_092DDBF7435CCBF851F10D8F38FF41CD // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_C0A13E6B4ECCF7F94E1DCCA50AA4153F(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_C0A13E6B4ECCF7F94E1DCCA50AA4153F // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_640CD8044C42CE510311FD855614C3F0(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_640CD8044C42CE510311FD855614C3F0 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_19FB57D74BF25F4EB4023CBD8E2EDAB3(); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Retargeted_Base_AnimGraphNode_TransitionResult_19FB57D74BF25F4EB4023CBD8E2EDAB3 // (BlueprintEvent) // @ game+0x2552560
	void ExecuteUbergraph_ABP_Retargeted_Base(int32_t EntryPoint); // Function ABP_Retargeted_Base.ABP_Retargeted_Base_C.ExecuteUbergraph_ABP_Retargeted_Base // (Final|UbergraphFunction) // @ game+0x2552560
};

