// ScriptStruct ABP_Terror_Base.ABP_Terror_Base_C.AnimBlueprintGeneratedConstantData
// Size: 0x358 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName __NameProperty_351; // 0x04(0x08)
	struct FName __NameProperty_352; // 0x0c(0x08)
	struct FName __NameProperty_353; // 0x14(0x08)
	struct FName __NameProperty_354; // 0x1c(0x08)
	struct FName __NameProperty_355; // 0x24(0x08)
	struct FName __NameProperty_356; // 0x2c(0x08)
	struct FName __NameProperty_357; // 0x34(0x08)
	struct FName __NameProperty_358; // 0x3c(0x08)
	struct FName __NameProperty_359; // 0x44(0x08)
	struct FName __NameProperty_360; // 0x4c(0x08)
	struct FName __NameProperty_361; // 0x54(0x08)
	struct FName __NameProperty_362; // 0x5c(0x08)
	struct FName __NameProperty_363; // 0x64(0x08)
	struct FName __NameProperty_364; // 0x6c(0x08)
	struct FName __NameProperty_365; // 0x74(0x08)
	int32_t __IntProperty_366; // 0x7c(0x04)
	struct FName __NameProperty_367; // 0x80(0x08)
	int32_t __IntProperty_368; // 0x88(0x04)
	struct FName __NameProperty_369; // 0x8c(0x08)
	int32_t __IntProperty_370; // 0x94(0x04)
	struct FName __NameProperty_371; // 0x98(0x08)
	int32_t __IntProperty_372; // 0xa0(0x04)
	struct FName __NameProperty_373; // 0xa4(0x08)
	int32_t __IntProperty_374; // 0xac(0x04)
	struct FAnimNodeFunctionRef __StructProperty_375; // 0xb0(0x20)
	struct FAnimNodeFunctionRef __StructProperty_376; // 0xd0(0x20)
	struct FName __NameProperty_377; // 0xf0(0x08)
	int32_t __IntProperty_378; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct FAnimNodeFunctionRef __StructProperty_379; // 0x100(0x20)
	struct FName __NameProperty_380; // 0x120(0x08)
	int32_t __IntProperty_381; // 0x128(0x04)
	struct FName __NameProperty_382; // 0x12c(0x08)
	int32_t __IntProperty_383; // 0x134(0x04)
	struct UBlendSpace* __BlendSpace_384; // 0x138(0x08)
	float __FloatProperty_385; // 0x140(0x04)
	float __FloatProperty_386; // 0x144(0x04)
	bool __BoolProperty_387; // 0x148(0x01)
	enum class EAnimSyncMethod __EnumProperty_388; // 0x149(0x01)
	enum class EAnimGroupRole __ByteProperty_389; // 0x14a(0x01)
	char pad_14B[0x5]; // 0x14b(0x05)
	struct FAnimNodeFunctionRef __StructProperty_390; // 0x150(0x20)
	struct FAnimNodeFunctionRef __StructProperty_391; // 0x170(0x20)
	struct FName __NameProperty_392; // 0x190(0x08)
	int32_t __IntProperty_393; // 0x198(0x04)
	char pad_19C[0x4]; // 0x19c(0x04)
	struct FAnimNodeFunctionRef __StructProperty_394; // 0x1a0(0x20)
	struct FName __NameProperty_395; // 0x1c0(0x08)
	struct FName __NameProperty_396; // 0x1c8(0x08)
	int32_t __IntProperty_397; // 0x1d0(0x04)
	char pad_1D4[0x4]; // 0x1d4(0x04)
	struct FAnimNodeFunctionRef __StructProperty_398; // 0x1d8(0x20)
	struct FName __NameProperty_399; // 0x1f8(0x08)
	struct FName __NameProperty_400; // 0x200(0x08)
	enum class ERefPoseType __ByteProperty_401; // 0x208(0x01)
	char pad_209[0x7]; // 0x209(0x07)
	struct UBlendProfile* __BlendProfile_402; // 0x210(0x08)
	struct UCurveFloat* __CurveFloat_403; // 0x218(0x08)
	bool __BoolProperty_404; // 0x220(0x01)
	enum class EAlphaBlendOption __EnumProperty_405; // 0x221(0x01)
	enum class EBlendListTransitionType __EnumProperty_406; // 0x222(0x01)
	char pad_223[0x5]; // 0x223(0x05)
	struct TArray<float> __ArrayProperty_407; // 0x228(0x10)
	struct FAnimNodeFunctionRef __StructProperty_408; // 0x238(0x20)
	struct FAnimSubsystem_Tag AnimBlueprintExtension_Tag; // 0x258(0x60)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x2b8(0x80)
	struct FAnimSubsystem AnimBlueprintExtension_NodeRelevancy; // 0x338(0x08)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x340(0x18)
};

// ScriptStruct ABP_Terror_Base.ABP_Terror_Base_C.AnimBlueprintGeneratedMutableData
// Size: 0x11 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x3]; // 0x01(0x03)
	float __FloatProperty; // 0x04(0x04)
	float __FloatProperty_1; // 0x08(0x04)
	float __FloatProperty_2; // 0x0c(0x04)
	bool __BoolProperty_3; // 0x10(0x01)
};

