// AnimBlueprintGeneratedClass Alex_Menu.Alex_Menu_C
// Size: 0x5d8 (Inherited: 0x350)
struct UAlex_Menu_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x350(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x358(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x360(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x368(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x388(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x3b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3d8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x400(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x440(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x460(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x4a0(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4c0(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x500(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x520(0xb8)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function Alex_Menu.Alex_Menu_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Alex_Menu_AnimGraphNode_TransitionResult_A8B744C3416CFBF49D6932B551F13394(); // Function Alex_Menu.Alex_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Alex_Menu_AnimGraphNode_TransitionResult_A8B744C3416CFBF49D6932B551F13394 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Alex_Menu_AnimGraphNode_TransitionResult_2DA4B4B84026E669E22A72BB13D455DB(); // Function Alex_Menu.Alex_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Alex_Menu_AnimGraphNode_TransitionResult_2DA4B4B84026E669E22A72BB13D455DB // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Alex_Menu_AnimGraphNode_TransitionResult_286453E143BAB3CBBCF569A36ED91656(); // Function Alex_Menu.Alex_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Alex_Menu_AnimGraphNode_TransitionResult_286453E143BAB3CBBCF569A36ED91656 // (BlueprintEvent) // @ game+0x2552560
	void ExecuteUbergraph_Alex_Menu(int32_t EntryPoint); // Function Alex_Menu.Alex_Menu_C.ExecuteUbergraph_Alex_Menu // (Final|UbergraphFunction) // @ game+0x2552560
};

