// BlueprintGeneratedClass B_Alex.B_Alex_C
// Size: 0x400 (Inherited: 0x3a8)
struct AB_Alex_C : AB_Deceit_Char_Base_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3a8(0x08)
	struct ULODSyncComponent* LODSync; // 0x3b0(0x08)
	struct UGroomComponent* Fuzz; // 0x3b8(0x08)
	struct UGroomComponent* Eyelashes; // 0x3c0(0x08)
	struct UGroomComponent* Beard; // 0x3c8(0x08)
	struct UGroomComponent* Mustache; // 0x3d0(0x08)
	struct UGroomComponent* Hair; // 0x3d8(0x08)
	struct UGroomComponent* Eyebrows; // 0x3e0(0x08)
	struct USkeletalMeshComponent* Feet; // 0x3e8(0x08)
	struct USkeletalMeshComponent* Torso; // 0x3f0(0x08)
	struct USkeletalMeshComponent* Legs; // 0x3f8(0x08)

	void UserConstructionScript(); // Function B_Alex.B_Alex_C.UserConstructionScript // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void ExecuteUbergraph_B_Alex(int32_t EntryPoint); // Function B_Alex.B_Alex_C.ExecuteUbergraph_B_Alex // (Final|UbergraphFunction) // @ game+0x2552560
};

