// AnimBlueprintGeneratedClass Chang_Menu.Chang_Menu_C
// Size: 0x5d8 (Inherited: 0x350)
struct UChang_Menu_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x350(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x358(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x360(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x368(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x388(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x3b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3d8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x400(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x440(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x460(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x4a0(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4c0(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x500(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x520(0xb8)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function Chang_Menu.Chang_Menu_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chang_Menu_AnimGraphNode_TransitionResult_4F2CBA9D4553C7603296109C4C34C3F3(); // Function Chang_Menu.Chang_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Chang_Menu_AnimGraphNode_TransitionResult_4F2CBA9D4553C7603296109C4C34C3F3 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chang_Menu_AnimGraphNode_TransitionResult_EBE1ABEB47C000A32AF0DDBF499084C2(); // Function Chang_Menu.Chang_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Chang_Menu_AnimGraphNode_TransitionResult_EBE1ABEB47C000A32AF0DDBF499084C2 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chang_Menu_AnimGraphNode_TransitionResult_A3627BC04CB59EBA545BA88D2F5A95B3(); // Function Chang_Menu.Chang_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Chang_Menu_AnimGraphNode_TransitionResult_A3627BC04CB59EBA545BA88D2F5A95B3 // (BlueprintEvent) // @ game+0x2552560
	void ExecuteUbergraph_Chang_Menu(int32_t EntryPoint); // Function Chang_Menu.Chang_Menu_C.ExecuteUbergraph_Chang_Menu // (Final|UbergraphFunction) // @ game+0x2552560
};

