// ScriptStruct Chang_Menu.Chang_Menu_C.AnimBlueprintGeneratedConstantData
// Size: 0x140 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName __NameProperty_59; // 0x04(0x08)
	struct FName __NameProperty_60; // 0x0c(0x08)
	int32_t __IntProperty_61; // 0x14(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_62; // 0x18(0x08)
	struct FName __NameProperty_63; // 0x20(0x08)
	int32_t __IntProperty_64; // 0x28(0x04)
	bool __BoolProperty_65; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)
	float __FloatProperty_66; // 0x30(0x04)
	struct FInputScaleBiasClampConstants __StructProperty_67; // 0x34(0x2c)
	float __FloatProperty_68; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_69; // 0x68(0x08)
	bool __BoolProperty_70; // 0x70(0x01)
	enum class EAnimSyncMethod __EnumProperty_71; // 0x71(0x01)
	enum class EAnimGroupRole __ByteProperty_72; // 0x72(0x01)
	char pad_73[0x1]; // 0x73(0x01)
	struct FName __NameProperty_73; // 0x74(0x08)
	struct FName __NameProperty_74; // 0x7c(0x08)
	int32_t __IntProperty_75; // 0x84(0x04)
	struct FAnimNodeFunctionRef __StructProperty_76; // 0x88(0x20)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xa8(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x128(0x18)
};

