// ControlRigBlueprintGeneratedClass CR_Mannequin_Procedural.CR_Mannequin_Procedural_C
// Size: 0x490 (Inherited: 0x490)
struct UCR_Mannequin_Procedural_C : UControlRig {
};

// RigVMMemoryStorageGeneratorClass CR_Mannequin_Procedural.RigVMMemory_Literal
// Size: 0x24c (Inherited: 0x28)
struct URigVMMemory_Literal : URigVMMemoryStorage {
	struct FRigElementKey SetRotation_2_Item__Const; // 0x28(0x0c)
	enum class EBoneGetterSetterMode SetRotation_2_Space__Const; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	struct FRigElementKey GetTransform_6_Item__Const; // 0x38(0x0c)
	char GetTransform_6_bInitial__Const : 1; // 0x44(0x01)
	char pad_44_1 : 7; // 0x44(0x01)
	char GetTransform_6_1_bInitial__Const : 1; // 0x45(0x01)
	char pad_45_1 : 7; // 0x45(0x01)
	char pad_46[0x2]; // 0x46(0x02)
	struct FVector MathQuaternionSwingTwist_TwistAxis__Const; // 0x48(0x18)
	struct FQuat MathQuaternionSlerp_2_B__Const; // 0x60(0x20)
	float MathQuaternionSlerp_2_T__Const; // 0x80(0x04)
	float SetRotation_2_Weight__Const; // 0x84(0x04)
	struct FRigElementKey SetRotation_2_1_Item__Const; // 0x88(0x0c)
	float MathQuaternionSlerp_T__Const; // 0x94(0x04)
	enum class EBoneGetterSetterMode SetTranslation_Space__Const; // 0x98(0x01)
	char pad_99[0x3]; // 0x99(0x03)
	struct FRigElementKey GetTransform_1_Item__Const; // 0x9c(0x0c)
	float MathTransformLerp_T__Const; // 0xa8(0x04)
	struct FRigElementKey SetRotation_2_1_1_Item__Const; // 0xac(0x0c)
	float MathQuaternionSlerp_1_T__Const; // 0xb8(0x04)
	float MathTransformLerp_1_T__Const; // 0xbc(0x04)
	struct FRigElementKey SetRotation_2_1_2_Item__Const; // 0xc0(0x0c)
	float MathQuaternionSlerp_2_3_T__Const; // 0xcc(0x04)
	struct FRigElementKey SetRotation_1_Item__Const; // 0xd0(0x0c)
	struct FRigElementKey GetTransform_5_1_Item__Const; // 0xdc(0x0c)
	float MathQuaternionSlerp_4_T__Const; // 0xe8(0x04)
	struct FRigElementKey SetRotation_Item__Const; // 0xec(0x0c)
	struct FRigElementKey SetRotation_2_2_Item__Const; // 0xf8(0x0c)
	struct FRigElementKey GetTransform_6_3_Item__Const; // 0x104(0x0c)
	struct FRigElementKey SetRotation_2_1_3_Item__Const; // 0x110(0x0c)
	struct FRigElementKey GetTransform_1_1_Item__Const; // 0x11c(0x0c)
	struct FRigElementKey SetRotation_2_1_3_1_Item__Const; // 0x128(0x0c)
	struct FRigElementKey SetRotation_2_1_3_1_1_Item__Const; // 0x134(0x0c)
	struct FRigElementKey SetRotation_2_1_3_1_1_1_Item__Const; // 0x140(0x0c)
	struct FRigElementKey GetTransform_6_5_Item__Const; // 0x14c(0x0c)
	struct FRigElementKey SetRotation_2_1_3_1_1_1_1_Item__Const; // 0x158(0x0c)
	struct FRigElementKey SetRotation_2_2_1_Item__Const; // 0x164(0x0c)
	struct FRigElementKey GetTransform_6_3_1_Item__Const; // 0x170(0x0c)
	float MathQuaternionSlerp_2_2_T__Const; // 0x17c(0x04)
	struct FRigElementKey SetRotation_2_1_3_2_Item__Const; // 0x180(0x0c)
	struct FRigElementKey GetTransform_1_2_Item__Const; // 0x18c(0x0c)
	struct FRigElementKey SetRotation_3_Item__Const; // 0x198(0x0c)
	struct FRigElementKey SetRotation_2_1_3_2_1_Item__Const; // 0x1a4(0x0c)
	struct FRigElementKey SetRotation_2_1_3_2_1_1_Item__Const; // 0x1b0(0x0c)
	struct FRigElementKey GetTransform_6_3_1_2_Item__Const; // 0x1bc(0x0c)
	struct FRigElementKey SetRotation_2_1_3_2_1_1_1_Item__Const; // 0x1c8(0x0c)
	struct FRigElementKey SetRotation_2_2_1_1_Item__Const; // 0x1d4(0x0c)
	struct FRigElementKey GetTransform_6_3_1_3_Item__Const; // 0x1e0(0x0c)
	struct FRigElementKey SetRotation_2_1_3_2_2_Item__Const; // 0x1ec(0x0c)
	struct FRigElementKey GetTransform_1_2_1_Item__Const; // 0x1f8(0x0c)
	struct FRigElementKey SetRotation_3_1_Item__Const; // 0x204(0x0c)
	struct FRigElementKey SetRotation_3_2_Item__Const; // 0x210(0x0c)
	struct FRigElementKey SetRotation_3_2_1_Item__Const; // 0x21c(0x0c)
	struct FRigElementKey GetTransform_6_3_1_5_Item__Const; // 0x228(0x0c)
	struct FRigElementKey SetRotation_3_2_1_1_Item__Const; // 0x234(0x0c)
	struct FRigElementKey SetTranslation_4_1_2_Item__Const; // 0x240(0x0c)
};

// RigVMMemoryStorageGeneratorClass CR_Mannequin_Procedural.RigVMMemory_Work
// Size: 0x2b68 (Inherited: 0x28)
struct URigVMMemory_Work : URigVMMemoryStorage {
	char pad_28[0x8]; // 0x28(0x08)
	struct FControlRigExecuteContext ExecuteContext_; // 0x30(0xc0)
	struct FQuat MathQuaternionMul_Result; // 0xf0(0x20)
	struct FQuat MathQuaternionInverse_3_Result; // 0x110(0x20)
	struct FQuat MathQuaternionSwingTwist_Twist; // 0x130(0x20)
	struct FTransform MathTransformMakeRelative_3_Local; // 0x150(0x60)
	struct FTransform GetTransform_6_Transform; // 0x1b0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_CachedIndex; // 0x210(0x10)
	struct FTransform GetTransform_6_1_Transform; // 0x220(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_1_CachedIndex; // 0x280(0x10)
	struct FQuat MathQuaternionSwingTwist_Input; // 0x290(0x20)
	struct FQuat MathQuaternionSwingTwist_Swing; // 0x2b0(0x20)
	struct FQuat MathQuaternionSlerp_2_Result; // 0x2d0(0x20)
	struct FQuat MathQuaternionInverse_2_Result; // 0x2f0(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_2_CachedIndex; // 0x310(0x10)
	struct FQuat MathQuaternionSlerp_Result; // 0x320(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_2_1_CachedIndex; // 0x340(0x10)
	struct FTransform MathTransformLerp_Result; // 0x350(0x60)
	struct FTransform GetTransform_Transform; // 0x3b0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_CachedIndex; // 0x410(0x10)
	struct FTransform GetTransform_1_Transform; // 0x420(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_1_CachedIndex; // 0x480(0x10)
	struct FVector SetTranslation_Translation; // 0x490(0x18)
	struct TArray<struct FCachedRigElement> SetTranslation_CachedIndex; // 0x4a8(0x10)
	char pad_4B8[0x8]; // 0x4b8(0x08)
	struct FQuat MathQuaternionSlerp_1_Result; // 0x4c0(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_2_1_1_CachedIndex; // 0x4e0(0x10)
	struct FTransform MathTransformLerp_1_Result; // 0x4f0(0x60)
	struct FVector SetTranslation_1_Translation; // 0x550(0x18)
	struct TArray<struct FCachedRigElement> SetTranslation_1_CachedIndex; // 0x568(0x10)
	char pad_578[0x8]; // 0x578(0x08)
	struct FQuat MathQuaternionMul_3_Result; // 0x580(0x20)
	struct FQuat MathQuaternionInverse_3_3_Result; // 0x5a0(0x20)
	struct FQuat MathQuaternionSwingTwist_4_Twist; // 0x5c0(0x20)
	struct FTransform MathTransformMakeRelative_3_4_Local; // 0x5e0(0x60)
	struct FTransform GetTransform_6_2_Transform; // 0x640(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_2_CachedIndex; // 0x6a0(0x10)
	struct FTransform GetTransform_6_1_1_Transform; // 0x6b0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_1_1_CachedIndex; // 0x710(0x10)
	struct FQuat MathQuaternionSwingTwist_4_Input; // 0x720(0x20)
	struct FQuat MathQuaternionSwingTwist_4_Swing; // 0x740(0x20)
	struct FQuat MathQuaternionSlerp_2_3_Result; // 0x760(0x20)
	struct FQuat MathQuaternionInverse_2_4_Result; // 0x780(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_2_1_2_CachedIndex; // 0x7a0(0x10)
	struct FQuat MathQuaternionSlerp_4_Result; // 0x7b0(0x20)
	struct FQuat MathQuaternionSwingTwist_3_Twist; // 0x7d0(0x20)
	struct FTransform MathTransformMakeRelative_3_3_Local; // 0x7f0(0x60)
	struct FTransform GetTransform_5_1_Transform; // 0x850(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_5_1_CachedIndex; // 0x8b0(0x10)
	struct FTransform GetTransform_5_Transform; // 0x8c0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_5_CachedIndex; // 0x920(0x10)
	struct FQuat MathQuaternionSwingTwist_3_Input; // 0x930(0x20)
	struct FQuat MathQuaternionSwingTwist_3_Swing; // 0x950(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_1_CachedIndex; // 0x970(0x10)
	struct FTransform MathTransformLerp_1_3_Result; // 0x980(0x60)
	struct FTransform GetTransform_4_Transform; // 0x9e0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_4_CachedIndex; // 0xa40(0x10)
	struct FTransform GetTransform_1_3_Transform; // 0xa50(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_1_3_CachedIndex; // 0xab0(0x10)
	struct FVector SetTranslation_5_Translation; // 0xac0(0x18)
	struct TArray<struct FCachedRigElement> SetTranslation_5_CachedIndex; // 0xad8(0x10)
	char pad_AE8[0x8]; // 0xae8(0x08)
	struct FQuat MathQuaternionSlerp_1_3_Result; // 0xaf0(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_CachedIndex; // 0xb10(0x10)
	struct FTransform MathTransformLerp_4_Result; // 0xb20(0x60)
	struct FVector SetTranslation_5_1_Translation; // 0xb80(0x18)
	struct TArray<struct FCachedRigElement> SetTranslation_5_1_CachedIndex; // 0xb98(0x10)
	char pad_BA8[0x8]; // 0xba8(0x08)
	struct FQuat MathQuaternionMul_1_Result; // 0xbb0(0x20)
	struct FQuat MathQuaternionInverse_3_1_Result; // 0xbd0(0x20)
	struct FQuat MathQuaternionSwingTwist_1_Twist; // 0xbf0(0x20)
	struct FTransform MathTransformMakeRelative_3_1_Local; // 0xc10(0x60)
	struct FTransform GetTransform_6_3_Transform; // 0xc70(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_3_CachedIndex; // 0xcd0(0x10)
	struct FTransform GetTransform_6_1_2_Transform; // 0xce0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_1_2_CachedIndex; // 0xd40(0x10)
	struct FQuat MathQuaternionSwingTwist_1_Input; // 0xd50(0x20)
	struct FQuat MathQuaternionSwingTwist_1_Swing; // 0xd70(0x20)
	struct FQuat MathQuaternionSlerp_2_1_Result; // 0xd90(0x20)
	struct FQuat MathQuaternionInverse_2_1_Result; // 0xdb0(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_2_2_CachedIndex; // 0xdd0(0x10)
	struct FQuat MathQuaternionSlerp_3_Result; // 0xde0(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_2_1_3_CachedIndex; // 0xe00(0x10)
	struct FTransform MathTransformLerp_2_Result; // 0xe10(0x60)
	struct FTransform GetTransform_2_Transform; // 0xe70(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_2_CachedIndex; // 0xed0(0x10)
	struct FTransform GetTransform_1_1_Transform; // 0xee0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_1_1_CachedIndex; // 0xf40(0x10)
	struct FVector SetTranslation_2_Translation; // 0xf50(0x18)
	struct TArray<struct FCachedRigElement> SetTranslation_2_CachedIndex; // 0xf68(0x10)
	char pad_F78[0x8]; // 0xf78(0x08)
	struct FQuat MathQuaternionSlerp_1_1_Result; // 0xf80(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_2_1_3_1_CachedIndex; // 0xfa0(0x10)
	struct FTransform MathTransformLerp_1_1_Result; // 0xfb0(0x60)
	struct FVector SetTranslation_2_1_Translation; // 0x1010(0x18)
	struct TArray<struct FCachedRigElement> SetTranslation_2_1_CachedIndex; // 0x1028(0x10)
	char pad_1038[0x8]; // 0x1038(0x08)
	struct FQuat MathQuaternionMul_3_1_Result; // 0x1040(0x20)
	struct FQuat MathQuaternionInverse_3_3_1_Result; // 0x1060(0x20)
	struct FQuat MathQuaternionSwingTwist_4_1_Twist; // 0x1080(0x20)
	struct FTransform MathTransformMakeRelative_3_4_1_Local; // 0x10a0(0x60)
	struct FTransform GetTransform_6_4_Transform; // 0x1100(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_4_CachedIndex; // 0x1160(0x10)
	struct FTransform GetTransform_6_1_3_Transform; // 0x1170(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_1_3_CachedIndex; // 0x11d0(0x10)
	struct FQuat MathQuaternionSwingTwist_4_1_Input; // 0x11e0(0x20)
	struct FQuat MathQuaternionSwingTwist_4_1_Swing; // 0x1200(0x20)
	struct FQuat MathQuaternionSlerp_2_3_1_Result; // 0x1220(0x20)
	struct FQuat MathQuaternionInverse_2_4_1_Result; // 0x1240(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_2_1_3_1_1_CachedIndex; // 0x1260(0x10)
	struct FQuat MathQuaternionSlerp_1_3_1_1_Result; // 0x1270(0x20)
	struct FQuat MathQuaternionSwingTwist_3_1_Twist; // 0x1290(0x20)
	struct FTransform MathTransformMakeRelative_3_3_1_Local; // 0x12b0(0x60)
	struct FTransform GetTransform_6_5_Transform; // 0x1310(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_5_CachedIndex; // 0x1370(0x10)
	struct FTransform GetTransform_6_1_4_Transform; // 0x1380(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_1_4_CachedIndex; // 0x13e0(0x10)
	struct FQuat MathQuaternionSwingTwist_3_1_Input; // 0x13f0(0x20)
	struct FQuat MathQuaternionSwingTwist_3_1_Swing; // 0x1410(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_2_1_3_1_1_1_CachedIndex; // 0x1430(0x10)
	struct FTransform MathTransformLerp_1_3_1_Result; // 0x1440(0x60)
	struct FTransform GetTransform_4_1_Transform; // 0x14a0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_4_1_CachedIndex; // 0x1500(0x10)
	struct FTransform GetTransform_1_3_1_Transform; // 0x1510(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_1_3_1_CachedIndex; // 0x1570(0x10)
	struct FVector SetTranslation_2_1_1_Translation; // 0x1580(0x18)
	struct TArray<struct FCachedRigElement> SetTranslation_2_1_1_CachedIndex; // 0x1598(0x10)
	char pad_15A8[0x8]; // 0x15a8(0x08)
	struct FQuat MathQuaternionSlerp_1_3_1_Result; // 0x15b0(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_2_1_3_1_1_1_1_CachedIndex; // 0x15d0(0x10)
	struct FTransform MathTransformLerp_4_1_Result; // 0x15e0(0x60)
	struct FVector SetTranslation_2_1_1_1_Translation; // 0x1640(0x18)
	struct TArray<struct FCachedRigElement> SetTranslation_2_1_1_1_CachedIndex; // 0x1658(0x10)
	char pad_1668[0x8]; // 0x1668(0x08)
	struct FQuat MathQuaternionMul_2_Result; // 0x1670(0x20)
	struct FQuat MathQuaternionInverse_3_2_Result; // 0x1690(0x20)
	struct FQuat MathQuaternionSwingTwist_2_Twist; // 0x16b0(0x20)
	struct FTransform MathTransformMakeRelative_3_2_Local; // 0x16d0(0x60)
	struct FTransform GetTransform_6_3_1_Transform; // 0x1730(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_3_1_CachedIndex; // 0x1790(0x10)
	struct FTransform GetTransform_6_1_2_1_Transform; // 0x17a0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_1_2_1_CachedIndex; // 0x1800(0x10)
	struct FQuat MathQuaternionSwingTwist_2_Input; // 0x1810(0x20)
	struct FQuat MathQuaternionSwingTwist_2_Swing; // 0x1830(0x20)
	struct FQuat MathQuaternionSlerp_2_2_Result; // 0x1850(0x20)
	struct FQuat MathQuaternionInverse_2_2_Result; // 0x1870(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_2_2_1_CachedIndex; // 0x1890(0x10)
	struct TArray<struct FCachedRigElement> SetRotation_2_1_3_2_CachedIndex; // 0x18a0(0x10)
	struct FTransform MathTransformLerp_3_Result; // 0x18b0(0x60)
	struct FTransform GetTransform_3_Transform; // 0x1910(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_3_CachedIndex; // 0x1970(0x10)
	struct FTransform GetTransform_1_2_Transform; // 0x1980(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_1_2_CachedIndex; // 0x19e0(0x10)
	struct FVector SetTranslation_3_Translation; // 0x19f0(0x18)
	struct TArray<struct FCachedRigElement> SetTranslation_3_CachedIndex; // 0x1a08(0x10)
	char pad_1A18[0x8]; // 0x1a18(0x08)
	struct FQuat MathQuaternionSlerp_1_2_Result; // 0x1a20(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_3_CachedIndex; // 0x1a40(0x10)
	struct FTransform MathTransformLerp_1_2_Result; // 0x1a50(0x60)
	struct FVector SetTranslation_3_1_Translation; // 0x1ab0(0x18)
	struct TArray<struct FCachedRigElement> SetTranslation_3_1_CachedIndex; // 0x1ac8(0x10)
	char pad_1AD8[0x8]; // 0x1ad8(0x08)
	struct FQuat MathQuaternionMul_2_2_Result; // 0x1ae0(0x20)
	struct FQuat MathQuaternionInverse_3_2_2_Result; // 0x1b00(0x20)
	struct FQuat MathQuaternionSwingTwist_2_2_Twist; // 0x1b20(0x20)
	struct FTransform MathTransformMakeRelative_3_2_2_Local; // 0x1b40(0x60)
	struct FTransform GetTransform_6_3_1_1_Transform; // 0x1ba0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_3_1_1_CachedIndex; // 0x1c00(0x10)
	struct FTransform GetTransform_6_1_2_1_1_Transform; // 0x1c10(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_1_2_1_1_CachedIndex; // 0x1c70(0x10)
	struct FQuat MathQuaternionSwingTwist_2_2_Input; // 0x1c80(0x20)
	struct FQuat MathQuaternionSwingTwist_2_2_Swing; // 0x1ca0(0x20)
	struct FQuat MathQuaternionSlerp_2_2_2_Result; // 0x1cc0(0x20)
	struct FQuat MathQuaternionInverse_2_2_2_Result; // 0x1ce0(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_2_1_3_2_1_CachedIndex; // 0x1d00(0x10)
	struct FQuat MathQuaternionSlerp_2_2_2_1_Result; // 0x1d10(0x20)
	struct FQuat MathQuaternionSwingTwist_2_2_1_Twist; // 0x1d30(0x20)
	struct FTransform MathTransformMakeRelative_3_2_2_1_Local; // 0x1d50(0x60)
	struct FTransform GetTransform_6_3_1_2_Transform; // 0x1db0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_3_1_2_CachedIndex; // 0x1e10(0x10)
	struct FTransform GetTransform_6_1_2_1_2_Transform; // 0x1e20(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_1_2_1_2_CachedIndex; // 0x1e80(0x10)
	struct FQuat MathQuaternionSwingTwist_2_2_1_Input; // 0x1e90(0x20)
	struct FQuat MathQuaternionSwingTwist_2_2_1_Swing; // 0x1eb0(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_2_1_3_2_1_1_CachedIndex; // 0x1ed0(0x10)
	struct FTransform MathTransformLerp_1_2_2_Result; // 0x1ee0(0x60)
	struct FTransform GetTransform_3_2_Transform; // 0x1f40(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_3_2_CachedIndex; // 0x1fa0(0x10)
	struct FTransform GetTransform_1_2_2_Transform; // 0x1fb0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_1_2_2_CachedIndex; // 0x2010(0x10)
	struct FVector SetTranslation_3_1_1_Translation; // 0x2020(0x18)
	struct TArray<struct FCachedRigElement> SetTranslation_3_1_1_CachedIndex; // 0x2038(0x10)
	struct TArray<struct FCachedRigElement> SetRotation_2_1_3_2_1_1_1_CachedIndex; // 0x2048(0x10)
	char pad_2058[0x8]; // 0x2058(0x08)
	struct FTransform MathTransformLerp_3_2_Result; // 0x2060(0x60)
	struct FVector SetTranslation_3_1_1_1_Translation; // 0x20c0(0x18)
	struct TArray<struct FCachedRigElement> SetTranslation_3_1_1_1_CachedIndex; // 0x20d8(0x10)
	char pad_20E8[0x8]; // 0x20e8(0x08)
	struct FQuat MathQuaternionMul_2_1_Result; // 0x20f0(0x20)
	struct FQuat MathQuaternionInverse_3_2_1_Result; // 0x2110(0x20)
	struct FQuat MathQuaternionSwingTwist_2_1_Twist; // 0x2130(0x20)
	struct FTransform MathTransformMakeRelative_3_2_1_Local; // 0x2150(0x60)
	struct FTransform GetTransform_6_3_1_3_Transform; // 0x21b0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_3_1_3_CachedIndex; // 0x2210(0x10)
	struct FTransform GetTransform_6_1_2_1_3_Transform; // 0x2220(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_1_2_1_3_CachedIndex; // 0x2280(0x10)
	struct FQuat MathQuaternionSwingTwist_2_1_Input; // 0x2290(0x20)
	struct FQuat MathQuaternionSwingTwist_2_1_Swing; // 0x22b0(0x20)
	struct FQuat MathQuaternionSlerp_2_2_1_Result; // 0x22d0(0x20)
	struct FQuat MathQuaternionInverse_2_2_1_Result; // 0x22f0(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_2_2_1_1_CachedIndex; // 0x2310(0x10)
	struct TArray<struct FCachedRigElement> SetRotation_2_1_3_2_2_CachedIndex; // 0x2320(0x10)
	struct FTransform MathTransformLerp_3_1_Result; // 0x2330(0x60)
	struct FTransform GetTransform_3_1_Transform; // 0x2390(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_3_1_CachedIndex; // 0x23f0(0x10)
	struct FTransform GetTransform_1_2_1_Transform; // 0x2400(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_1_2_1_CachedIndex; // 0x2460(0x10)
	struct FVector SetTranslation_4_Translation; // 0x2470(0x18)
	struct TArray<struct FCachedRigElement> SetTranslation_4_CachedIndex; // 0x2488(0x10)
	char pad_2498[0x8]; // 0x2498(0x08)
	struct FQuat MathQuaternionSlerp_1_2_1_Result; // 0x24a0(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_3_1_CachedIndex; // 0x24c0(0x10)
	struct FTransform MathTransformLerp_1_2_1_Result; // 0x24d0(0x60)
	struct FVector SetTranslation_4_1_Translation; // 0x2530(0x18)
	struct TArray<struct FCachedRigElement> SetTranslation_4_1_CachedIndex; // 0x2548(0x10)
	char pad_2558[0x8]; // 0x2558(0x08)
	struct FQuat MathQuaternionMul_2_2_1_Result; // 0x2560(0x20)
	struct FQuat MathQuaternionInverse_3_2_2_1_Result; // 0x2580(0x20)
	struct FQuat MathQuaternionSwingTwist_2_2_2_Twist; // 0x25a0(0x20)
	struct FTransform MathTransformMakeRelative_3_2_2_2_Local; // 0x25c0(0x60)
	struct FTransform GetTransform_6_3_1_4_Transform; // 0x2620(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_3_1_4_CachedIndex; // 0x2680(0x10)
	struct FTransform GetTransform_6_1_2_1_4_Transform; // 0x2690(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_1_2_1_4_CachedIndex; // 0x26f0(0x10)
	struct FQuat MathQuaternionSwingTwist_2_2_2_Input; // 0x2700(0x20)
	struct FQuat MathQuaternionSwingTwist_2_2_2_Swing; // 0x2720(0x20)
	struct FQuat MathQuaternionSlerp_2_2_2_2_Result; // 0x2740(0x20)
	struct FQuat MathQuaternionInverse_2_2_2_1_Result; // 0x2760(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_3_2_CachedIndex; // 0x2780(0x10)
	struct FQuat MathQuaternionSlerp_2_2_2_1_1_Result; // 0x2790(0x20)
	struct FQuat MathQuaternionSwingTwist_2_2_1_1_Twist; // 0x27b0(0x20)
	struct FTransform MathTransformMakeRelative_3_2_2_1_1_Local; // 0x27d0(0x60)
	struct FTransform GetTransform_6_3_1_5_Transform; // 0x2830(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_3_1_5_CachedIndex; // 0x2890(0x10)
	struct FTransform GetTransform_6_1_2_1_5_Transform; // 0x28a0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_6_1_2_1_5_CachedIndex; // 0x2900(0x10)
	struct FQuat MathQuaternionSwingTwist_2_2_1_1_Input; // 0x2910(0x20)
	struct FQuat MathQuaternionSwingTwist_2_2_1_1_Swing; // 0x2930(0x20)
	struct TArray<struct FCachedRigElement> SetRotation_3_2_1_CachedIndex; // 0x2950(0x10)
	struct FTransform MathTransformLerp_1_2_2_1_Result; // 0x2960(0x60)
	struct FTransform GetTransform_3_2_1_Transform; // 0x29c0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_3_2_1_CachedIndex; // 0x2a20(0x10)
	struct FTransform GetTransform_1_2_2_1_Transform; // 0x2a30(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_1_2_2_1_CachedIndex; // 0x2a90(0x10)
	struct FVector SetTranslation_4_1_1_Translation; // 0x2aa0(0x18)
	struct TArray<struct FCachedRigElement> SetTranslation_4_1_1_CachedIndex; // 0x2ab8(0x10)
	struct TArray<struct FCachedRigElement> SetRotation_3_2_1_1_CachedIndex; // 0x2ac8(0x10)
	char pad_2AD8[0x8]; // 0x2ad8(0x08)
	struct FTransform MathTransformLerp_3_2_1_Result; // 0x2ae0(0x60)
	struct FVector SetTranslation_4_1_2_Translation; // 0x2b40(0x18)
	struct TArray<struct FCachedRigElement> SetTranslation_4_1_2_CachedIndex; // 0x2b58(0x10)
};

