// ScriptStruct FirstPerson_Terror_AnimBP.FirstPerson_Terror_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x160 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName __NameProperty_111; // 0x04(0x08)
	bool __BoolProperty_112; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	float __FloatProperty_113; // 0x10(0x04)
	struct FInputScaleBiasClampConstants __StructProperty_114; // 0x14(0x2c)
	float __FloatProperty_115; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_116; // 0x48(0x08)
	enum class EAnimSyncMethod __EnumProperty_117; // 0x50(0x01)
	enum class EAnimGroupRole __ByteProperty_118; // 0x51(0x01)
	char pad_52[0x2]; // 0x52(0x02)
	struct FName __NameProperty_119; // 0x54(0x08)
	int32_t __IntProperty_120; // 0x5c(0x04)
	struct FName __NameProperty_121; // 0x60(0x08)
	int32_t __IntProperty_122; // 0x68(0x04)
	struct FName __NameProperty_123; // 0x6c(0x08)
	struct FName __NameProperty_124; // 0x74(0x08)
	int32_t __IntProperty_125; // 0x7c(0x04)
	struct UBlendProfile* __BlendProfile_126; // 0x80(0x08)
	struct UCurveFloat* __CurveFloat_127; // 0x88(0x08)
	bool __BoolProperty_128; // 0x90(0x01)
	enum class EAlphaBlendOption __EnumProperty_129; // 0x91(0x01)
	enum class EBlendListTransitionType __EnumProperty_130; // 0x92(0x01)
	char pad_93[0x5]; // 0x93(0x05)
	struct TArray<float> __ArrayProperty_131; // 0x98(0x10)
	struct FAnimNodeFunctionRef __StructProperty_132; // 0xa8(0x20)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xc8(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x148(0x18)
};

// ScriptStruct FirstPerson_Terror_AnimBP.FirstPerson_Terror_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x02 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	bool __BoolProperty; // 0x01(0x01)
};

