// ScriptStruct FirstPerson_Layers_Base.FirstPerson_Layers_Base_C.AnimBlueprintGeneratedConstantData
// Size: 0x1c8 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName __NameProperty_297; // 0x04(0x08)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UBlendProfile* __BlendProfile_298; // 0x10(0x08)
	struct UCurveFloat* __CurveFloat_299; // 0x18(0x08)
	enum class EAlphaBlendOption __EnumProperty_300; // 0x20(0x01)
	enum class EBlendListTransitionType __EnumProperty_301; // 0x21(0x01)
	char pad_22[0x6]; // 0x22(0x06)
	struct TArray<float> __ArrayProperty_302; // 0x28(0x10)
	enum class ESequenceEvalReinit __ByteProperty_303; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	struct FName __NameProperty_304; // 0x3c(0x08)
	struct FName __NameProperty_305; // 0x44(0x08)
	struct FName __NameProperty_306; // 0x4c(0x08)
	struct FName __NameProperty_307; // 0x54(0x08)
	struct FName __NameProperty_308; // 0x5c(0x08)
	struct FName __NameProperty_309; // 0x64(0x08)
	struct FName __NameProperty_310; // 0x6c(0x08)
	struct FName __NameProperty_311; // 0x74(0x08)
	struct FName __NameProperty_312; // 0x7c(0x08)
	struct FName __NameProperty_313; // 0x84(0x08)
	struct FName __NameProperty_314; // 0x8c(0x08)
	struct FName __NameProperty_315; // 0x94(0x08)
	struct FName __NameProperty_316; // 0x9c(0x08)
	struct FName __NameProperty_317; // 0xa4(0x08)
	struct FName __NameProperty_318; // 0xac(0x08)
	bool __BoolProperty_319; // 0xb4(0x01)
	char pad_B5[0x3]; // 0xb5(0x03)
	struct FName __NameProperty_320; // 0xb8(0x08)
	struct FName __NameProperty_321; // 0xc0(0x08)
	float __FloatProperty_322; // 0xc8(0x04)
	struct FInputScaleBiasClampConstants __StructProperty_323; // 0xcc(0x2c)
	float __FloatProperty_324; // 0xf8(0x04)
	bool __BoolProperty_325; // 0xfc(0x01)
	enum class EAnimSyncMethod __EnumProperty_326; // 0xfd(0x01)
	enum class EAnimGroupRole __ByteProperty_327; // 0xfe(0x01)
	char pad_FF[0x1]; // 0xff(0x01)
	struct FAnimNodeFunctionRef __StructProperty_328; // 0x100(0x20)
	struct FName __NameProperty_329; // 0x120(0x08)
	struct FName __NameProperty_330; // 0x128(0x08)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x130(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x1b0(0x18)
};

// ScriptStruct FirstPerson_Layers_Base.FirstPerson_Layers_Base_C.AnimBlueprintGeneratedMutableData
// Size: 0x98 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	bool __BoolProperty; // 0x01(0x01)
	char pad_2[0x6]; // 0x02(0x06)
	struct UAnimSequenceBase* __AnimSequenceBase_1; // 0x08(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_2; // 0x10(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_3; // 0x18(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_4; // 0x20(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_5; // 0x28(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_6; // 0x30(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_7; // 0x38(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_8; // 0x40(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_9; // 0x48(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_10; // 0x50(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_11; // 0x58(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_12; // 0x60(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_13; // 0x68(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_14; // 0x70(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_15; // 0x78(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_16; // 0x80(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_17; // 0x88(0x08)
	struct UAnimSequenceBase* __AnimSequenceBase_18; // 0x90(0x08)
};

