// ScriptStruct FirstPerson_AnimBP.FirstPerson_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x248 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName __NameProperty_376; // 0x04(0x08)
	struct FName __NameProperty_377; // 0x0c(0x08)
	struct FName __NameProperty_378; // 0x14(0x08)
	struct FName __NameProperty_379; // 0x1c(0x08)
	struct FName __NameProperty_380; // 0x24(0x08)
	struct FName __NameProperty_381; // 0x2c(0x08)
	struct FName __NameProperty_382; // 0x34(0x08)
	struct FName __NameProperty_383; // 0x3c(0x08)
	struct FName __NameProperty_384; // 0x44(0x08)
	struct FName __NameProperty_385; // 0x4c(0x08)
	struct FName __NameProperty_386; // 0x54(0x08)
	struct FName __NameProperty_387; // 0x5c(0x08)
	struct FName __NameProperty_388; // 0x64(0x08)
	struct FName __NameProperty_389; // 0x6c(0x08)
	struct FName __NameProperty_390; // 0x74(0x08)
	struct FName __NameProperty_391; // 0x7c(0x08)
	struct FName __NameProperty_392; // 0x84(0x08)
	struct FName __NameProperty_393; // 0x8c(0x08)
	struct FName __NameProperty_394; // 0x94(0x08)
	struct FName __NameProperty_395; // 0x9c(0x08)
	int32_t __IntProperty_396; // 0xa4(0x04)
	struct FName __NameProperty_397; // 0xa8(0x08)
	int32_t __IntProperty_398; // 0xb0(0x04)
	struct FName __NameProperty_399; // 0xb4(0x08)
	int32_t __IntProperty_400; // 0xbc(0x04)
	struct FName __NameProperty_401; // 0xc0(0x08)
	int32_t __IntProperty_402; // 0xc8(0x04)
	struct FName __NameProperty_403; // 0xcc(0x08)
	int32_t __IntProperty_404; // 0xd4(0x04)
	struct FName __NameProperty_405; // 0xd8(0x08)
	int32_t __IntProperty_406; // 0xe0(0x04)
	struct FName __NameProperty_407; // 0xe4(0x08)
	int32_t __IntProperty_408; // 0xec(0x04)
	struct FName __NameProperty_409; // 0xf0(0x08)
	int32_t __IntProperty_410; // 0xf8(0x04)
	struct FName __NameProperty_411; // 0xfc(0x08)
	int32_t __IntProperty_412; // 0x104(0x04)
	struct FName __NameProperty_413; // 0x108(0x08)
	int32_t __IntProperty_414; // 0x110(0x04)
	struct FName __NameProperty_415; // 0x114(0x08)
	int32_t __IntProperty_416; // 0x11c(0x04)
	struct FName __NameProperty_417; // 0x120(0x08)
	int32_t __IntProperty_418; // 0x128(0x04)
	struct FName __NameProperty_419; // 0x12c(0x08)
	int32_t __IntProperty_420; // 0x134(0x04)
	struct FName __NameProperty_421; // 0x138(0x08)
	int32_t __IntProperty_422; // 0x140(0x04)
	struct FName __NameProperty_423; // 0x144(0x08)
	int32_t __IntProperty_424; // 0x14c(0x04)
	struct FName __NameProperty_425; // 0x150(0x08)
	struct FName __NameProperty_426; // 0x158(0x08)
	int32_t __IntProperty_427; // 0x160(0x04)
	char pad_164[0x4]; // 0x164(0x04)
	struct UBlendProfile* __BlendProfile_428; // 0x168(0x08)
	struct UCurveFloat* __CurveFloat_429; // 0x170(0x08)
	bool __BoolProperty_430; // 0x178(0x01)
	enum class EAlphaBlendOption __EnumProperty_431; // 0x179(0x01)
	enum class EBlendListTransitionType __EnumProperty_432; // 0x17a(0x01)
	char pad_17B[0x5]; // 0x17b(0x05)
	struct TArray<float> __ArrayProperty_433; // 0x180(0x10)
	struct FAnimNodeFunctionRef __StructProperty_434; // 0x190(0x20)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x1b0(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x230(0x18)
};

// ScriptStruct FirstPerson_AnimBP.FirstPerson_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x02 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	bool __BoolProperty; // 0x01(0x01)
};

