// ScriptStruct Hans_Menu.Hans_Menu_C.AnimBlueprintGeneratedConstantData
// Size: 0x158 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName __NameProperty_79; // 0x04(0x08)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_80; // 0x10(0x08)
	struct FName __NameProperty_81; // 0x18(0x08)
	int32_t __IntProperty_82; // 0x20(0x04)
	struct FName __NameProperty_83; // 0x24(0x08)
	int32_t __IntProperty_84; // 0x2c(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_85; // 0x30(0x08)
	struct FName __NameProperty_86; // 0x38(0x08)
	int32_t __IntProperty_87; // 0x40(0x04)
	bool __BoolProperty_88; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	float __FloatProperty_89; // 0x48(0x04)
	struct FInputScaleBiasClampConstants __StructProperty_90; // 0x4c(0x2c)
	float __FloatProperty_91; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_92; // 0x80(0x08)
	bool __BoolProperty_93; // 0x88(0x01)
	enum class EAnimSyncMethod __EnumProperty_94; // 0x89(0x01)
	enum class EAnimGroupRole __ByteProperty_95; // 0x8a(0x01)
	char pad_8B[0x1]; // 0x8b(0x01)
	struct FName __NameProperty_96; // 0x8c(0x08)
	struct FName __NameProperty_97; // 0x94(0x08)
	int32_t __IntProperty_98; // 0x9c(0x04)
	struct FAnimNodeFunctionRef __StructProperty_99; // 0xa0(0x20)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xc0(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x140(0x18)
};

