// AnimBlueprintGeneratedClass Hans_Menu.Hans_Menu_C
// Size: 0x660 (Inherited: 0x350)
struct UHans_Menu_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x350(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x358(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x360(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x368(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x388(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x3b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x3d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x400(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x428(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x468(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x488(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x4c8(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x4e8(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x528(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x548(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x588(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5a8(0xb8)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function Hans_Menu.Hans_Menu_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Hans_Menu_AnimGraphNode_TransitionResult_BBABBDA54F41C02CF59EB7AD1FB5BCB0(); // Function Hans_Menu.Hans_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Hans_Menu_AnimGraphNode_TransitionResult_BBABBDA54F41C02CF59EB7AD1FB5BCB0 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Hans_Menu_AnimGraphNode_TransitionResult_AAF5269B45354EF9925EEAAAA2EA3D1E(); // Function Hans_Menu.Hans_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Hans_Menu_AnimGraphNode_TransitionResult_AAF5269B45354EF9925EEAAAA2EA3D1E // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Hans_Menu_AnimGraphNode_TransitionResult_F1C62D23473EB7981C5592A522F3264D(); // Function Hans_Menu.Hans_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Hans_Menu_AnimGraphNode_TransitionResult_F1C62D23473EB7981C5592A522F3264D // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Hans_Menu_AnimGraphNode_TransitionResult_ED0B9E324CDC5AEAD11CEF80002A743D(); // Function Hans_Menu.Hans_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Hans_Menu_AnimGraphNode_TransitionResult_ED0B9E324CDC5AEAD11CEF80002A743D // (BlueprintEvent) // @ game+0x2552560
	void ExecuteUbergraph_Hans_Menu(int32_t EntryPoint); // Function Hans_Menu.Hans_Menu_C.ExecuteUbergraph_Hans_Menu // (Final|UbergraphFunction) // @ game+0x2552560
};

