// ControlRigBlueprintGeneratedClass m_med_nrw_top_hoodie_nrm_CtrlRig.m_med_nrw_top_hoodie_nrm_CtrlRig_C
// Size: 0x4a8 (Inherited: 0x490)
struct Um_med_nrw_top_hoodie_nrm_CtrlRig_C : UControlRig {
	struct FRotator neckSwingExtract; // 0x490(0x18)
};

// RigVMMemoryStorageGeneratorClass m_med_nrw_top_hoodie_nrm_CtrlRig.RigVMMemory_Literal
// Size: 0x170 (Inherited: 0x28)
struct URigVMMemory_Literal : URigVMMemoryStorage {
	struct FRigElementKey GetTransform_Item__Const; // 0x28(0x0c)
	enum class EBoneGetterSetterMode GetTransform_Space__Const; // 0x34(0x01)
	char GetTransform_bInitial__Const : 1; // 0x35(0x01)
	char pad_35_1 : 7; // 0x35(0x01)
	char GetTransform_1_bInitial__Const : 1; // 0x36(0x01)
	char pad_36_1 : 7; // 0x36(0x01)
	char pad_37[0x1]; // 0x37(0x01)
	struct FVector MathQuaternionSwingTwist_TwistAxis__Const; // 0x38(0x18)
	struct FRigElementKey RigUnit_SetRelativeTransformForItem_Child__Const; // 0x50(0x0c)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct FTransform RigUnit_SetRelativeTransformForItem_RelativeTransform__Const; // 0x60(0x60)
	struct FVector MathVectorAdd_A__Const; // 0xc0(0x18)
	float MathFloatRemap_2_SourceMinimum__Const; // 0xd8(0x04)
	float MathFloatRemap_2_SourceMaximum__Const; // 0xdc(0x04)
	float MathFloatRemap_2_TargetMaximum__Const; // 0xe0(0x04)
	float RigUnit_SetRelativeTransformForItem_Weight__Const; // 0xe4(0x04)
	struct FRigElementKey RigUnit_SetRelativeTransformForItem_1_Child__Const; // 0xe8(0x0c)
	float MathFloatRemap_SourceMinimum__Const; // 0xf4(0x04)
	float MathFloatRemap_TargetMinimum__Const; // 0xf8(0x04)
	struct FRigElementKey RigUnit_SetRelativeTransformForItem_2_Child__Const; // 0xfc(0x0c)
	float MathFloatRemap_1_TargetMinimum__Const; // 0x108(0x04)
	struct FRigElementKey RigUnit_SetRelativeTransformForItem_3_Child__Const; // 0x10c(0x0c)
	float MathFloatRemap_1_1_3_TargetMinimum__Const; // 0x118(0x04)
	struct FRigElementKey GetTransform_2_Item__Const; // 0x11c(0x0c)
	float MathFloatRemap_2_1_TargetMinimum__Const; // 0x128(0x04)
	float MathFloatRemap_1_1_TargetMinimum__Const; // 0x12c(0x04)
	float MathFloatRemap_1_1_2_TargetMinimum__Const; // 0x130(0x04)
	float SpringInterpVectorV2_Strength__Const; // 0x134(0x04)
	float SpringInterpVectorV2_CriticalDamping__Const; // 0x138(0x04)
	struct FRigElementKey RigUnit_SetRelativeTransformForItem_3_1_Child__Const; // 0x13c(0x0c)
	struct FRigElementKey GetTransform_2_2_Item__Const; // 0x148(0x0c)
	char pad_154[0x4]; // 0x154(0x04)
	struct FVector MathQuaternionSwingTwist_1_1_TwistAxis__Const; // 0x158(0x18)
};

// RigVMMemoryStorageGeneratorClass m_med_nrw_top_hoodie_nrm_CtrlRig.RigVMMemory_Work
// Size: 0xaf0 (Inherited: 0x28)
struct URigVMMemory_Work : URigVMMemoryStorage {
	char pad_28[0x8]; // 0x28(0x08)
	struct FControlRigExecuteContext ExecuteContext_; // 0x30(0xc0)
	struct FRotator MathQuaternionToRotator_Result; // 0xf0(0x18)
	char pad_108[0x8]; // 0x108(0x08)
	struct FQuat MathQuaternionSwingTwist_Swing; // 0x110(0x20)
	struct FTransform MathTransformMakeRelative_Local; // 0x130(0x60)
	struct FTransform GetTransform_Transform; // 0x190(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_CachedIndex; // 0x1f0(0x10)
	struct FTransform GetTransform_1_Transform; // 0x200(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_1_CachedIndex; // 0x260(0x10)
	struct FQuat MathQuaternionSwingTwist_Input; // 0x270(0x20)
	struct FQuat MathQuaternionSwingTwist_Twist; // 0x290(0x20)
	struct FVector MathVectorAdd_Result; // 0x2b0(0x18)
	float MathFloatRemap_2_Result; // 0x2c8(0x04)
	float MathFloatRemap_2_Value; // 0x2cc(0x04)
	struct FVector MathVectorAdd_A__IO; // 0x2d0(0x18)
	char pad_2E8[0x8]; // 0x2e8(0x08)
	struct FTransform RigUnit_SetRelativeTransformForItem_RelativeTransform__IO; // 0x2f0(0x60)
	struct TArray<struct FCachedRigElement> RigUnit_SetRelativeTransformForItem_CachedChild; // 0x350(0x10)
	struct TArray<struct FCachedRigElement> RigUnit_SetRelativeTransformForItem_CachedParent; // 0x360(0x10)
	struct FVector MathVectorAdd_2_Result; // 0x370(0x18)
	float MathFloatRemap_Result; // 0x388(0x04)
	float MathFloatRemap_Value; // 0x38c(0x04)
	struct FVector MathVectorAdd_2_A__IO; // 0x390(0x18)
	char pad_3A8[0x8]; // 0x3a8(0x08)
	struct FTransform RigUnit_SetRelativeTransformForItem_1_RelativeTransform__IO; // 0x3b0(0x60)
	struct TArray<struct FCachedRigElement> RigUnit_SetRelativeTransformForItem_1_CachedChild; // 0x410(0x10)
	struct TArray<struct FCachedRigElement> RigUnit_SetRelativeTransformForItem_1_CachedParent; // 0x420(0x10)
	struct FVector MathVectorAdd_2_1_Result; // 0x430(0x18)
	float MathFloatRemap_1_Result; // 0x448(0x04)
	float MathFloatRemap_1_Value; // 0x44c(0x04)
	struct FVector MathVectorAdd_2_1_A__IO; // 0x450(0x18)
	char pad_468[0x8]; // 0x468(0x08)
	struct FTransform RigUnit_SetRelativeTransformForItem_2_RelativeTransform__IO; // 0x470(0x60)
	struct TArray<struct FCachedRigElement> RigUnit_SetRelativeTransformForItem_2_CachedChild; // 0x4d0(0x10)
	struct TArray<struct FCachedRigElement> RigUnit_SetRelativeTransformForItem_2_CachedParent; // 0x4e0(0x10)
	struct FVector SpringInterpVectorV2_Result; // 0x4f0(0x18)
	struct FVector MathVectorAdd_2_1_1_Result; // 0x508(0x18)
	float MathFloatRemap_1_1_3_Result; // 0x520(0x04)
	float MathFloatRemap_1_1_3_Value; // 0x524(0x04)
	struct FVector MathVectorAdd_2_1_1_A__IO; // 0x528(0x18)
	float MathFloatRemap_2_1_Result; // 0x540(0x04)
	char pad_544[0x4]; // 0x544(0x04)
	struct FRotator MathQuaternionToRotator_1_Result; // 0x548(0x18)
	struct FQuat MathQuaternionSwingTwist_1_Swing; // 0x560(0x20)
	struct FTransform MathTransformMakeRelative_1_Local; // 0x580(0x60)
	struct FTransform GetTransform_2_Transform; // 0x5e0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_2_CachedIndex; // 0x640(0x10)
	struct FTransform GetTransform_2_1_Transform; // 0x650(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_2_1_CachedIndex; // 0x6b0(0x10)
	struct FQuat MathQuaternionSwingTwist_1_Input; // 0x6c0(0x20)
	struct FQuat MathQuaternionSwingTwist_1_Twist; // 0x6e0(0x20)
	float MathFloatRemap_2_1_Value; // 0x700(0x04)
	float MathFloatRemap_1_1_Result; // 0x704(0x04)
	float MathFloatRemap_1_1_Value; // 0x708(0x04)
	float MathFloatRemap_1_1_2_Result; // 0x70c(0x04)
	float MathFloatRemap_1_1_2_Value; // 0x710(0x04)
	char pad_714[0x4]; // 0x714(0x04)
	struct FVector MathVectorAdd_2_1_1_B__IO; // 0x718(0x18)
	struct FVector SpringInterpVectorV2_Velocity; // 0x730(0x18)
	struct TArray<struct FVector> SpringInterpVectorV2_SimulatedResult; // 0x748(0x10)
	struct TArray<struct FVectorSpringState> SpringInterpVectorV2_SpringState; // 0x758(0x10)
	char pad_768[0x8]; // 0x768(0x08)
	struct FTransform RigUnit_SetRelativeTransformForItem_3_RelativeTransform__IO; // 0x770(0x60)
	struct TArray<struct FCachedRigElement> RigUnit_SetRelativeTransformForItem_3_CachedChild; // 0x7d0(0x10)
	struct TArray<struct FCachedRigElement> RigUnit_SetRelativeTransformForItem_3_CachedParent; // 0x7e0(0x10)
	struct FVector SpringInterpVectorV2_1_Result; // 0x7f0(0x18)
	struct FVector MathVectorAdd_2_1_1_1_Result; // 0x808(0x18)
	float MathFloatRemap_3_Result; // 0x820(0x04)
	float MathFloatRemap_3_Value; // 0x824(0x04)
	struct FVector MathVectorAdd_2_1_1_1_A__IO; // 0x828(0x18)
	float MathFloatRemap_2_1_1_Result; // 0x840(0x04)
	char pad_844[0x4]; // 0x844(0x04)
	struct FRotator MathQuaternionToRotator_1_1_Result; // 0x848(0x18)
	struct FQuat MathQuaternionSwingTwist_1_1_Swing; // 0x860(0x20)
	struct FTransform MathTransformMakeRelative_1_1_Local; // 0x880(0x60)
	struct FTransform GetTransform_2_2_Transform; // 0x8e0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_2_2_CachedIndex; // 0x940(0x10)
	struct FTransform GetTransform_2_1_1_Transform; // 0x950(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_2_1_1_CachedIndex; // 0x9b0(0x10)
	struct FQuat MathQuaternionSwingTwist_1_1_Input; // 0x9c0(0x20)
	struct FQuat MathQuaternionSwingTwist_1_1_Twist; // 0x9e0(0x20)
	float MathFloatRemap_2_1_1_Value; // 0xa00(0x04)
	float MathFloatRemap_1_1_1_Result; // 0xa04(0x04)
	float MathFloatRemap_1_1_1_Value; // 0xa08(0x04)
	float MathFloatRemap_1_1_1_1_Result; // 0xa0c(0x04)
	float MathFloatRemap_1_1_1_1_Value; // 0xa10(0x04)
	char pad_A14[0x4]; // 0xa14(0x04)
	struct FVector MathVectorAdd_2_1_1_1_B__IO; // 0xa18(0x18)
	struct FVector SpringInterpVectorV2_1_Velocity; // 0xa30(0x18)
	struct TArray<struct FVector> SpringInterpVectorV2_1_SimulatedResult; // 0xa48(0x10)
	struct TArray<struct FVectorSpringState> SpringInterpVectorV2_1_SpringState; // 0xa58(0x10)
	char pad_A68[0x8]; // 0xa68(0x08)
	struct FTransform RigUnit_SetRelativeTransformForItem_3_1_RelativeTransform__IO; // 0xa70(0x60)
	struct TArray<struct FCachedRigElement> RigUnit_SetRelativeTransformForItem_3_1_CachedChild; // 0xad0(0x10)
	struct TArray<struct FCachedRigElement> RigUnit_SetRelativeTransformForItem_3_1_CachedParent; // 0xae0(0x10)
};

