// ControlRigBlueprintGeneratedClass metahuman_proc_ControlRig.metahuman_proc_ControlRig_C
// Size: 0x490 (Inherited: 0x490)
struct Umetahuman_proc_ControlRig_C : UControlRig {
};

// RigVMMemoryStorageGeneratorClass metahuman_proc_ControlRig.RigVMMemory_Literal
// Size: 0x308 (Inherited: 0x28)
struct URigVMMemory_Literal : URigVMMemoryStorage {
	struct TArray<struct FName> LocalVariableDefault__Clear_Keyframeas_bone_names__Const; // 0x28(0x10)
	enum class EBoneGetterSetterMode Clear_Keyframeas_Clear_Keyframeas_SetTransform_Space__Const; // 0x38(0x01)
	char Clear_Keyframeas_Clear_Keyframeas_SetTransform_bInitial__Const : 1; // 0x39(0x01)
	char pad_39_1 : 7; // 0x39(0x01)
	char Clear_Keyframeas_Clear_Keyframeas_GetTransform_bInitial__Const : 1; // 0x3a(0x01)
	char pad_3A_1 : 7; // 0x3a(0x01)
	char pad_3B[0x1]; // 0x3b(0x01)
	float Clear_Keyframeas_Clear_Keyframeas_SetTransform_Weight__Const; // 0x3c(0x04)
	struct TArray<struct FRigElementKey> Clear_Keyframeas_Clear_Keyframeas_ArrayIterator_1_Array__Const; // 0x40(0x10)
	struct FRigElementKey Compute_Twist_Compute_Twist_GetTransform_6_5_1_Item__Const; // 0x50(0x0c)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct FVector Compute_Twist_Blend_Swing_Inverse_Twist_8_Compute_Twist_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_TwistAxis__Const; // 0x60(0x18)
	struct FRigElementKey Compute_Twist_Compute_Twist_SetRotation_2_2_Item__Const; // 0x78(0x0c)
	char pad_84[0xc]; // 0x84(0x0c)
	struct FQuat Compute_Twist_Blend_Swing_Inverse_Twist_8_Compute_Twist_Blend_Swing_Inverse_Twist_8_MathQuaternionSlerp_2_4_B__Const; // 0x90(0x20)
	float Compute_Twist_Blend_Swing_Inverse_Twist_8_Compute_Twist_Blend_Swing_Inverse_Twist_8_MathQuaternionSlerp_2_4_T__Const; // 0xb0(0x04)
	struct FRigElementKey Compute_Twist_Compute_Twist_GetTransform_6_2_2_1_Item__Const; // 0xb4(0x0c)
	struct FTransform Compute_Twist_Twist_Blend_Transform_1_1_Compute_Twist_Twist_Blend_Transform_1_1_SetTransform_1_2_Transform__Const; // 0xc0(0x60)
	struct TArray<double> Compute_Twist_Compute_Twist_ArrayGetAtIndex_Array__Const; // 0x120(0x10)
	struct TArray<double> Compute_Twist_Compute_Twist_ArrayGetAtIndex_1_Array__Const; // 0x130(0x10)
	struct TArray<struct FRigElementKey> Compute_Twist_Compute_Twist_ArrayIterator_Array__Const; // 0x140(0x10)
	struct FRigElementKey Compute_Twist_1_Compute_Twist_1_GetTransform_6_5_1_Item__Const; // 0x150(0x0c)
	struct FRigElementKey Compute_Twist_1_Compute_Twist_1_SetRotation_2_2_Item__Const; // 0x15c(0x0c)
	struct FRigElementKey Compute_Twist_1_Compute_Twist_1_GetTransform_6_2_2_1_Item__Const; // 0x168(0x0c)
	char pad_174[0x4]; // 0x174(0x04)
	struct TArray<struct FRigElementKey> Compute_Twist_1_Compute_Twist_1_ArrayIterator_Array__Const; // 0x178(0x10)
	struct FRigElementKey Compute_Twist_2_Compute_Twist_2_GetTransform_6_5_1_Item__Const; // 0x188(0x0c)
	struct FRigElementKey Compute_Twist_2_Compute_Twist_2_SetRotation_2_2_Item__Const; // 0x194(0x0c)
	float Compute_Twist_2_Blend_Swing_Inverse_Twist_8_Compute_Twist_2_Blend_Swing_Inverse_Twist_8_MathQuaternionSlerp_2_4_T__Const; // 0x1a0(0x04)
	struct FRigElementKey Compute_Twist_2_Compute_Twist_2_GetTransform_6_2_2_1_Item__Const; // 0x1a4(0x0c)
	struct TArray<double> Compute_Twist_2_Compute_Twist_2_ArrayGetAtIndex_Array__Const; // 0x1b0(0x10)
	struct TArray<struct FRigElementKey> Compute_Twist_2_Compute_Twist_2_ArrayIterator_Array__Const; // 0x1c0(0x10)
	struct FRigElementKey Compute_Twist_3_Compute_Twist_3_GetTransform_6_5_1_Item__Const; // 0x1d0(0x0c)
	struct FRigElementKey Compute_Twist_3_Compute_Twist_3_SetRotation_2_2_Item__Const; // 0x1dc(0x0c)
	struct FRigElementKey Compute_Twist_3_Compute_Twist_3_GetTransform_6_2_2_1_Item__Const; // 0x1e8(0x0c)
	char pad_1F4[0x4]; // 0x1f4(0x04)
	struct TArray<struct FRigElementKey> Compute_Twist_3_Compute_Twist_3_ArrayIterator_Array__Const; // 0x1f8(0x10)
	struct FRigElementKey Compute_Twist_4_Compute_Twist_4_SetRotation_2_2_Item__Const; // 0x208(0x0c)
	struct FRigElementKey Compute_Twist_4_Compute_Twist_4_GetTransform_6_2_2_1_Item__Const; // 0x214(0x0c)
	struct TArray<double> Compute_Twist_4_Compute_Twist_4_ArrayGetAtIndex_Array__Const; // 0x220(0x10)
	struct TArray<double> Compute_Twist_4_Compute_Twist_4_ArrayGetAtIndex_1_Array__Const; // 0x230(0x10)
	struct TArray<struct FRigElementKey> Compute_Twist_4_Compute_Twist_4_ArrayIterator_Array__Const; // 0x240(0x10)
	struct FRigElementKey Compute_Twist_1_1_Compute_Twist_1_1_SetRotation_2_2_Item__Const; // 0x250(0x0c)
	struct FRigElementKey Compute_Twist_1_1_Compute_Twist_1_1_GetTransform_6_2_2_1_Item__Const; // 0x25c(0x0c)
	struct TArray<struct FRigElementKey> Compute_Twist_1_1_Compute_Twist_1_1_ArrayIterator_Array__Const; // 0x268(0x10)
	struct FRigElementKey Compute_Twist_2_1_Compute_Twist_2_1_SetRotation_2_2_Item__Const; // 0x278(0x0c)
	struct FRigElementKey Compute_Twist_2_1_Compute_Twist_2_1_GetTransform_6_2_2_1_Item__Const; // 0x284(0x0c)
	struct TArray<double> Compute_Twist_2_1_Compute_Twist_2_1_ArrayGetAtIndex_Array__Const; // 0x290(0x10)
	struct TArray<struct FRigElementKey> Compute_Twist_2_1_Compute_Twist_2_1_ArrayIterator_Array__Const; // 0x2a0(0x10)
	struct FRigElementKey Compute_Twist_3_1_Compute_Twist_3_1_SetRotation_2_2_Item__Const; // 0x2b0(0x0c)
	struct FRigElementKey Compute_Twist_3_1_Compute_Twist_3_1_GetTransform_6_2_2_1_Item__Const; // 0x2bc(0x0c)
	struct TArray<struct FRigElementKey> Compute_Twist_3_1_Compute_Twist_3_1_ArrayIterator_Array__Const; // 0x2c8(0x10)
	struct FRotator Compute_Half_Fingers_Compute_Half_Fingers_MathQuaternionFromRotator_1_Rotator__Const; // 0x2d8(0x18)
	float Compute_Half_Fingers_Compute_Half_Fingers_MathFloatRemap_1_SourceMinimum__Const; // 0x2f0(0x04)
	float Compute_Half_Fingers_Compute_Half_Fingers_MathFloatRemap_1_SourceMaximum__Const; // 0x2f4(0x04)
	struct TArray<struct FRigElementKey> Compute_Half_Fingers_Compute_Half_Fingers_ArrayIterator_Array__Const; // 0x2f8(0x10)
};

// RigVMMemoryStorageGeneratorClass metahuman_proc_ControlRig.RigVMMemory_Work
// Size: 0x350d (Inherited: 0x28)
struct URigVMMemory_Work : URigVMMemoryStorage {
	char pad_28[0x8]; // 0x28(0x08)
	struct FControlRigExecuteContext ExecuteContext_; // 0x30(0xc0)
	struct FRigElementKey Clear_Keyframeas_Clear_Keyframeas_ArrayIterator_1_Element; // 0xf0(0x0c)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct FTransform Clear_Keyframeas_Clear_Keyframeas_GetTransform_Transform; // 0x100(0x60)
	struct TArray<struct FCachedRigElement> Clear_Keyframeas_Clear_Keyframeas_GetTransform_CachedIndex; // 0x160(0x10)
	struct TArray<struct FCachedRigElement> Clear_Keyframeas_Clear_Keyframeas_SetTransform_CachedIndex; // 0x170(0x10)
	int32_t Clear_Keyframeas_Clear_Keyframeas_ArrayIterator_1_Index; // 0x180(0x04)
	int32_t Clear_Keyframeas_Clear_Keyframeas_ArrayIterator_1_Count; // 0x184(0x04)
	float Clear_Keyframeas_Clear_Keyframeas_ArrayIterator_1_Ratio; // 0x188(0x04)
	char Clear_Keyframeas_Clear_Keyframeas_ArrayIterator_1_Continue : 1; // 0x18c(0x01)
	char pad_18C_1 : 7; // 0x18c(0x01)
	char pad_18D[0x3]; // 0x18d(0x03)
	struct FTransform Compute_Twist_Compute_Twist_MathTransformMakeRelative_3_6_1_Local; // 0x190(0x60)
	struct FTransform Compute_Twist_Compute_Twist_GetTransform_6_5_1_Transform; // 0x1f0(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_Compute_Twist_GetTransform_6_5_1_CachedIndex; // 0x250(0x10)
	struct FTransform Compute_Twist_Compute_Twist_GetTransform_6_1_4_1_Transform; // 0x260(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_Compute_Twist_GetTransform_6_1_4_1_CachedIndex; // 0x2c0(0x10)
	struct FQuat Compute_Twist_Blend_Swing_Inverse_Twist_8_Compute_Twist_Blend_Swing_Inverse_Twist_8_MathQuaternionInverse_3_4_Result; // 0x2d0(0x20)
	struct FQuat Compute_Twist_Blend_Swing_Inverse_Twist_8_Compute_Twist_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Twist; // 0x2f0(0x20)
	struct FQuat Compute_Twist_Blend_Swing_Inverse_Twist_8_Compute_Twist_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Input; // 0x310(0x20)
	struct FQuat Compute_Twist_Blend_Swing_Inverse_Twist_8_Compute_Twist_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Swing; // 0x330(0x20)
	struct FQuat Compute_Twist_Blend_Swing_Inverse_Twist_8_Compute_Twist_Blend_Swing_Inverse_Twist_8_MathQuaternionMul_19_Result; // 0x350(0x20)
	struct FQuat Compute_Twist_Blend_Swing_Inverse_Twist_8_Compute_Twist_Blend_Swing_Inverse_Twist_8_MathQuaternionSlerp_2_4_Result; // 0x370(0x20)
	struct FQuat Compute_Twist_Blend_Swing_Inverse_Twist_8_Compute_Twist_Blend_Swing_Inverse_Twist_8_MathQuaternionInverse_2_3_Result; // 0x390(0x20)
	struct TArray<struct FCachedRigElement> Compute_Twist_Compute_Twist_SetRotation_2_2_CachedIndex; // 0x3b0(0x10)
	struct FTransform Compute_Twist_Compute_Twist_MathTransformMakeRelative_3_4_2_1_Local; // 0x3c0(0x60)
	struct FTransform Compute_Twist_Compute_Twist_GetTransform_6_2_2_1_Transform; // 0x420(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_Compute_Twist_GetTransform_6_2_2_1_CachedIndex; // 0x480(0x10)
	struct FTransform Compute_Twist_Compute_Twist_GetTransform_6_1_1_2_1_Transform; // 0x490(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_Compute_Twist_GetTransform_6_1_1_2_1_CachedIndex; // 0x4f0(0x10)
	struct FRigElementKey Compute_Twist_Compute_Twist_ArrayIterator_Element; // 0x500(0x0c)
	char pad_50C[0x4]; // 0x50c(0x04)
	struct FQuat Compute_Twist_Twist_Blend_Transform_1_1_Compute_Twist_Twist_Blend_Transform_1_1_MathQuaternionSlerp_1_4_Result; // 0x510(0x20)
	struct FQuat Compute_Twist_Compute_Twist_If_1_Result; // 0x530(0x20)
	struct FQuat Compute_Twist_Compute_Twist_MathQuaternionSwingTwist_3_2_1_Twist; // 0x550(0x20)
	struct FQuat Compute_Twist_Compute_Twist_MathQuaternionSwingTwist_3_2_1_Input; // 0x570(0x20)
	struct FQuat Compute_Twist_Compute_Twist_MathQuaternionSwingTwist_3_2_1_Swing; // 0x590(0x20)
	struct FQuat Compute_Twist_Compute_Twist_If_1_False; // 0x5b0(0x20)
	double Compute_Twist_Compute_Twist_ArrayGetAtIndex_Element; // 0x5d0(0x08)
	int32_t Compute_Twist_Compute_Twist_ArrayIterator_Index; // 0x5d8(0x04)
	float Compute_Twist_Twist_Blend_Transform_1_1_Compute_Twist_Twist_Blend_Transform_1_1_MathQuaternionSlerp_1_4_T; // 0x5dc(0x04)
	struct FTransform Compute_Twist_Twist_Blend_Transform_1_1_Compute_Twist_Twist_Blend_Transform_1_1_MathTransformMul_1_2_Result; // 0x5e0(0x60)
	struct FTransform Compute_Twist_Twist_Blend_Transform_1_1_Compute_Twist_Twist_Blend_Transform_1_1_MathTransformLerp_1_4_Result; // 0x640(0x60)
	double Compute_Twist_Compute_Twist_ArrayGetAtIndex_1_Element; // 0x6a0(0x08)
	float Compute_Twist_Twist_Blend_Transform_1_1_Compute_Twist_Twist_Blend_Transform_1_1_MathTransformLerp_1_4_T; // 0x6a8(0x04)
	char pad_6AC[0x4]; // 0x6ac(0x04)
	struct FTransform Compute_Twist_Twist_Blend_Transform_1_1_Compute_Twist_Twist_Blend_Transform_1_1_GetTransform_7_1_2_Transform; // 0x6b0(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_Twist_Blend_Transform_1_1_Compute_Twist_Twist_Blend_Transform_1_1_GetTransform_7_1_2_CachedIndex; // 0x710(0x10)
	struct FTransform Compute_Twist_Twist_Blend_Transform_1_1_Compute_Twist_Twist_Blend_Transform_1_1_SetTransform_1_2_Transform__IO; // 0x720(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_Twist_Blend_Transform_1_1_Compute_Twist_Twist_Blend_Transform_1_1_SetTransform_1_2_CachedIndex; // 0x780(0x10)
	int32_t Compute_Twist_Compute_Twist_ArrayIterator_Count; // 0x790(0x04)
	float Compute_Twist_Compute_Twist_ArrayIterator_Ratio; // 0x794(0x04)
	char Compute_Twist_Compute_Twist_ArrayIterator_Continue : 1; // 0x798(0x01)
	char pad_798_1 : 7; // 0x798(0x01)
	char pad_799[0x7]; // 0x799(0x07)
	struct FTransform Compute_Twist_1_Compute_Twist_1_MathTransformMakeRelative_3_6_1_Local; // 0x7a0(0x60)
	struct FTransform Compute_Twist_1_Compute_Twist_1_GetTransform_6_5_1_Transform; // 0x800(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_1_Compute_Twist_1_GetTransform_6_5_1_CachedIndex; // 0x860(0x10)
	struct FTransform Compute_Twist_1_Compute_Twist_1_GetTransform_6_1_4_1_Transform; // 0x870(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_1_Compute_Twist_1_GetTransform_6_1_4_1_CachedIndex; // 0x8d0(0x10)
	struct FQuat Compute_Twist_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_1_Blend_Swing_Inverse_Twist_8_MathQuaternionInverse_3_4_Result; // 0x8e0(0x20)
	struct FQuat Compute_Twist_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_1_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Twist; // 0x900(0x20)
	struct FQuat Compute_Twist_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_1_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Input; // 0x920(0x20)
	struct FQuat Compute_Twist_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_1_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Swing; // 0x940(0x20)
	struct FQuat Compute_Twist_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_1_Blend_Swing_Inverse_Twist_8_MathQuaternionMul_19_Result; // 0x960(0x20)
	struct FQuat Compute_Twist_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_1_Blend_Swing_Inverse_Twist_8_MathQuaternionSlerp_2_4_Result; // 0x980(0x20)
	struct FQuat Compute_Twist_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_1_Blend_Swing_Inverse_Twist_8_MathQuaternionInverse_2_3_Result; // 0x9a0(0x20)
	struct TArray<struct FCachedRigElement> Compute_Twist_1_Compute_Twist_1_SetRotation_2_2_CachedIndex; // 0x9c0(0x10)
	struct FTransform Compute_Twist_1_Compute_Twist_1_MathTransformMakeRelative_3_4_2_1_Local; // 0x9d0(0x60)
	struct FTransform Compute_Twist_1_Compute_Twist_1_GetTransform_6_2_2_1_Transform; // 0xa30(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_1_Compute_Twist_1_GetTransform_6_2_2_1_CachedIndex; // 0xa90(0x10)
	struct FTransform Compute_Twist_1_Compute_Twist_1_GetTransform_6_1_1_2_1_Transform; // 0xaa0(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_1_Compute_Twist_1_GetTransform_6_1_1_2_1_CachedIndex; // 0xb00(0x10)
	struct FRigElementKey Compute_Twist_1_Compute_Twist_1_ArrayIterator_Element; // 0xb10(0x0c)
	char pad_B1C[0x4]; // 0xb1c(0x04)
	struct FQuat Compute_Twist_1_Twist_Blend_Transform_1_1_Compute_Twist_1_Twist_Blend_Transform_1_1_MathQuaternionSlerp_1_4_Result; // 0xb20(0x20)
	struct FQuat Compute_Twist_1_Compute_Twist_1_If_1_Result; // 0xb40(0x20)
	struct FQuat Compute_Twist_1_Compute_Twist_1_MathQuaternionSwingTwist_3_2_1_Twist; // 0xb60(0x20)
	struct FQuat Compute_Twist_1_Compute_Twist_1_MathQuaternionSwingTwist_3_2_1_Input; // 0xb80(0x20)
	struct FQuat Compute_Twist_1_Compute_Twist_1_MathQuaternionSwingTwist_3_2_1_Swing; // 0xba0(0x20)
	struct FQuat Compute_Twist_1_Compute_Twist_1_If_1_False; // 0xbc0(0x20)
	double Compute_Twist_1_Compute_Twist_1_ArrayGetAtIndex_Element; // 0xbe0(0x08)
	int32_t Compute_Twist_1_Compute_Twist_1_ArrayIterator_Index; // 0xbe8(0x04)
	float Compute_Twist_1_Twist_Blend_Transform_1_1_Compute_Twist_1_Twist_Blend_Transform_1_1_MathQuaternionSlerp_1_4_T; // 0xbec(0x04)
	struct FTransform Compute_Twist_1_Twist_Blend_Transform_1_1_Compute_Twist_1_Twist_Blend_Transform_1_1_MathTransformMul_1_2_Result; // 0xbf0(0x60)
	struct FTransform Compute_Twist_1_Twist_Blend_Transform_1_1_Compute_Twist_1_Twist_Blend_Transform_1_1_MathTransformLerp_1_4_Result; // 0xc50(0x60)
	double Compute_Twist_1_Compute_Twist_1_ArrayGetAtIndex_1_Element; // 0xcb0(0x08)
	float Compute_Twist_1_Twist_Blend_Transform_1_1_Compute_Twist_1_Twist_Blend_Transform_1_1_MathTransformLerp_1_4_T; // 0xcb8(0x04)
	char pad_CBC[0x4]; // 0xcbc(0x04)
	struct FTransform Compute_Twist_1_Twist_Blend_Transform_1_1_Compute_Twist_1_Twist_Blend_Transform_1_1_GetTransform_7_1_2_Transform; // 0xcc0(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_1_Twist_Blend_Transform_1_1_Compute_Twist_1_Twist_Blend_Transform_1_1_GetTransform_7_1_2_CachedIndex; // 0xd20(0x10)
	struct FTransform Compute_Twist_1_Twist_Blend_Transform_1_1_Compute_Twist_1_Twist_Blend_Transform_1_1_SetTransform_1_2_Transform__IO; // 0xd30(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_1_Twist_Blend_Transform_1_1_Compute_Twist_1_Twist_Blend_Transform_1_1_SetTransform_1_2_CachedIndex; // 0xd90(0x10)
	int32_t Compute_Twist_1_Compute_Twist_1_ArrayIterator_Count; // 0xda0(0x04)
	float Compute_Twist_1_Compute_Twist_1_ArrayIterator_Ratio; // 0xda4(0x04)
	char Compute_Twist_1_Compute_Twist_1_ArrayIterator_Continue : 1; // 0xda8(0x01)
	char pad_DA8_1 : 7; // 0xda8(0x01)
	char pad_DA9[0x7]; // 0xda9(0x07)
	struct FTransform Compute_Twist_2_Compute_Twist_2_MathTransformMakeRelative_3_6_1_Local; // 0xdb0(0x60)
	struct FTransform Compute_Twist_2_Compute_Twist_2_GetTransform_6_5_1_Transform; // 0xe10(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_2_Compute_Twist_2_GetTransform_6_5_1_CachedIndex; // 0xe70(0x10)
	struct FTransform Compute_Twist_2_Compute_Twist_2_GetTransform_6_1_4_1_Transform; // 0xe80(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_2_Compute_Twist_2_GetTransform_6_1_4_1_CachedIndex; // 0xee0(0x10)
	struct FQuat Compute_Twist_2_Blend_Swing_Inverse_Twist_8_Compute_Twist_2_Blend_Swing_Inverse_Twist_8_MathQuaternionInverse_3_4_Result; // 0xef0(0x20)
	struct FQuat Compute_Twist_2_Blend_Swing_Inverse_Twist_8_Compute_Twist_2_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Twist; // 0xf10(0x20)
	struct FQuat Compute_Twist_2_Blend_Swing_Inverse_Twist_8_Compute_Twist_2_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Input; // 0xf30(0x20)
	struct FQuat Compute_Twist_2_Blend_Swing_Inverse_Twist_8_Compute_Twist_2_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Swing; // 0xf50(0x20)
	struct FQuat Compute_Twist_2_Blend_Swing_Inverse_Twist_8_Compute_Twist_2_Blend_Swing_Inverse_Twist_8_MathQuaternionMul_19_Result; // 0xf70(0x20)
	struct FQuat Compute_Twist_2_Blend_Swing_Inverse_Twist_8_Compute_Twist_2_Blend_Swing_Inverse_Twist_8_MathQuaternionSlerp_2_4_Result; // 0xf90(0x20)
	struct FQuat Compute_Twist_2_Blend_Swing_Inverse_Twist_8_Compute_Twist_2_Blend_Swing_Inverse_Twist_8_MathQuaternionInverse_2_3_Result; // 0xfb0(0x20)
	struct TArray<struct FCachedRigElement> Compute_Twist_2_Compute_Twist_2_SetRotation_2_2_CachedIndex; // 0xfd0(0x10)
	struct FTransform Compute_Twist_2_Compute_Twist_2_MathTransformMakeRelative_3_4_2_1_Local; // 0xfe0(0x60)
	struct FTransform Compute_Twist_2_Compute_Twist_2_GetTransform_6_2_2_1_Transform; // 0x1040(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_2_Compute_Twist_2_GetTransform_6_2_2_1_CachedIndex; // 0x10a0(0x10)
	struct FTransform Compute_Twist_2_Compute_Twist_2_GetTransform_6_1_1_2_1_Transform; // 0x10b0(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_2_Compute_Twist_2_GetTransform_6_1_1_2_1_CachedIndex; // 0x1110(0x10)
	struct FRigElementKey Compute_Twist_2_Compute_Twist_2_ArrayIterator_Element; // 0x1120(0x0c)
	char pad_112C[0x4]; // 0x112c(0x04)
	struct FQuat Compute_Twist_2_Twist_Blend_Transform_1_1_Compute_Twist_2_Twist_Blend_Transform_1_1_MathQuaternionSlerp_1_4_Result; // 0x1130(0x20)
	struct FQuat Compute_Twist_2_Compute_Twist_2_If_1_Result; // 0x1150(0x20)
	struct FQuat Compute_Twist_2_Compute_Twist_2_MathQuaternionSwingTwist_3_2_1_Twist; // 0x1170(0x20)
	struct FQuat Compute_Twist_2_Compute_Twist_2_MathQuaternionSwingTwist_3_2_1_Input; // 0x1190(0x20)
	struct FQuat Compute_Twist_2_Compute_Twist_2_MathQuaternionSwingTwist_3_2_1_Swing; // 0x11b0(0x20)
	struct FQuat Compute_Twist_2_Compute_Twist_2_If_1_False; // 0x11d0(0x20)
	double Compute_Twist_2_Compute_Twist_2_ArrayGetAtIndex_Element; // 0x11f0(0x08)
	int32_t Compute_Twist_2_Compute_Twist_2_ArrayIterator_Index; // 0x11f8(0x04)
	float Compute_Twist_2_Twist_Blend_Transform_1_1_Compute_Twist_2_Twist_Blend_Transform_1_1_MathQuaternionSlerp_1_4_T; // 0x11fc(0x04)
	struct FTransform Compute_Twist_2_Twist_Blend_Transform_1_1_Compute_Twist_2_Twist_Blend_Transform_1_1_MathTransformMul_1_2_Result; // 0x1200(0x60)
	struct FTransform Compute_Twist_2_Twist_Blend_Transform_1_1_Compute_Twist_2_Twist_Blend_Transform_1_1_MathTransformLerp_1_4_Result; // 0x1260(0x60)
	double Compute_Twist_2_Compute_Twist_2_ArrayGetAtIndex_1_Element; // 0x12c0(0x08)
	float Compute_Twist_2_Twist_Blend_Transform_1_1_Compute_Twist_2_Twist_Blend_Transform_1_1_MathTransformLerp_1_4_T; // 0x12c8(0x04)
	char pad_12CC[0x4]; // 0x12cc(0x04)
	struct FTransform Compute_Twist_2_Twist_Blend_Transform_1_1_Compute_Twist_2_Twist_Blend_Transform_1_1_GetTransform_7_1_2_Transform; // 0x12d0(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_2_Twist_Blend_Transform_1_1_Compute_Twist_2_Twist_Blend_Transform_1_1_GetTransform_7_1_2_CachedIndex; // 0x1330(0x10)
	struct FTransform Compute_Twist_2_Twist_Blend_Transform_1_1_Compute_Twist_2_Twist_Blend_Transform_1_1_SetTransform_1_2_Transform__IO; // 0x1340(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_2_Twist_Blend_Transform_1_1_Compute_Twist_2_Twist_Blend_Transform_1_1_SetTransform_1_2_CachedIndex; // 0x13a0(0x10)
	int32_t Compute_Twist_2_Compute_Twist_2_ArrayIterator_Count; // 0x13b0(0x04)
	float Compute_Twist_2_Compute_Twist_2_ArrayIterator_Ratio; // 0x13b4(0x04)
	char Compute_Twist_2_Compute_Twist_2_ArrayIterator_Continue : 1; // 0x13b8(0x01)
	char pad_13B8_1 : 7; // 0x13b8(0x01)
	char pad_13B9[0x7]; // 0x13b9(0x07)
	struct FTransform Compute_Twist_3_Compute_Twist_3_MathTransformMakeRelative_3_6_1_Local; // 0x13c0(0x60)
	struct FTransform Compute_Twist_3_Compute_Twist_3_GetTransform_6_5_1_Transform; // 0x1420(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_3_Compute_Twist_3_GetTransform_6_5_1_CachedIndex; // 0x1480(0x10)
	struct FTransform Compute_Twist_3_Compute_Twist_3_GetTransform_6_1_4_1_Transform; // 0x1490(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_3_Compute_Twist_3_GetTransform_6_1_4_1_CachedIndex; // 0x14f0(0x10)
	struct FQuat Compute_Twist_3_Blend_Swing_Inverse_Twist_8_Compute_Twist_3_Blend_Swing_Inverse_Twist_8_MathQuaternionInverse_3_4_Result; // 0x1500(0x20)
	struct FQuat Compute_Twist_3_Blend_Swing_Inverse_Twist_8_Compute_Twist_3_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Twist; // 0x1520(0x20)
	struct FQuat Compute_Twist_3_Blend_Swing_Inverse_Twist_8_Compute_Twist_3_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Input; // 0x1540(0x20)
	struct FQuat Compute_Twist_3_Blend_Swing_Inverse_Twist_8_Compute_Twist_3_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Swing; // 0x1560(0x20)
	struct FQuat Compute_Twist_3_Blend_Swing_Inverse_Twist_8_Compute_Twist_3_Blend_Swing_Inverse_Twist_8_MathQuaternionMul_19_Result; // 0x1580(0x20)
	struct FQuat Compute_Twist_3_Blend_Swing_Inverse_Twist_8_Compute_Twist_3_Blend_Swing_Inverse_Twist_8_MathQuaternionSlerp_2_4_Result; // 0x15a0(0x20)
	struct FQuat Compute_Twist_3_Blend_Swing_Inverse_Twist_8_Compute_Twist_3_Blend_Swing_Inverse_Twist_8_MathQuaternionInverse_2_3_Result; // 0x15c0(0x20)
	struct TArray<struct FCachedRigElement> Compute_Twist_3_Compute_Twist_3_SetRotation_2_2_CachedIndex; // 0x15e0(0x10)
	struct FTransform Compute_Twist_3_Compute_Twist_3_MathTransformMakeRelative_3_4_2_1_Local; // 0x15f0(0x60)
	struct FTransform Compute_Twist_3_Compute_Twist_3_GetTransform_6_2_2_1_Transform; // 0x1650(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_3_Compute_Twist_3_GetTransform_6_2_2_1_CachedIndex; // 0x16b0(0x10)
	struct FTransform Compute_Twist_3_Compute_Twist_3_GetTransform_6_1_1_2_1_Transform; // 0x16c0(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_3_Compute_Twist_3_GetTransform_6_1_1_2_1_CachedIndex; // 0x1720(0x10)
	struct FRigElementKey Compute_Twist_3_Compute_Twist_3_ArrayIterator_Element; // 0x1730(0x0c)
	char pad_173C[0x4]; // 0x173c(0x04)
	struct FQuat Compute_Twist_3_Twist_Blend_Transform_1_1_Compute_Twist_3_Twist_Blend_Transform_1_1_MathQuaternionSlerp_1_4_Result; // 0x1740(0x20)
	struct FQuat Compute_Twist_3_Compute_Twist_3_If_1_Result; // 0x1760(0x20)
	struct FQuat Compute_Twist_3_Compute_Twist_3_MathQuaternionSwingTwist_3_2_1_Twist; // 0x1780(0x20)
	struct FQuat Compute_Twist_3_Compute_Twist_3_MathQuaternionSwingTwist_3_2_1_Input; // 0x17a0(0x20)
	struct FQuat Compute_Twist_3_Compute_Twist_3_MathQuaternionSwingTwist_3_2_1_Swing; // 0x17c0(0x20)
	struct FQuat Compute_Twist_3_Compute_Twist_3_If_1_False; // 0x17e0(0x20)
	double Compute_Twist_3_Compute_Twist_3_ArrayGetAtIndex_Element; // 0x1800(0x08)
	int32_t Compute_Twist_3_Compute_Twist_3_ArrayIterator_Index; // 0x1808(0x04)
	float Compute_Twist_3_Twist_Blend_Transform_1_1_Compute_Twist_3_Twist_Blend_Transform_1_1_MathQuaternionSlerp_1_4_T; // 0x180c(0x04)
	struct FTransform Compute_Twist_3_Twist_Blend_Transform_1_1_Compute_Twist_3_Twist_Blend_Transform_1_1_MathTransformMul_1_2_Result; // 0x1810(0x60)
	struct FTransform Compute_Twist_3_Twist_Blend_Transform_1_1_Compute_Twist_3_Twist_Blend_Transform_1_1_MathTransformLerp_1_4_Result; // 0x1870(0x60)
	double Compute_Twist_3_Compute_Twist_3_ArrayGetAtIndex_1_Element; // 0x18d0(0x08)
	float Compute_Twist_3_Twist_Blend_Transform_1_1_Compute_Twist_3_Twist_Blend_Transform_1_1_MathTransformLerp_1_4_T; // 0x18d8(0x04)
	char pad_18DC[0x4]; // 0x18dc(0x04)
	struct FTransform Compute_Twist_3_Twist_Blend_Transform_1_1_Compute_Twist_3_Twist_Blend_Transform_1_1_GetTransform_7_1_2_Transform; // 0x18e0(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_3_Twist_Blend_Transform_1_1_Compute_Twist_3_Twist_Blend_Transform_1_1_GetTransform_7_1_2_CachedIndex; // 0x1940(0x10)
	struct FTransform Compute_Twist_3_Twist_Blend_Transform_1_1_Compute_Twist_3_Twist_Blend_Transform_1_1_SetTransform_1_2_Transform__IO; // 0x1950(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_3_Twist_Blend_Transform_1_1_Compute_Twist_3_Twist_Blend_Transform_1_1_SetTransform_1_2_CachedIndex; // 0x19b0(0x10)
	int32_t Compute_Twist_3_Compute_Twist_3_ArrayIterator_Count; // 0x19c0(0x04)
	float Compute_Twist_3_Compute_Twist_3_ArrayIterator_Ratio; // 0x19c4(0x04)
	char Compute_Twist_3_Compute_Twist_3_ArrayIterator_Continue : 1; // 0x19c8(0x01)
	char pad_19C8_1 : 7; // 0x19c8(0x01)
	char pad_19C9[0x7]; // 0x19c9(0x07)
	struct FTransform Compute_Twist_4_Compute_Twist_4_MathTransformMakeRelative_3_6_1_Local; // 0x19d0(0x60)
	struct FTransform Compute_Twist_4_Compute_Twist_4_GetTransform_6_5_1_Transform; // 0x1a30(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_4_Compute_Twist_4_GetTransform_6_5_1_CachedIndex; // 0x1a90(0x10)
	struct FTransform Compute_Twist_4_Compute_Twist_4_GetTransform_6_1_4_1_Transform; // 0x1aa0(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_4_Compute_Twist_4_GetTransform_6_1_4_1_CachedIndex; // 0x1b00(0x10)
	struct FQuat Compute_Twist_4_Blend_Swing_Inverse_Twist_8_Compute_Twist_4_Blend_Swing_Inverse_Twist_8_MathQuaternionInverse_3_4_Result; // 0x1b10(0x20)
	struct FQuat Compute_Twist_4_Blend_Swing_Inverse_Twist_8_Compute_Twist_4_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Twist; // 0x1b30(0x20)
	struct FQuat Compute_Twist_4_Blend_Swing_Inverse_Twist_8_Compute_Twist_4_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Input; // 0x1b50(0x20)
	struct FQuat Compute_Twist_4_Blend_Swing_Inverse_Twist_8_Compute_Twist_4_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Swing; // 0x1b70(0x20)
	struct FQuat Compute_Twist_4_Blend_Swing_Inverse_Twist_8_Compute_Twist_4_Blend_Swing_Inverse_Twist_8_MathQuaternionMul_19_Result; // 0x1b90(0x20)
	struct FQuat Compute_Twist_4_Blend_Swing_Inverse_Twist_8_Compute_Twist_4_Blend_Swing_Inverse_Twist_8_MathQuaternionSlerp_2_4_Result; // 0x1bb0(0x20)
	struct FQuat Compute_Twist_4_Blend_Swing_Inverse_Twist_8_Compute_Twist_4_Blend_Swing_Inverse_Twist_8_MathQuaternionInverse_2_3_Result; // 0x1bd0(0x20)
	struct TArray<struct FCachedRigElement> Compute_Twist_4_Compute_Twist_4_SetRotation_2_2_CachedIndex; // 0x1bf0(0x10)
	struct FTransform Compute_Twist_4_Compute_Twist_4_MathTransformMakeRelative_3_4_2_1_Local; // 0x1c00(0x60)
	struct FTransform Compute_Twist_4_Compute_Twist_4_GetTransform_6_2_2_1_Transform; // 0x1c60(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_4_Compute_Twist_4_GetTransform_6_2_2_1_CachedIndex; // 0x1cc0(0x10)
	struct FTransform Compute_Twist_4_Compute_Twist_4_GetTransform_6_1_1_2_1_Transform; // 0x1cd0(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_4_Compute_Twist_4_GetTransform_6_1_1_2_1_CachedIndex; // 0x1d30(0x10)
	struct FRigElementKey Compute_Twist_4_Compute_Twist_4_ArrayIterator_Element; // 0x1d40(0x0c)
	char pad_1D4C[0x4]; // 0x1d4c(0x04)
	struct FQuat Compute_Twist_4_Twist_Blend_Transform_1_1_Compute_Twist_4_Twist_Blend_Transform_1_1_MathQuaternionSlerp_1_4_Result; // 0x1d50(0x20)
	struct FQuat Compute_Twist_4_Compute_Twist_4_If_1_Result; // 0x1d70(0x20)
	struct FQuat Compute_Twist_4_Compute_Twist_4_MathQuaternionSwingTwist_3_2_1_Twist; // 0x1d90(0x20)
	struct FQuat Compute_Twist_4_Compute_Twist_4_MathQuaternionSwingTwist_3_2_1_Input; // 0x1db0(0x20)
	struct FQuat Compute_Twist_4_Compute_Twist_4_MathQuaternionSwingTwist_3_2_1_Swing; // 0x1dd0(0x20)
	struct FQuat Compute_Twist_4_Compute_Twist_4_If_1_False; // 0x1df0(0x20)
	double Compute_Twist_4_Compute_Twist_4_ArrayGetAtIndex_Element; // 0x1e10(0x08)
	int32_t Compute_Twist_4_Compute_Twist_4_ArrayIterator_Index; // 0x1e18(0x04)
	float Compute_Twist_4_Twist_Blend_Transform_1_1_Compute_Twist_4_Twist_Blend_Transform_1_1_MathQuaternionSlerp_1_4_T; // 0x1e1c(0x04)
	struct FTransform Compute_Twist_4_Twist_Blend_Transform_1_1_Compute_Twist_4_Twist_Blend_Transform_1_1_MathTransformMul_1_2_Result; // 0x1e20(0x60)
	struct FTransform Compute_Twist_4_Twist_Blend_Transform_1_1_Compute_Twist_4_Twist_Blend_Transform_1_1_MathTransformLerp_1_4_Result; // 0x1e80(0x60)
	double Compute_Twist_4_Compute_Twist_4_ArrayGetAtIndex_1_Element; // 0x1ee0(0x08)
	float Compute_Twist_4_Twist_Blend_Transform_1_1_Compute_Twist_4_Twist_Blend_Transform_1_1_MathTransformLerp_1_4_T; // 0x1ee8(0x04)
	char pad_1EEC[0x4]; // 0x1eec(0x04)
	struct FTransform Compute_Twist_4_Twist_Blend_Transform_1_1_Compute_Twist_4_Twist_Blend_Transform_1_1_GetTransform_7_1_2_Transform; // 0x1ef0(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_4_Twist_Blend_Transform_1_1_Compute_Twist_4_Twist_Blend_Transform_1_1_GetTransform_7_1_2_CachedIndex; // 0x1f50(0x10)
	struct FTransform Compute_Twist_4_Twist_Blend_Transform_1_1_Compute_Twist_4_Twist_Blend_Transform_1_1_SetTransform_1_2_Transform__IO; // 0x1f60(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_4_Twist_Blend_Transform_1_1_Compute_Twist_4_Twist_Blend_Transform_1_1_SetTransform_1_2_CachedIndex; // 0x1fc0(0x10)
	int32_t Compute_Twist_4_Compute_Twist_4_ArrayIterator_Count; // 0x1fd0(0x04)
	float Compute_Twist_4_Compute_Twist_4_ArrayIterator_Ratio; // 0x1fd4(0x04)
	char Compute_Twist_4_Compute_Twist_4_ArrayIterator_Continue : 1; // 0x1fd8(0x01)
	char pad_1FD8_1 : 7; // 0x1fd8(0x01)
	char pad_1FD9[0x7]; // 0x1fd9(0x07)
	struct FTransform Compute_Twist_1_1_Compute_Twist_1_1_MathTransformMakeRelative_3_6_1_Local; // 0x1fe0(0x60)
	struct FTransform Compute_Twist_1_1_Compute_Twist_1_1_GetTransform_6_5_1_Transform; // 0x2040(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_1_1_Compute_Twist_1_1_GetTransform_6_5_1_CachedIndex; // 0x20a0(0x10)
	struct FTransform Compute_Twist_1_1_Compute_Twist_1_1_GetTransform_6_1_4_1_Transform; // 0x20b0(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_1_1_Compute_Twist_1_1_GetTransform_6_1_4_1_CachedIndex; // 0x2110(0x10)
	struct FQuat Compute_Twist_1_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_1_1_Blend_Swing_Inverse_Twist_8_MathQuaternionInverse_3_4_Result; // 0x2120(0x20)
	struct FQuat Compute_Twist_1_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_1_1_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Twist; // 0x2140(0x20)
	struct FQuat Compute_Twist_1_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_1_1_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Input; // 0x2160(0x20)
	struct FQuat Compute_Twist_1_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_1_1_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Swing; // 0x2180(0x20)
	struct FQuat Compute_Twist_1_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_1_1_Blend_Swing_Inverse_Twist_8_MathQuaternionMul_19_Result; // 0x21a0(0x20)
	struct FQuat Compute_Twist_1_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_1_1_Blend_Swing_Inverse_Twist_8_MathQuaternionSlerp_2_4_Result; // 0x21c0(0x20)
	struct FQuat Compute_Twist_1_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_1_1_Blend_Swing_Inverse_Twist_8_MathQuaternionInverse_2_3_Result; // 0x21e0(0x20)
	struct TArray<struct FCachedRigElement> Compute_Twist_1_1_Compute_Twist_1_1_SetRotation_2_2_CachedIndex; // 0x2200(0x10)
	struct FTransform Compute_Twist_1_1_Compute_Twist_1_1_MathTransformMakeRelative_3_4_2_1_Local; // 0x2210(0x60)
	struct FTransform Compute_Twist_1_1_Compute_Twist_1_1_GetTransform_6_2_2_1_Transform; // 0x2270(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_1_1_Compute_Twist_1_1_GetTransform_6_2_2_1_CachedIndex; // 0x22d0(0x10)
	struct FTransform Compute_Twist_1_1_Compute_Twist_1_1_GetTransform_6_1_1_2_1_Transform; // 0x22e0(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_1_1_Compute_Twist_1_1_GetTransform_6_1_1_2_1_CachedIndex; // 0x2340(0x10)
	struct FRigElementKey Compute_Twist_1_1_Compute_Twist_1_1_ArrayIterator_Element; // 0x2350(0x0c)
	char pad_235C[0x4]; // 0x235c(0x04)
	struct FQuat Compute_Twist_1_1_Twist_Blend_Transform_1_1_Compute_Twist_1_1_Twist_Blend_Transform_1_1_MathQuaternionSlerp_1_4_Result; // 0x2360(0x20)
	struct FQuat Compute_Twist_1_1_Compute_Twist_1_1_If_1_Result; // 0x2380(0x20)
	struct FQuat Compute_Twist_1_1_Compute_Twist_1_1_MathQuaternionSwingTwist_3_2_1_Twist; // 0x23a0(0x20)
	struct FQuat Compute_Twist_1_1_Compute_Twist_1_1_MathQuaternionSwingTwist_3_2_1_Input; // 0x23c0(0x20)
	struct FQuat Compute_Twist_1_1_Compute_Twist_1_1_MathQuaternionSwingTwist_3_2_1_Swing; // 0x23e0(0x20)
	struct FQuat Compute_Twist_1_1_Compute_Twist_1_1_If_1_False; // 0x2400(0x20)
	double Compute_Twist_1_1_Compute_Twist_1_1_ArrayGetAtIndex_Element; // 0x2420(0x08)
	int32_t Compute_Twist_1_1_Compute_Twist_1_1_ArrayIterator_Index; // 0x2428(0x04)
	float Compute_Twist_1_1_Twist_Blend_Transform_1_1_Compute_Twist_1_1_Twist_Blend_Transform_1_1_MathQuaternionSlerp_1_4_T; // 0x242c(0x04)
	struct FTransform Compute_Twist_1_1_Twist_Blend_Transform_1_1_Compute_Twist_1_1_Twist_Blend_Transform_1_1_MathTransformMul_1_2_Result; // 0x2430(0x60)
	struct FTransform Compute_Twist_1_1_Twist_Blend_Transform_1_1_Compute_Twist_1_1_Twist_Blend_Transform_1_1_MathTransformLerp_1_4_Result; // 0x2490(0x60)
	double Compute_Twist_1_1_Compute_Twist_1_1_ArrayGetAtIndex_1_Element; // 0x24f0(0x08)
	float Compute_Twist_1_1_Twist_Blend_Transform_1_1_Compute_Twist_1_1_Twist_Blend_Transform_1_1_MathTransformLerp_1_4_T; // 0x24f8(0x04)
	char pad_24FC[0x4]; // 0x24fc(0x04)
	struct FTransform Compute_Twist_1_1_Twist_Blend_Transform_1_1_Compute_Twist_1_1_Twist_Blend_Transform_1_1_GetTransform_7_1_2_Transform; // 0x2500(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_1_1_Twist_Blend_Transform_1_1_Compute_Twist_1_1_Twist_Blend_Transform_1_1_GetTransform_7_1_2_CachedIndex; // 0x2560(0x10)
	struct FTransform Compute_Twist_1_1_Twist_Blend_Transform_1_1_Compute_Twist_1_1_Twist_Blend_Transform_1_1_SetTransform_1_2_Transform__IO; // 0x2570(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_1_1_Twist_Blend_Transform_1_1_Compute_Twist_1_1_Twist_Blend_Transform_1_1_SetTransform_1_2_CachedIndex; // 0x25d0(0x10)
	int32_t Compute_Twist_1_1_Compute_Twist_1_1_ArrayIterator_Count; // 0x25e0(0x04)
	float Compute_Twist_1_1_Compute_Twist_1_1_ArrayIterator_Ratio; // 0x25e4(0x04)
	char Compute_Twist_1_1_Compute_Twist_1_1_ArrayIterator_Continue : 1; // 0x25e8(0x01)
	char pad_25E8_1 : 7; // 0x25e8(0x01)
	char pad_25E9[0x7]; // 0x25e9(0x07)
	struct FTransform Compute_Twist_2_1_Compute_Twist_2_1_MathTransformMakeRelative_3_6_1_Local; // 0x25f0(0x60)
	struct FTransform Compute_Twist_2_1_Compute_Twist_2_1_GetTransform_6_5_1_Transform; // 0x2650(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_2_1_Compute_Twist_2_1_GetTransform_6_5_1_CachedIndex; // 0x26b0(0x10)
	struct FTransform Compute_Twist_2_1_Compute_Twist_2_1_GetTransform_6_1_4_1_Transform; // 0x26c0(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_2_1_Compute_Twist_2_1_GetTransform_6_1_4_1_CachedIndex; // 0x2720(0x10)
	struct FQuat Compute_Twist_2_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_2_1_Blend_Swing_Inverse_Twist_8_MathQuaternionInverse_3_4_Result; // 0x2730(0x20)
	struct FQuat Compute_Twist_2_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_2_1_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Twist; // 0x2750(0x20)
	struct FQuat Compute_Twist_2_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_2_1_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Input; // 0x2770(0x20)
	struct FQuat Compute_Twist_2_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_2_1_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Swing; // 0x2790(0x20)
	struct FQuat Compute_Twist_2_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_2_1_Blend_Swing_Inverse_Twist_8_MathQuaternionMul_19_Result; // 0x27b0(0x20)
	struct FQuat Compute_Twist_2_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_2_1_Blend_Swing_Inverse_Twist_8_MathQuaternionSlerp_2_4_Result; // 0x27d0(0x20)
	struct FQuat Compute_Twist_2_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_2_1_Blend_Swing_Inverse_Twist_8_MathQuaternionInverse_2_3_Result; // 0x27f0(0x20)
	struct TArray<struct FCachedRigElement> Compute_Twist_2_1_Compute_Twist_2_1_SetRotation_2_2_CachedIndex; // 0x2810(0x10)
	struct FTransform Compute_Twist_2_1_Compute_Twist_2_1_MathTransformMakeRelative_3_4_2_1_Local; // 0x2820(0x60)
	struct FTransform Compute_Twist_2_1_Compute_Twist_2_1_GetTransform_6_2_2_1_Transform; // 0x2880(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_2_1_Compute_Twist_2_1_GetTransform_6_2_2_1_CachedIndex; // 0x28e0(0x10)
	struct FTransform Compute_Twist_2_1_Compute_Twist_2_1_GetTransform_6_1_1_2_1_Transform; // 0x28f0(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_2_1_Compute_Twist_2_1_GetTransform_6_1_1_2_1_CachedIndex; // 0x2950(0x10)
	struct FRigElementKey Compute_Twist_2_1_Compute_Twist_2_1_ArrayIterator_Element; // 0x2960(0x0c)
	char pad_296C[0x4]; // 0x296c(0x04)
	struct FQuat Compute_Twist_2_1_Twist_Blend_Transform_1_1_Compute_Twist_2_1_Twist_Blend_Transform_1_1_MathQuaternionSlerp_1_4_Result; // 0x2970(0x20)
	struct FQuat Compute_Twist_2_1_Compute_Twist_2_1_If_1_Result; // 0x2990(0x20)
	struct FQuat Compute_Twist_2_1_Compute_Twist_2_1_MathQuaternionSwingTwist_3_2_1_Twist; // 0x29b0(0x20)
	struct FQuat Compute_Twist_2_1_Compute_Twist_2_1_MathQuaternionSwingTwist_3_2_1_Input; // 0x29d0(0x20)
	struct FQuat Compute_Twist_2_1_Compute_Twist_2_1_MathQuaternionSwingTwist_3_2_1_Swing; // 0x29f0(0x20)
	struct FQuat Compute_Twist_2_1_Compute_Twist_2_1_If_1_False; // 0x2a10(0x20)
	double Compute_Twist_2_1_Compute_Twist_2_1_ArrayGetAtIndex_Element; // 0x2a30(0x08)
	int32_t Compute_Twist_2_1_Compute_Twist_2_1_ArrayIterator_Index; // 0x2a38(0x04)
	float Compute_Twist_2_1_Twist_Blend_Transform_1_1_Compute_Twist_2_1_Twist_Blend_Transform_1_1_MathQuaternionSlerp_1_4_T; // 0x2a3c(0x04)
	struct FTransform Compute_Twist_2_1_Twist_Blend_Transform_1_1_Compute_Twist_2_1_Twist_Blend_Transform_1_1_MathTransformMul_1_2_Result; // 0x2a40(0x60)
	struct FTransform Compute_Twist_2_1_Twist_Blend_Transform_1_1_Compute_Twist_2_1_Twist_Blend_Transform_1_1_MathTransformLerp_1_4_Result; // 0x2aa0(0x60)
	double Compute_Twist_2_1_Compute_Twist_2_1_ArrayGetAtIndex_1_Element; // 0x2b00(0x08)
	float Compute_Twist_2_1_Twist_Blend_Transform_1_1_Compute_Twist_2_1_Twist_Blend_Transform_1_1_MathTransformLerp_1_4_T; // 0x2b08(0x04)
	char pad_2B0C[0x4]; // 0x2b0c(0x04)
	struct FTransform Compute_Twist_2_1_Twist_Blend_Transform_1_1_Compute_Twist_2_1_Twist_Blend_Transform_1_1_GetTransform_7_1_2_Transform; // 0x2b10(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_2_1_Twist_Blend_Transform_1_1_Compute_Twist_2_1_Twist_Blend_Transform_1_1_GetTransform_7_1_2_CachedIndex; // 0x2b70(0x10)
	struct FTransform Compute_Twist_2_1_Twist_Blend_Transform_1_1_Compute_Twist_2_1_Twist_Blend_Transform_1_1_SetTransform_1_2_Transform__IO; // 0x2b80(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_2_1_Twist_Blend_Transform_1_1_Compute_Twist_2_1_Twist_Blend_Transform_1_1_SetTransform_1_2_CachedIndex; // 0x2be0(0x10)
	int32_t Compute_Twist_2_1_Compute_Twist_2_1_ArrayIterator_Count; // 0x2bf0(0x04)
	float Compute_Twist_2_1_Compute_Twist_2_1_ArrayIterator_Ratio; // 0x2bf4(0x04)
	char Compute_Twist_2_1_Compute_Twist_2_1_ArrayIterator_Continue : 1; // 0x2bf8(0x01)
	char pad_2BF8_1 : 7; // 0x2bf8(0x01)
	char pad_2BF9[0x7]; // 0x2bf9(0x07)
	struct FTransform Compute_Twist_3_1_Compute_Twist_3_1_MathTransformMakeRelative_3_6_1_Local; // 0x2c00(0x60)
	struct FTransform Compute_Twist_3_1_Compute_Twist_3_1_GetTransform_6_5_1_Transform; // 0x2c60(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_3_1_Compute_Twist_3_1_GetTransform_6_5_1_CachedIndex; // 0x2cc0(0x10)
	struct FTransform Compute_Twist_3_1_Compute_Twist_3_1_GetTransform_6_1_4_1_Transform; // 0x2cd0(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_3_1_Compute_Twist_3_1_GetTransform_6_1_4_1_CachedIndex; // 0x2d30(0x10)
	struct FQuat Compute_Twist_3_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_3_1_Blend_Swing_Inverse_Twist_8_MathQuaternionInverse_3_4_Result; // 0x2d40(0x20)
	struct FQuat Compute_Twist_3_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_3_1_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Twist; // 0x2d60(0x20)
	struct FQuat Compute_Twist_3_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_3_1_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Input; // 0x2d80(0x20)
	struct FQuat Compute_Twist_3_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_3_1_Blend_Swing_Inverse_Twist_8_MathQuaternionSwingTwist_5_Swing; // 0x2da0(0x20)
	struct FQuat Compute_Twist_3_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_3_1_Blend_Swing_Inverse_Twist_8_MathQuaternionMul_19_Result; // 0x2dc0(0x20)
	struct FQuat Compute_Twist_3_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_3_1_Blend_Swing_Inverse_Twist_8_MathQuaternionSlerp_2_4_Result; // 0x2de0(0x20)
	struct FQuat Compute_Twist_3_1_Blend_Swing_Inverse_Twist_8_Compute_Twist_3_1_Blend_Swing_Inverse_Twist_8_MathQuaternionInverse_2_3_Result; // 0x2e00(0x20)
	struct TArray<struct FCachedRigElement> Compute_Twist_3_1_Compute_Twist_3_1_SetRotation_2_2_CachedIndex; // 0x2e20(0x10)
	struct FTransform Compute_Twist_3_1_Compute_Twist_3_1_MathTransformMakeRelative_3_4_2_1_Local; // 0x2e30(0x60)
	struct FTransform Compute_Twist_3_1_Compute_Twist_3_1_GetTransform_6_2_2_1_Transform; // 0x2e90(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_3_1_Compute_Twist_3_1_GetTransform_6_2_2_1_CachedIndex; // 0x2ef0(0x10)
	struct FTransform Compute_Twist_3_1_Compute_Twist_3_1_GetTransform_6_1_1_2_1_Transform; // 0x2f00(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_3_1_Compute_Twist_3_1_GetTransform_6_1_1_2_1_CachedIndex; // 0x2f60(0x10)
	struct FRigElementKey Compute_Twist_3_1_Compute_Twist_3_1_ArrayIterator_Element; // 0x2f70(0x0c)
	char pad_2F7C[0x4]; // 0x2f7c(0x04)
	struct FQuat Compute_Twist_3_1_Twist_Blend_Transform_1_1_Compute_Twist_3_1_Twist_Blend_Transform_1_1_MathQuaternionSlerp_1_4_Result; // 0x2f80(0x20)
	struct FQuat Compute_Twist_3_1_Compute_Twist_3_1_If_1_Result; // 0x2fa0(0x20)
	struct FQuat Compute_Twist_3_1_Compute_Twist_3_1_MathQuaternionSwingTwist_3_2_1_Twist; // 0x2fc0(0x20)
	struct FQuat Compute_Twist_3_1_Compute_Twist_3_1_MathQuaternionSwingTwist_3_2_1_Input; // 0x2fe0(0x20)
	struct FQuat Compute_Twist_3_1_Compute_Twist_3_1_MathQuaternionSwingTwist_3_2_1_Swing; // 0x3000(0x20)
	struct FQuat Compute_Twist_3_1_Compute_Twist_3_1_If_1_False; // 0x3020(0x20)
	double Compute_Twist_3_1_Compute_Twist_3_1_ArrayGetAtIndex_Element; // 0x3040(0x08)
	int32_t Compute_Twist_3_1_Compute_Twist_3_1_ArrayIterator_Index; // 0x3048(0x04)
	float Compute_Twist_3_1_Twist_Blend_Transform_1_1_Compute_Twist_3_1_Twist_Blend_Transform_1_1_MathQuaternionSlerp_1_4_T; // 0x304c(0x04)
	struct FTransform Compute_Twist_3_1_Twist_Blend_Transform_1_1_Compute_Twist_3_1_Twist_Blend_Transform_1_1_MathTransformMul_1_2_Result; // 0x3050(0x60)
	struct FTransform Compute_Twist_3_1_Twist_Blend_Transform_1_1_Compute_Twist_3_1_Twist_Blend_Transform_1_1_MathTransformLerp_1_4_Result; // 0x30b0(0x60)
	double Compute_Twist_3_1_Compute_Twist_3_1_ArrayGetAtIndex_1_Element; // 0x3110(0x08)
	float Compute_Twist_3_1_Twist_Blend_Transform_1_1_Compute_Twist_3_1_Twist_Blend_Transform_1_1_MathTransformLerp_1_4_T; // 0x3118(0x04)
	char pad_311C[0x4]; // 0x311c(0x04)
	struct FTransform Compute_Twist_3_1_Twist_Blend_Transform_1_1_Compute_Twist_3_1_Twist_Blend_Transform_1_1_GetTransform_7_1_2_Transform; // 0x3120(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_3_1_Twist_Blend_Transform_1_1_Compute_Twist_3_1_Twist_Blend_Transform_1_1_GetTransform_7_1_2_CachedIndex; // 0x3180(0x10)
	struct FTransform Compute_Twist_3_1_Twist_Blend_Transform_1_1_Compute_Twist_3_1_Twist_Blend_Transform_1_1_SetTransform_1_2_Transform__IO; // 0x3190(0x60)
	struct TArray<struct FCachedRigElement> Compute_Twist_3_1_Twist_Blend_Transform_1_1_Compute_Twist_3_1_Twist_Blend_Transform_1_1_SetTransform_1_2_CachedIndex; // 0x31f0(0x10)
	int32_t Compute_Twist_3_1_Compute_Twist_3_1_ArrayIterator_Count; // 0x3200(0x04)
	float Compute_Twist_3_1_Compute_Twist_3_1_ArrayIterator_Ratio; // 0x3204(0x04)
	char Compute_Twist_3_1_Compute_Twist_3_1_ArrayIterator_Continue : 1; // 0x3208(0x01)
	char pad_3208_1 : 7; // 0x3208(0x01)
	char pad_3209[0x3]; // 0x3209(0x03)
	struct FRigElementKey Compute_Half_Fingers_Compute_Half_Fingers_ArrayIterator_Element; // 0x320c(0x0c)
	char pad_3218[0x8]; // 0x3218(0x08)
	struct FQuat Compute_Half_Fingers_Compute_Half_Fingers_MathQuaternionFromRotator_1_Result; // 0x3220(0x20)
	struct FRotator Compute_Half_Fingers_Compute_Half_Fingers_MathQuaternionToRotator_Result; // 0x3240(0x18)
	char pad_3258[0x8]; // 0x3258(0x08)
	struct FQuat Compute_Half_Fingers_Compute_Half_Fingers_MathQuaternionSlerp_5_1_Result; // 0x3260(0x20)
	struct FQuat Compute_Half_Fingers_Compute_Half_Fingers_MathQuaternionInverse_3_4_1_Result; // 0x3280(0x20)
	struct FTransform Compute_Half_Fingers_Compute_Half_Fingers_MathTransformMakeRelative_3_5_Local; // 0x32a0(0x60)
	struct FTransform Compute_Half_Fingers_Compute_Half_Fingers_GetTransform_6_4_Transform; // 0x3300(0x60)
	struct FRigElementKey Compute_Half_Fingers_Compute_Half_Fingers_HierarchyGetParent_Parent; // 0x3360(0x0c)
	char pad_336C[0x4]; // 0x336c(0x04)
	struct TArray<struct FCachedRigElement> Compute_Half_Fingers_Compute_Half_Fingers_HierarchyGetParent_CachedChild; // 0x3370(0x10)
	struct TArray<struct FCachedRigElement> Compute_Half_Fingers_Compute_Half_Fingers_HierarchyGetParent_CachedParent; // 0x3380(0x10)
	struct TArray<struct FCachedRigElement> Compute_Half_Fingers_Compute_Half_Fingers_GetTransform_6_4_CachedIndex; // 0x3390(0x10)
	struct FTransform Compute_Half_Fingers_Compute_Half_Fingers_GetTransform_6_1_3_Transform; // 0x33a0(0x60)
	struct TArray<struct FCachedRigElement> Compute_Half_Fingers_Compute_Half_Fingers_GetTransform_6_1_3_CachedIndex; // 0x3400(0x10)
	struct FQuat Compute_Half_Fingers_Compute_Half_Fingers_MathQuaternionInverse_3_4_1_Value; // 0x3410(0x20)
	float Compute_Half_Fingers_Compute_Half_Fingers_MathFloatRemap_1_Result; // 0x3430(0x04)
	char pad_3434[0x4]; // 0x3434(0x04)
	struct FRotator Compute_Half_Fingers_Compute_Half_Fingers_MathQuaternionToRotator_1_Result; // 0x3438(0x18)
	float Compute_Half_Fingers_Compute_Half_Fingers_MathFloatRemap_1_Value; // 0x3450(0x04)
	float Compute_Half_Fingers_Compute_Half_Fingers_MathFloatRemap_1_TargetMinimum; // 0x3454(0x04)
	struct FRotator Compute_Half_Fingers_Compute_Half_Fingers_MathQuaternionToRotator_2_Result; // 0x3458(0x18)
	float Compute_Half_Fingers_Compute_Half_Fingers_MathFloatRemap_1_TargetMaximum; // 0x3470(0x04)
	char pad_3474[0x4]; // 0x3474(0x04)
	struct FRotator Compute_Half_Fingers_Compute_Half_Fingers_MathQuaternionFromRotator_1_Rotator__IO; // 0x3478(0x18)
	struct FTransform Compute_Half_Fingers_Compute_Half_Fingers_SetTransform_8_Transform__IO; // 0x3490(0x60)
	struct TArray<struct FCachedRigElement> Compute_Half_Fingers_Compute_Half_Fingers_SetTransform_8_CachedIndex; // 0x34f0(0x10)
	int32_t Compute_Half_Fingers_Compute_Half_Fingers_ArrayIterator_Index; // 0x3500(0x04)
	int32_t Compute_Half_Fingers_Compute_Half_Fingers_ArrayIterator_Count; // 0x3504(0x04)
	float Compute_Half_Fingers_Compute_Half_Fingers_ArrayIterator_Ratio; // 0x3508(0x04)
	char Compute_Half_Fingers_Compute_Half_Fingers_ArrayIterator_Continue : 1; // 0x350c(0x01)
	char pad_350C_1 : 7; // 0x350c(0x01)
};

