// ControlRigBlueprintGeneratedClass Neck_CtrlRig.Neck_CtrlRig_C
// Size: 0x4a8 (Inherited: 0x490)
struct UNeck_CtrlRig_C : UControlRig {
	double neckCorrMultU; // 0x490(0x08)
	double neckCorrMultM; // 0x498(0x08)
	double neckCorrMultD; // 0x4a0(0x08)
};

// RigVMMemoryStorageGeneratorClass Neck_CtrlRig.RigVMMemory_Literal
// Size: 0x108 (Inherited: 0x28)
struct URigVMMemory_Literal : URigVMMemoryStorage {
	struct FName SetCurveValue_1_Curve__Const; // 0x28(0x08)
	struct FRigElementKey GetTransform_2_1_Item__Const; // 0x30(0x0c)
	enum class EBoneGetterSetterMode GetTransform_2_1_Space__Const; // 0x3c(0x01)
	char GetTransform_2_1_bInitial__Const : 1; // 0x3d(0x01)
	char pad_3D_1 : 7; // 0x3d(0x01)
	char GetTransform_1_2_1_bInitial__Const : 1; // 0x3e(0x01)
	char pad_3E_1 : 7; // 0x3e(0x01)
	char pad_3F[0x1]; // 0x3f(0x01)
	float MathFloatRemap_1_SourceMinimum__Const; // 0x40(0x04)
	float MathFloatRemap_1_SourceMaximum__Const; // 0x44(0x04)
	float MathFloatRemap_1_TargetMaximum__Const; // 0x48(0x04)
	struct FName SetCurveValue_Curve__Const; // 0x4c(0x08)
	float MathFloatRemap_SourceMaximum__Const; // 0x54(0x04)
	struct FName SetCurveValue_2_Curve__Const; // 0x58(0x08)
	float MathFloatRemap_2_SourceMaximum__Const; // 0x60(0x04)
	struct FName SetCurveValue_1_1_Curve__Const; // 0x64(0x08)
	float MathFloatRemap_2_3_SourceMaximum__Const; // 0x6c(0x04)
	struct FName SetCurveValue_2_1_Curve__Const; // 0x70(0x08)
	float MathFloatRemap_2_4_SourceMaximum__Const; // 0x78(0x04)
	struct FName SetCurveValue_1_1_1_Curve__Const; // 0x7c(0x08)
	struct FName SetCurveValue_1_2_Curve__Const; // 0x84(0x08)
	struct FRigElementKey GetTransform_2_Item__Const; // 0x8c(0x0c)
	float MathFloatRemap_1_1_SourceMaximum__Const; // 0x98(0x04)
	struct FName SetCurveValue_3_Curve__Const; // 0x9c(0x08)
	struct FName SetCurveValue_2_2_Curve__Const; // 0xa4(0x08)
	float MathFloatRemap_2_2_SourceMaximum__Const; // 0xac(0x04)
	struct FName SetCurveValue_1_1_2_Curve__Const; // 0xb0(0x08)
	struct FName SetCurveValue_2_1_1_Curve__Const; // 0xb8(0x08)
	float MathFloatRemap_2_4_1_SourceMaximum__Const; // 0xc0(0x04)
	struct FName SetCurveValue_1_1_1_1_Curve__Const; // 0xc4(0x08)
	struct FName SetCurveValue_1_2_1_Curve__Const; // 0xcc(0x08)
	struct FRigElementKey GetTransform_Item__Const; // 0xd4(0x0c)
	struct FName SetCurveValue_3_1_Curve__Const; // 0xe0(0x08)
	struct FName SetCurveValue_2_2_1_Curve__Const; // 0xe8(0x08)
	struct FName SetCurveValue_1_1_2_1_Curve__Const; // 0xf0(0x08)
	struct FName SetCurveValue_2_1_1_1_Curve__Const; // 0xf8(0x08)
	struct FName SetCurveValue_1_1_1_1_1_Curve__Const; // 0x100(0x08)
};

// RigVMMemoryStorageGeneratorClass Neck_CtrlRig.RigVMMemory_Work
// Size: 0x7c8 (Inherited: 0x28)
struct URigVMMemory_Work : URigVMMemoryStorage {
	char pad_28[0x8]; // 0x28(0x08)
	struct FControlRigExecuteContext ExecuteContext_; // 0x30(0xc0)
	float MathFloatMul_Result; // 0xf0(0x04)
	float MathFloatMul_A; // 0xf4(0x04)
	float MathFloatRemap_1_Result; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct FRotator MathQuaternionToRotator_Result; // 0x100(0x18)
	char pad_118[0x8]; // 0x118(0x08)
	struct FTransform MathTransformMakeRelative_Local; // 0x120(0x60)
	struct FTransform GetTransform_2_1_Transform; // 0x180(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_2_1_CachedIndex; // 0x1e0(0x10)
	struct FTransform GetTransform_1_2_1_Transform; // 0x1f0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_1_2_1_CachedIndex; // 0x250(0x10)
	struct FQuat MathQuaternionToRotator_Value; // 0x260(0x20)
	float MathFloatRemap_1_Value; // 0x280(0x04)
	char pad_284[0x4]; // 0x284(0x04)
	struct TArray<struct FCachedRigElement> SetCurveValue_1_CachedCurveIndex; // 0x288(0x10)
	float MathFloatMul_1_Result; // 0x298(0x04)
	float MathFloatMul_1_A; // 0x29c(0x04)
	float MathFloatRemap_Result; // 0x2a0(0x04)
	float MathFloatRemap_Value; // 0x2a4(0x04)
	struct TArray<struct FCachedRigElement> SetCurveValue_CachedCurveIndex; // 0x2a8(0x10)
	float MathFloatMul_2_Result; // 0x2b8(0x04)
	float MathFloatMul_2_A; // 0x2bc(0x04)
	float MathFloatRemap_2_Result; // 0x2c0(0x04)
	float MathFloatRemap_2_Value; // 0x2c4(0x04)
	struct TArray<struct FCachedRigElement> SetCurveValue_2_CachedCurveIndex; // 0x2c8(0x10)
	float MathFloatMul_1_1_Result; // 0x2d8(0x04)
	float MathFloatMul_1_1_A; // 0x2dc(0x04)
	float MathFloatRemap_2_3_Result; // 0x2e0(0x04)
	float MathFloatRemap_2_3_Value; // 0x2e4(0x04)
	struct TArray<struct FCachedRigElement> SetCurveValue_1_1_CachedCurveIndex; // 0x2e8(0x10)
	float MathFloatMul_2_1_Result; // 0x2f8(0x04)
	float MathFloatMul_2_1_A; // 0x2fc(0x04)
	float MathFloatRemap_2_4_Result; // 0x300(0x04)
	float MathFloatRemap_2_4_Value; // 0x304(0x04)
	struct TArray<struct FCachedRigElement> SetCurveValue_2_1_CachedCurveIndex; // 0x308(0x10)
	float MathFloatMul_1_1_1_Result; // 0x318(0x04)
	float MathFloatMul_1_1_1_A; // 0x31c(0x04)
	float MathFloatRemap_2_3_1_Result; // 0x320(0x04)
	float MathFloatRemap_2_3_1_Value; // 0x324(0x04)
	struct TArray<struct FCachedRigElement> SetCurveValue_1_1_1_CachedCurveIndex; // 0x328(0x10)
	float MathFloatMul_3_Result; // 0x338(0x04)
	float MathFloatMul_3_A; // 0x33c(0x04)
	float MathFloatRemap_1_1_Result; // 0x340(0x04)
	char pad_344[0x4]; // 0x344(0x04)
	struct FRotator MathQuaternionToRotator_3_Result; // 0x348(0x18)
	struct FTransform MathTransformMakeRelative_2_Local; // 0x360(0x60)
	struct FTransform GetTransform_2_Transform; // 0x3c0(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_2_CachedIndex; // 0x420(0x10)
	struct FTransform GetTransform_1_2_Transform; // 0x430(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_1_2_CachedIndex; // 0x490(0x10)
	struct FQuat MathQuaternionToRotator_3_Value; // 0x4a0(0x20)
	float MathFloatRemap_1_1_Value; // 0x4c0(0x04)
	char pad_4C4[0x4]; // 0x4c4(0x04)
	struct TArray<struct FCachedRigElement> SetCurveValue_1_2_CachedCurveIndex; // 0x4c8(0x10)
	float MathFloatMul_1_2_Result; // 0x4d8(0x04)
	float MathFloatMul_1_2_A; // 0x4dc(0x04)
	float MathFloatRemap_5_Result; // 0x4e0(0x04)
	float MathFloatRemap_5_Value; // 0x4e4(0x04)
	struct TArray<struct FCachedRigElement> SetCurveValue_3_CachedCurveIndex; // 0x4e8(0x10)
	float MathFloatMul_3_1_Result; // 0x4f8(0x04)
	float MathFloatMul_3_1_A; // 0x4fc(0x04)
	float MathFloatRemap_2_2_Result; // 0x500(0x04)
	float MathFloatRemap_2_2_Value; // 0x504(0x04)
	struct TArray<struct FCachedRigElement> SetCurveValue_2_2_CachedCurveIndex; // 0x508(0x10)
	float MathFloatMul_1_2_1_Result; // 0x518(0x04)
	float MathFloatMul_1_2_1_A; // 0x51c(0x04)
	float MathFloatRemap_2_3_2_Result; // 0x520(0x04)
	float MathFloatRemap_2_3_2_Value; // 0x524(0x04)
	struct TArray<struct FCachedRigElement> SetCurveValue_1_1_2_CachedCurveIndex; // 0x528(0x10)
	float MathFloatMul_3_1_1_Result; // 0x538(0x04)
	float MathFloatMul_3_1_1_A; // 0x53c(0x04)
	float MathFloatRemap_2_4_1_Result; // 0x540(0x04)
	float MathFloatRemap_2_4_1_Value; // 0x544(0x04)
	struct TArray<struct FCachedRigElement> SetCurveValue_2_1_1_CachedCurveIndex; // 0x548(0x10)
	float MathFloatMul_1_2_1_1_Result; // 0x558(0x04)
	float MathFloatMul_1_2_1_1_A; // 0x55c(0x04)
	float MathFloatRemap_2_3_1_1_Result; // 0x560(0x04)
	float MathFloatRemap_2_3_1_1_Value; // 0x564(0x04)
	struct TArray<struct FCachedRigElement> SetCurveValue_1_1_1_1_CachedCurveIndex; // 0x568(0x10)
	float MathFloatMul_3_2_Result; // 0x578(0x04)
	float MathFloatMul_3_2_A; // 0x57c(0x04)
	float MathFloatRemap_1_1_2_Result; // 0x580(0x04)
	char pad_584[0x4]; // 0x584(0x04)
	struct FRotator MathQuaternionToRotator_3_1_Result; // 0x588(0x18)
	struct FTransform MathTransformMakeRelative_2_1_Local; // 0x5a0(0x60)
	struct FTransform GetTransform_Transform; // 0x600(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_CachedIndex; // 0x660(0x10)
	struct FTransform GetTransform_1_Transform; // 0x670(0x60)
	struct TArray<struct FCachedRigElement> GetTransform_1_CachedIndex; // 0x6d0(0x10)
	struct FQuat MathQuaternionToRotator_3_1_Value; // 0x6e0(0x20)
	float MathFloatRemap_1_1_2_Value; // 0x700(0x04)
	char pad_704[0x4]; // 0x704(0x04)
	struct TArray<struct FCachedRigElement> SetCurveValue_1_2_1_CachedCurveIndex; // 0x708(0x10)
	float MathFloatMul_1_2_2_Result; // 0x718(0x04)
	float MathFloatMul_1_2_2_A; // 0x71c(0x04)
	float MathFloatRemap_5_1_Result; // 0x720(0x04)
	float MathFloatRemap_5_1_Value; // 0x724(0x04)
	struct TArray<struct FCachedRigElement> SetCurveValue_3_1_CachedCurveIndex; // 0x728(0x10)
	float MathFloatMul_3_2_1_Result; // 0x738(0x04)
	float MathFloatMul_3_2_1_A; // 0x73c(0x04)
	float MathFloatRemap_2_2_1_Result; // 0x740(0x04)
	float MathFloatRemap_2_2_1_Value; // 0x744(0x04)
	struct TArray<struct FCachedRigElement> SetCurveValue_2_2_1_CachedCurveIndex; // 0x748(0x10)
	float MathFloatMul_1_2_2_1_Result; // 0x758(0x04)
	float MathFloatMul_1_2_2_1_A; // 0x75c(0x04)
	float MathFloatRemap_2_3_2_1_Result; // 0x760(0x04)
	float MathFloatRemap_2_3_2_1_Value; // 0x764(0x04)
	struct TArray<struct FCachedRigElement> SetCurveValue_1_1_2_1_CachedCurveIndex; // 0x768(0x10)
	float MathFloatMul_3_2_1_1_Result; // 0x778(0x04)
	float MathFloatMul_3_2_1_1_A; // 0x77c(0x04)
	float MathFloatRemap_2_4_1_1_Result; // 0x780(0x04)
	float MathFloatRemap_2_4_1_1_Value; // 0x784(0x04)
	struct TArray<struct FCachedRigElement> SetCurveValue_2_1_1_1_CachedCurveIndex; // 0x788(0x10)
	float MathFloatMul_1_2_2_1_1_Result; // 0x798(0x04)
	float MathFloatMul_1_2_2_1_1_A; // 0x79c(0x04)
	float MathFloatRemap_2_3_1_1_1_Result; // 0x7a0(0x04)
	float MathFloatRemap_2_3_1_1_1_Value; // 0x7a4(0x04)
	struct TArray<struct FCachedRigElement> SetCurveValue_1_1_1_1_1_CachedCurveIndex; // 0x7a8(0x10)
	struct TArray<struct FRigUnit_RigLogic_Data> RigLogic_Data; // 0x7b8(0x10)
};

