// AnimBlueprintGeneratedClass Priya_Menu.Priya_Menu_C
// Size: 0x660 (Inherited: 0x350)
struct UPriya_Menu_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x350(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x358(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x360(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x368(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x388(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x3b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x3d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x400(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x428(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x468(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x488(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x4c8(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x4e8(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x528(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x548(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x588(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5a8(0xb8)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function Priya_Menu.Priya_Menu_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Priya_Menu_AnimGraphNode_TransitionResult_900C4B7F47B24526817CADB523C48F13(); // Function Priya_Menu.Priya_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Priya_Menu_AnimGraphNode_TransitionResult_900C4B7F47B24526817CADB523C48F13 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Priya_Menu_AnimGraphNode_TransitionResult_9244F8324B87F82EE5B4C49BF78A65FF(); // Function Priya_Menu.Priya_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Priya_Menu_AnimGraphNode_TransitionResult_9244F8324B87F82EE5B4C49BF78A65FF // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Priya_Menu_AnimGraphNode_TransitionResult_287B1A2846BB9F7A5CA97BA2D2A0306B(); // Function Priya_Menu.Priya_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Priya_Menu_AnimGraphNode_TransitionResult_287B1A2846BB9F7A5CA97BA2D2A0306B // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Priya_Menu_AnimGraphNode_TransitionResult_8729EC19457902791AE225AF1EA15747(); // Function Priya_Menu.Priya_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Priya_Menu_AnimGraphNode_TransitionResult_8729EC19457902791AE225AF1EA15747 // (BlueprintEvent) // @ game+0x2552560
	void ExecuteUbergraph_Priya_Menu(int32_t EntryPoint); // Function Priya_Menu.Priya_Menu_C.ExecuteUbergraph_Priya_Menu // (Final|UbergraphFunction) // @ game+0x2552560
};

