// AnimBlueprintGeneratedClass Rachel_Menu.Rachel_Menu_C
// Size: 0x660 (Inherited: 0x350)
struct URachel_Menu_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x350(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x358(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x360(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x368(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x388(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x3b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x3d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x400(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x428(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x468(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x488(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x4c8(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x4e8(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x528(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x548(0x40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x588(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5a8(0xb8)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function Rachel_Menu.Rachel_Menu_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Rachel_Menu_AnimGraphNode_TransitionResult_34447EBF4EF4954394D2CC9C5630BF11(); // Function Rachel_Menu.Rachel_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Rachel_Menu_AnimGraphNode_TransitionResult_34447EBF4EF4954394D2CC9C5630BF11 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Rachel_Menu_AnimGraphNode_TransitionResult_D8AE947E4FFDDED5AF12B492F852D9AB(); // Function Rachel_Menu.Rachel_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Rachel_Menu_AnimGraphNode_TransitionResult_D8AE947E4FFDDED5AF12B492F852D9AB // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Rachel_Menu_AnimGraphNode_TransitionResult_680A53B545739ABDE4CED0902ABF4DD5(); // Function Rachel_Menu.Rachel_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Rachel_Menu_AnimGraphNode_TransitionResult_680A53B545739ABDE4CED0902ABF4DD5 // (BlueprintEvent) // @ game+0x2552560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Rachel_Menu_AnimGraphNode_TransitionResult_CED709964FAF8AA8A83AC1ACE50C1FC2(); // Function Rachel_Menu.Rachel_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Rachel_Menu_AnimGraphNode_TransitionResult_CED709964FAF8AA8A83AC1ACE50C1FC2 // (BlueprintEvent) // @ game+0x2552560
	void ExecuteUbergraph_Rachel_Menu(int32_t EntryPoint); // Function Rachel_Menu.Rachel_Menu_C.ExecuteUbergraph_Rachel_Menu // (Final|UbergraphFunction) // @ game+0x2552560
};

