// ScriptStruct Rachel_Menu.Rachel_Menu_C.AnimBlueprintGeneratedConstantData
// Size: 0x150 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName __NameProperty_80; // 0x04(0x08)
	struct FName __NameProperty_81; // 0x0c(0x08)
	int32_t __IntProperty_82; // 0x14(0x04)
	struct FName __NameProperty_83; // 0x18(0x08)
	int32_t __IntProperty_84; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_85; // 0x28(0x08)
	struct FName __NameProperty_86; // 0x30(0x08)
	int32_t __IntProperty_87; // 0x38(0x04)
	bool __BoolProperty_88; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	float __FloatProperty_89; // 0x40(0x04)
	struct FInputScaleBiasClampConstants __StructProperty_90; // 0x44(0x2c)
	float __FloatProperty_91; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct UAnimSequenceBase* __AnimSequenceBase_92; // 0x78(0x08)
	bool __BoolProperty_93; // 0x80(0x01)
	enum class EAnimSyncMethod __EnumProperty_94; // 0x81(0x01)
	enum class EAnimGroupRole __ByteProperty_95; // 0x82(0x01)
	char pad_83[0x1]; // 0x83(0x01)
	struct FName __NameProperty_96; // 0x84(0x08)
	struct FName __NameProperty_97; // 0x8c(0x08)
	int32_t __IntProperty_98; // 0x94(0x04)
	struct FAnimNodeFunctionRef __StructProperty_99; // 0x98(0x20)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xb8(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x138(0x18)
};

